# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


GeneratedFileFooter= <!--\n Este archivo se ha generado en: [{0}].\n-->\n
GeneratedFileLocation=Ubicaci\u00F3n del archivo generado: [{0}]
FileExists=No se ha podido exportar la configuraci\u00F3n del equilibrador de carga. El archivo [{0}] ya existe. 
ParentFileMissing=No se ha podido exportar la configuraci\u00F3n del equilibrador de carga. El directorio [{0}] no existe. 
LbDeviceNotConfigured=El host o el puerto de administraci\u00F3n no se ha configurado para el equilibrador de carga {0}.
LbDoesNotExist=No hay ning\u00FAn equilibrador de carga configurado con el nombre {0}.
UnableToGetLbConfig=No existe ninguna configuraci\u00F3n de equilibrador de carga con el nombre {0}.
UnableToGetLoadbalancer=No hay ning\u00FAn equilibrador de carga configurado con el nombre {0}.
UnableToResolveSystemProperty=No se ha podido resolver la propiedad del sistema {0} para la instancia {1}.
NoLoadbalancersConfigured=No hay ning\u00FAn equilibrador de carga configurado.
HttpError=El servidor web que aloja el equilibrador de carga ha devuelto la repuesta "{0} {1}" para la URL de solicitud de aplicaci\u00F3n de cambios {2}. Compruebe la configuraci\u00F3n y los certificados SSL.
CannotConnectToLBHost=No se ha podido conectar al host del equilibrador de carga {0}. Especifique un host y un puerto de administraci\u00F3n del equilibrador de carga v\u00E1lidos
CannotResolveHostName=No se ha podido resolver el nombre de host {0}.
ExportHttpLbConfigFailed=Fallo en el comando export-http-lb-config con el mensaje de error: {0}
ApplyHttpLbChangesFailed=Fallo en el comando apply-http-lb-changes con el mensaje de error: {0}
NoPeerCert=No se ha podido obtener informaci\u00F3n sobre el certificado del peer para la conexi\u00F3n al host [{0}].
NotX905Cert=El certificado del peer del host [{0}] no es compatible con X.509.
NotCertMatch=No se ha podido hacer coincidir el nombre de host [{0}] con los certificados en el ID de sesi\u00F3n SSL: [{0}].
UnableToGetNode=No se ha podido obtener el nodo correspondiente a la instancia {0}
NoConfigOrCluster=No se han proporcionado detalles de lb-config ni del cluster para generar el xml del equilibrador de carga.
UnableToDetermineType=No se ha podido determinar el tipo de la referencia {0}
ConfigBeanAndNameNull= Los par\u00E1metros de nombre y bean de configuraci\u00F3n no deben ser nulos.
LbConfigNotFound= No se ha encontrado el bean de configuraci\u00F3n para lb-config [{0}].
PropertyNotFound= No se ha encontrado el atributo [{0}] de lb-config [{1}].
ClusterNotFound= Argumento no v\u00E1lido. No se ha encontrado el cluster [{0}].
InvalidArgs= Argumento no v\u00E1lido.
ErrorFindingClusteredServers= No se han podido obtener servidores para el cluster [{0}].
ErrorFindingClusteredApplications= No se han podido obtener aplicaciones con referencias para el cluster [{0}].
ErrorFindingApplication= No se ha encontrado la aplicaci\u00F3n [{0}] para el cluster [{1}].
ConfigNotFound= No se ha encontrado la configuraci\u00F3n para el servidor [{0}].
InstanceNotFound= No se ha encontrado el servidor [{0}] en el cluster [{1}].
ServerNotFound= Argumento no v\u00E1lido. No se ha encontrado el servidor [{0}].
ServerRefNotFound= Argumento no v\u00E1lido. No se ha encontrado la referencia del servidor [{0}] en el cluster [{1}].
GetHostNameFailed=No se puede obtener el nombre de host del nodo actual.
UnknownTypeInWebModuleReader=Argumento no v\u00E1lido. El bean de configuraci\u00F3n debe ser del tipo WebModule o nulo.
MixofServerAndClusterNotSupported=Argumento no v\u00E1lido. La combinaci\u00F3n de instancias independientes y clusters no est\u00E1 soportada.
ServerPartofClusterNotSupported=Argumento no v\u00E1lido. La instancia {0} forma parte de un cluster. Proporcione clusters o instancias independientes.
ExportHttpLbConfigInvalidArgs=Argumento no v\u00E1lido. Proporcione un nombre de equilibrador de carga o bien una configuraci\u00F3n de equilibrador de carga, una lista de clusters o instancias independientes.
ClusterorInstanceNotFound=Argumento no v\u00E1lido. No se ha encontrado el cluster o la instancia independiente con el nombre {0}.
RetrieveFailed=No se ha podido recuperar el archivo {0} debido al error de E/S.

create.http.lb.usagetext=create-http-lb\n\t--devicehost <devicehost> --deviceport <deviceport> [--target <target>]\n\t[--sslproxyhost <sslproxyhost>] [--sslproxyport <sslproxyport>]\n\t[--lbpolicy <lbpolicy>] [--lbpolicymodule <lbpolicymodule>]\n\t[--healthcheckerurl <healthcheckerurl(default:/)>]\n\t[--healthcheckerinterval <healthcheckerinterval(default:30)>]\n\t[--healthcheckertimeout <healthcheckertimeout(default:10)>]\n\t[--lbenableallinstances <lbenableallinstances>]\n\t[--lbenableallapplications <lbenableallapplications>]\n\t[--lbweight <instance-name=weight[:instance-name=weight]*>]\n\t[--responsetimeout <responsetimeout(default:60)>]\n\t[--httpsrouting <httpsrouting(default:false)>]\n\t[--reloadinterval <reloadinterval(default:60)>]\n\t[--monitor <monitor(default:false)>]\n\t[--routecookie <routecookie(default:true)>]\n\t[--property <(name=value)[:name=value]*>]\n\t[-?|--help[=<help(default:false)>]]\n\tload_balancer_name
configure.lb.weight.usagetext=configure-lb-weight --cluster <cluster>\n\t[-?|--help[=<help(default:false)>]] instance=weight[:instance=weight]*
create.http.lb.ref.usagetext=create-http-lb-ref --config <config> | --lbname <lbname>\n\t[--lbpolicy <lbpolicy>] [--lbpolicymodule <lbpolicymodule>]\n\t[--healthcheckerurl <healthcheckerurl(default:/)>]\n\t[--healthcheckerinterval <healthcheckerinterval(default:30)>]\n\t[--healthcheckertimeout <healthcheckertimeout(default:10)>]\n\t[--lbenableallapplications <lbenableallapplications>]\n\t[--lbenableallinstances <lbenableallinstances>]\n\t[--lbweight <instance=weight[:instance=weight]*>]\n\t[-?|--help[=<help(default:false)>]] target
delete.http.lb.ref.usagetext=delete-http-lb-ref --config <config> | --lbname <lbname>\n\t[--force <force(default:false)>] [-?|--help[=<help(default:false)>]] target

InvalidWeightValue=Se ha especificado un valor de peso no v\u00E1lido.
NoSuchCluster=No existe el cluster {0}.
InstanceDoesNotBelongToCluster=La instancia {0} no pertenece al cluster {1}.
UnassociatedTarget=No se ha encontrado ninguna configuraci\u00F3n de equilibrador de carga en el sistema que tenga una referencia al destino indicado [{0}].
InvalidLbConfigName=Configuraci\u00F3n de equilibrador de carga no v\u00E1lida.
NullTarget=Argumento no v\u00E1lido. El nombre de destino no debe ser nulo.
InvalidTarget=Argumento no v\u00E1lido. El destino [{0}] no es un cluster ni una instancia independiente del servidor.
UnassociatedCluster=La configuraci\u00F3n del equilibrador de carga [{0}] no tiene ninguna referencia al cluster especificado [{1}].
UnassociatedServer=La configuraci\u00F3n del equilibrador de carga [{0}] no tiene ninguna referencia al servidor especificado [{1}].
FailedToAddHC=Fallo al agregar el comprobador del sistema.
HealthCheckerExists=El servidor/cluster del comprobador del sistema [{0}] ya existe.

EitherConfigOrLBName=CLI254: especifique el valor --lbname o --config, no ambos.
SpecifyConfigOrLBName=Especifique el nombre o bien la configuraci\u00F3n del equilibrador de carga.
LbConfigDoesNotExist=La configuraci\u00F3n {0} del equilibrador de carga especificada no existe.
NotCluster=[{0}] no es un cluster. Las opciones lbpolicy y lbpolicymodule s\u00F3lo se pueden especificar para los clusters.
LoadBalancerConfigNotDefined=No se ha encontrado la configuraci\u00F3n del equilibrador de carga [{0}].
LoadBalancerNotDefined=No se ha encontrado el equilibrador de carga [{0}].
ClusterNotDefined=El cluster [{0}] no se puede utilizar como destino. Aseg\u00FArese de que el cluster existe y de que se hace referencia a \u00E9l desde una configuraci\u00F3n de equilibrador de carga.
ServerNotDefined=No se ha podido utilizar el servidor [{0}] como destino en el comando de administraci\u00F3n del equilibrador de carga. Aseg\u00FArese de que el servidor existe y de que se hace referencia a \u00E9l desde una configuraci\u00F3n de equilibrador de carga.
NotStandAloneInstance=[{0}] no es una instancia independiente. S\u00F3lo se pueden agregar instancias independientes al equilibrador de carga.
FailedToAddServerRef=Fallo al agregar la referencia del servidor.
FailedToAddClusterRef=Fallo al agregar la referencia del cluster.
LBServerRefExists=La configuraci\u00F3n del equilibrador de carga ya contiene una referencia de servidor para el destino {0}.
LBClusterRefExists=La configuraci\u00F3n del equilibrador de carga ya contiene una referencia de cluster para el destino {0}.

NullLBName=Se ha especificado un nombre de equilibrador de carga nulo.
LBExists=La configuraci\u00F3n del equilibrador de carga [{0}] ya existe.
FailedToUpdateLB=Fallo al actualizar los equilibradores de carga.
HealthCheckerDoesNotExist=No existe el comprobador del sistema para el destino [{0}] en el equilibrador de carga [{1}]. No se puede suprimir.
FailedToRemoveHC=Fallo al eliminar el comprobador del sistema.

ServerNeedsToBeDisabled=Es necesario desactivar el servidor [{0}] para poder eliminarlo del equilibrador de carga.
AppsRefNotDefined=El elemento de las referencias de las aplicaciones no existe en el servidor [{0}]. No se puede utilizar como destino en el comando del equilibrador de carga.
AppsNotDisabled=Todas las aplicaciones con referencias se deben desactivar en el equilibrador de carga.
ServerNeedsToBeDisabled=Es necesario desactivar el servidor [{0}] para poder eliminarlo del equilibrador de carga.
FailedToRemoveServerRef=Fallo al eliminar la referencia de servidor.
FailedToRemoveClusterRef=Fallo al eliminar la referencia de cluster.

AppRefNotDefined=La referencia de la aplicaci\u00F3n [{0}] no existe en el servidor [{1}]. No se puede utilizar como destino en el comando del equilibrador de carga.
AppRefsNotDefined=No existen referencias de aplicaciones en el servidor {0}.
AppDisabled=La aplicaci\u00F3n [{0}] ya est\u00E1 desactivada para [{1}].
FailedToUpdateAttr=Fallo al actualizar el atributo lb-enabled para {0}.

InvalidTimeout=Valor {0} de timeout no v\u00E1lido; debe ser un n\u00FAmero positivo.
InvalidInstance=No se ha encontrado la referencia de servidor [{0}] especificada en la configuraci\u00F3n del equilibrador de carga {1}.
ServerDisabled=El servidor [{0}] ya est\u00E1 desactivado.
InvalidServer=No se ha podido utilizar el servidor [{0}] como destino en el comando de administraci\u00F3n del equilibrador de carga. Aseg\u00FArese de que el servidor existe y de que se hace referencia a \u00E9l desde una configuraci\u00F3n de equilibrador de carga.

AppEnabled=La aplicaci\u00F3n [{0}] ya est\u00E1 activada para [{1}].
ServerEnabled=El servidor [{0}] ya est\u00E1 activado.

ClusterPrefix=Cluster:
ServerPrefix=Servidor:

http_lb_admin.HealthCheckerCreated=EEADM00210: se ha creado el comprobador del sistema para {0}.
http_lb_admin.HealthCheckerDeleted=EEADM0211: se ha suprimido el comprobador del sistema para {0}.
http_lb_admin.AddServerToConfig=EEADM0212: se ha agregado el servidor {0} al equilibrador de carga {1}.
http_lb_admin.AddClusterToConfig=EEADM0213: se ha agregado el cluster {0} al equilibrador de carga {1}.
http_lb_admin.DeleteServerFromConfig=EEADM0214: se ha suprimido el servidor {0} del equilibrador de carga {1}.
http_lb_admin.DeleteClusterFromConfig=EEADM0215: se ha suprimido el cluster {0} del equilibrador de carga {1}.
http_lb_admin.NoLbConfigs=EEADM0201: no se ha definido ninguna configuraci\u00F3n de equilibrador de carga.
NoLbConfigsElement=EEADM0201: no se ha definido ninguna configuraci\u00F3n de equilibrador de carga.
NoLoadBalancersElement=EEADM0201: no se ha definido ninguna configuraci\u00F3n de equilibrador de carga.

UnableToGetAppInfo=No se ha podido obtener informaci\u00F3n para la aplicaci\u00F3n {0} del registro
UnableToGetContextRoot=No se han podido recuperar ra\u00EDces de contexto para la aplicaci\u00F3n {0} debido al error {1}

##upgrade
DeviceHostNotFound=No se ha encontrado la propiedad del host del dispositivo para el equilibrador de carga {0}. Defini\u00E9ndola como localhost.
DevicePortNotFound=No se ha encontrado la propiedad del puerto del dispositivo para el equilibrador de carga {0}. Defini\u00E9ndola como 443.
AutoApplyEnabled=La funci\u00F3n de aplicaci\u00F3n autom\u00E1tica est\u00E1 activada para el equilibrador de carga {0}. Esta funci\u00F3n no est\u00E1 disponible en GlassFish 3.1, por lo que este atributo se est\u00E1 eliminando. Los administradores deben sincronizar manualmente el xml del equilibrador de carga con el comando asadmin "apply-http-lb-changes\\".
ErrorDuringUpgrade=Se ha producido un error al actualizar la configuraci\u00F3n del equilibrador de carga {0} : {1}

loadbalancer.invalid.name=Nombre de equilibrador de carga no v\u00E1lido. El nombre debe empezar por una letra, un n\u00FAmero o un car\u00E1cter de subrayado y s\u00F3lo puede incluir letras, n\u00FAmeros y los caracteres siguientes: gui\u00F3n, punto, car\u00E1cter de subrayado, almohadilla y punto y coma.
InvalidType=Tipo no v\u00E1lido especificado. Los valores soportados para el tipo son "apache" y "otd".
directoryCreationFailed=Fallo al crear el directorio del equilibrador de carga.
