#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

add.resources=add-resources\u30B3\u30DE\u30F3\u30C9\u3092\u5B9F\u884C\u3059\u308B\u3068\u3001\u6307\u5B9A\u3055\u308C\u305FXML\u30D5\u30A1\u30A4\u30EB\u5185\u306B\u540D\u524D\u4ED8\u304D\u306E\u30EA\u30BD\u30FC\u30B9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002xml_file_path\u306F\u3001\u4F5C\u6210\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u304C\u542B\u307E\u308C\u308BXML\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3067\u3059\u3002DOCTYPE\u306F\u3001resources.xml\u30D5\u30A1\u30A4\u30EB\u5185\u3068\u540C\u69D8\u306B\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
add.resources.target=\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
add.resources.xml_file_name=\u4F5C\u6210\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u304C\u542B\u307E\u308C\u308BXML\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30D1\u30B9\u3067\u3059\u3002XML\u30D5\u30A1\u30A4\u30EB\u306F<install-dir>/domains/domain1/config\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306B\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u76F8\u5BFE\u30D1\u30B9\u3092\u6307\u5B9A\u3059\u308B\u304B\u3001\u5358\u7D14\u306BXML\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u305F\u5834\u5408\u306F\u3001<install-dir>/domains/domain1/config\u304C\u3053\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u306B\u4ED8\u52A0\u3055\u308C\u307E\u3059\u3002
add.resources.noJdbcConnectionPoolId=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u30D7\u30FC\u30EB\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
add.resources.noDataSourceClassname=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.jdbc.resource=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u3067JDBC\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
create.jdbc.resource.connectionpoolid=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3067\u3059\u3002\u8907\u6570\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u8981\u7D20\u304C\u540C\u3058\u63A5\u7D9A\u30D7\u30FC\u30EB\u8981\u7D20\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u305D\u308C\u3089\u306F\u5B9F\u884C\u6642\u306B\u540C\u3058\u30D7\u30FC\u30EB\u63A5\u7D9A\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
create.jdbc.resource.description=JDBC\u30EA\u30BD\u30FC\u30B9\u306B\u3064\u3044\u3066\u306E\u8A73\u7D30\u3092\u8AAC\u660E\u3059\u308B\u30C6\u30AD\u30B9\u30C8\u3067\u3059\u3002
create.jdbc.resource.jndi_name=JDBC\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u3067\u3059\u3002
create.jdbc.resource.enabled=JDBC\u30EA\u30BD\u30FC\u30B9\u304C\u5B9F\u884C\u6642\u306B\u4F7F\u7528\u53EF\u80FD\u304B\u3069\u3046\u304B\u3092\u5224\u65AD\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002
create.jdbc.resource.success=JDBC\u30EA\u30BD\u30FC\u30B9{0}\u306F\u6B63\u5E38\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
create.jdbc.resource.duplicate={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30EA\u30BD\u30FC\u30B9\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.jdbc.resource.fail=\u30B3\u30DE\u30F3\u30C9create-jdbc-resource\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
create.jdbc.resource.connPoolNotFound=\u5C5E\u6027\u5024(pool-name={0})\u304Cjdbc\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30EA\u30B9\u30C8\u5185\u306B\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
delete.jdbc.resource=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u3092\u9664\u53BB\u3057\u307E\u3059\u3002
delete.jdbc.resource.jdbc_resource_name=\u9664\u53BB\u3055\u308C\u308B\u3053\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u3067\u3059\u3002
delete.jdbc.resource.success=\u30B3\u30DE\u30F3\u30C9delete-jdbc-resource\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
delete.jdbc.resource.fail=\u30B3\u30DE\u30F3\u30C9create-jdbc-resource\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
delete.jdbc.resource.notfound={0}\u3068\u3044\u3046\u540D\u524D\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.jdbc.resource.resource-ref.exist=jdbc-resource [ {0} ]\u306F\u30011\u3064\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
delete.jdbc.resource.multiple.resource-refs=jdbc-resource [ {0} ]\u306F\u3001\u8907\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044
delete.jdbc.resource.no.resource-ref=jdbc-resource [ {0} ]\u306F\u3001\u30BF\u30FC\u30B2\u30C3\u30C8[ {1} ]\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u305B\u3093
delete.jdbc.resource.system-all-req.object-type=JDBC\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u3001\u30B7\u30B9\u30C6\u30E0\u5185\u3067\u69CB\u6210\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u305F\u3081\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
list.jdbc.resources=\u3059\u3079\u3066\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
list.jdbc.resources.success=\u30B3\u30DE\u30F3\u30C9list-jdbc-resources\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
list.jdbc.resources.fail=\u30B3\u30DE\u30F3\u30C9list-jdbc-resources\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
list.jdbc.resources.empty=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002

create.jdbc.connection.pool=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u767B\u9332\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.datasourceClassname=\u30D9\u30F3\u30C0\u30FC\u304B\u3089\u63D0\u4F9B\u3055\u308C\u305FJDBC\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30EA\u30BD\u30FC\u30B9\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3\u306E\u540D\u524D\u3067\u3059\u3002
create.jdbc.connection.pool.resType=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u304C\u5B9F\u88C5\u3059\u308B\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3067\u3059\u3002javax.sql.DataSource\u3001javax.sql.ConnectionPoolDataSource\u3001\u307E\u305F\u306Fjavax.sql.XADataSource\u306E\u3044\u305A\u308C\u304B\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u9069\u5207\u306A\u5024\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u3066\u3082\u3001\u6307\u5B9A\u3055\u308C\u305F\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u304C\u5B9F\u88C5\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u306B\u306F\u3001\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u304C\u3042\u308A\u307E\u305B\u3093\u3002
create.jdbc.connection.pool.steadyPoolSize=\u30D7\u30FC\u30EB\u3067\u7DAD\u6301\u3059\u308B\u63A5\u7D9A\u306E\u6700\u5C0F\u6570\u304A\u3088\u3073\u521D\u671F\u6570\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F8\u3067\u3059\u3002
create.jdbc.connection.pool.maxPoolSize=\u4F5C\u6210\u3067\u304D\u308B\u63A5\u7D9A\u306E\u6700\u5927\u6570\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F32\u3067\u3059\u3002
create.jdbc.connection.pool.maxWait=\u547C\u51FA\u3057\u5074\u306E\u5F85\u6A5F\u6642\u9593\u304C\u3053\u306E\u6642\u9593\u3092\u7D4C\u904E\u3059\u308B\u3068\u3001\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F60\u79D2\u3067\u3059\u3002\u5024\u304C0\u306E\u5834\u5408\u306F\u3001\u547C\u51FA\u3057\u5074\u306F\u7121\u671F\u9650\u306B\u5F85\u6A5F\u3059\u308B\u3088\u3046\u306B\u5F37\u5236\u7684\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
create.jdbc.connection.pool.poolResize=\u30D7\u30FC\u30EB\u304C\u63A5\u7D9A\u6570\u3092\u62E1\u5F35\u307E\u305F\u306F\u7E2E\u5C0F\u3059\u308B\u5358\u4F4D\u91CF\u3002\u30B9\u30B1\u30FC\u30EB\u30A2\u30C3\u30D7: \u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u306B\u7A7A\u304D\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u3053\u306E\u91CF\u306E\u30D7\u30FC\u30EB\u304C\u30B9\u30B1\u30FC\u30EB\u30A2\u30C3\u30D7\u3057\u307E\u3059\u3002\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3: \u7121\u52B9\u306A\u63A5\u7D9A\u3068\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u304C\u3059\u3079\u3066\u9664\u53BB\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5024\u3088\u308A\u591A\u304F\u306E\u91CF\u306E\u63A5\u7D9A\u304C\u9664\u53BB\u3055\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u3002Steadypoolsize\u304C\u78BA\u4FDD\u3055\u308C\u307E\u3059\u3002\u4F7F\u7528\u53EF\u80FD\u306A\u5024\u306F0\u304B\u3089MAX_INTEGER\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F2\u3067\u3059\u3002
create.jdbc.connection.pool.idleTimeout=\u30D7\u30FC\u30EB\u3067\u63A5\u7D9A\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u307E\u307E\u3067\u3044\u3089\u308C\u308B\u6700\u5927\u6642\u9593(\u79D2)\u3002\u3053\u306E\u6642\u9593\u304C\u7D4C\u904E\u3059\u308B\u3068\u3001\u5B9F\u88C5\u306F\u3053\u306E\u63A5\u7D9A\u3092\u9589\u3058\u3089\u308C\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5185\u3067\u4F7F\u7528\u3067\u304D\u306A\u3044\u63A5\u7D9A\u304C\u5897\u3048\u3066\u3044\u304F\u3053\u3068\u3092\u9632\u3050\u305F\u3081\u306B\u3001\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024\u306F\u30B5\u30FC\u30D0\u30FC\u5074\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024\u3088\u308A\u77ED\u304F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F300\u3067\u3059\u3002
create.jdbc.connection.pool.initSql=\u30E6\u30FC\u30B6\u30FC\u304CSQL\u6587\u5B57\u5217\u3092\u6307\u5B9A\u3059\u308B\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u3001\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB(\u518D\u5229\u7528\u3055\u308C\u308B\u63A5\u7D9A\u3067\u306F\u306A\u3044)\u304B\u3089\u4F5C\u6210\u3055\u308C\u308B\u305F\u3073\u306B\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u63A5\u7D9A\u306E\u72B6\u614B\u3092\u521D\u671F\u5316\u3059\u308B\u305F\u3081\u306B\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u5C5E\u6027\u3067\u3001\u521D\u671F\u5316SQL\u306E\u5B9F\u884C\u6642\u306B\u306F\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.isolationLevel=\u30D7\u30FC\u30EB\u3055\u308C\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u63A5\u7D9A\u306Etransaction-isolation-level\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u306F\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u306F\u3001\u30D7\u30FC\u30EB\u306FJDBC\u30C9\u30E9\u30A4\u30D0\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5206\u96E2\u30EC\u30D9\u30EB\u3067\u64CD\u4F5C\u3092\u5B9F\u884C\u3057\u307E\u3059\u3002\u6A19\u6E96\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5206\u96E2\u30EC\u30D9\u30EB(read-uncommitted\u3001read-committed\u3001repeatable-read\u3001serializable)\u306E\u3044\u305A\u308C\u304B\u3092\u4F7F\u7528\u3057\u3066\u3001\u5FC5\u8981\u306A\u5206\u96E2\u30EC\u30D9\u30EB\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002\u30D7\u30FC\u30EB\u3055\u308C\u305F\u63A5\u7D9A\u306E\u5206\u96E2\u30EC\u30D9\u30EB\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u5909\u66F4\u3059\u308B\u3068\u3001\u30D7\u30FC\u30EB\u304C\u58CA\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30D7\u30ED\u30B0\u30E9\u30E0\u30FB\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.isIsolationGuaranteed=\u3053\u308C\u306F\u3001transaction-isolation-level\u306B\u7279\u5B9A\u306E\u5206\u96E2\u30EC\u30D9\u30EB\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u3068\u304D\u306B\u306E\u307F\u9069\u7528\u3067\u304D\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u3088\u3063\u3066\u3001\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u304B\u3089\u53D6\u5F97\u3055\u308C\u308B\u305F\u3073\u306B\u5206\u96E2\u30EC\u30D9\u30EB\u304C\u76EE\u7684\u306E\u5024\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u4E00\u90E8\u306EJDBC\u30C9\u30E9\u30A4\u30D0\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u591A\u5C11\u5F71\u97FF\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u63A5\u7D9A\u3092\u8FD4\u3059\u524D\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C--isolationlevel\u3092\u5909\u66F4\u3057\u306A\u3044\u3068\u304D\u306F\u3001\u7BA1\u7406\u8005\u304C\u3053\u308C\u3092false\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002
create.jdbc.connection.pool.isConnectValidatereq=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u63A5\u7D9A\u304C\u6E21\u3055\u308C\u308B\u524D\u306B\u3001\u4F7F\u7528\u3067\u304D\u308B\u63A5\u7D9A\u304B\u3069\u3046\u304B\u304C\u691C\u8A3C\u307E\u305F\u306F\u78BA\u8A8D\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.validationMethod=\u63A5\u7D9A\u3092\u691C\u8A3C\u3059\u308B\u554F\u5408\u305B\u3092\u5B9F\u884C\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u691C\u8A3C\u8868\u306E\u540D\u524D\u3002\u6709\u52B9\u306A\u8A2D\u5B9A\u306F\u3001auto-commit\u3001meta-data\u3001\u307E\u305F\u306Ftable\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Fauto-commit\u3067\u3059\u3002
create.jdbc.connection.pool.validationTable=\u63A5\u7D9A\u3092\u691C\u8A3C\u3059\u308B\u554F\u5408\u305B\u3092\u5B9F\u884C\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u691C\u8A3C\u8868\u306E\u540D\u524D\u3002
create.jdbc.connection.pool.failConnection=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u30011\u3064\u306E\u691C\u8A3C\u30C1\u30A7\u30C3\u30AF\u306B\u5931\u6557\u3057\u305F\u969B\u306B\u30D7\u30FC\u30EB\u5185\u306E\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002\u5931\u6557\u3057\u305F\u63A5\u7D9A\u306E\u518D\u78BA\u7ACB\u304C1\u56DE\u8A66\u307F\u3089\u308C\u307E\u3059\u3002
create.jdbc.connection.pool.allowNonComponentCallers=\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u30D7\u30FC\u30EB\u306FJ2EE\u4EE5\u5916\u306E\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3001\u3064\u307E\u308AEJB\u307E\u305F\u306F\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u4EE5\u5916\u306E\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3067\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002\u8FD4\u3055\u308C\u305F\u63A5\u7D9A\u306F\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3\u304B\u3089\u53D6\u5F97\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3067\u81EA\u52D5\u7684\u306B\u767B\u9332\u3055\u308C\u307E\u3059\u3002 
create.jdbc.connection.pool.nonTransactionalConnections=\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u30D7\u30FC\u30EB\u306F\u975E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u63A5\u7D9A\u3092\u8FD4\u3057\u307E\u3059\u3002\u3053\u306E\u63A5\u7D9A\u306F\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3\u306B\u81EA\u52D5\u7684\u306B\u767B\u9332\u3055\u308C\u307E\u305B\u3093\u3002
create.jdbc.connection.pool.validateAtMostOncePeriod=\u63A5\u7D9A\u304C\u6700\u59271\u56DE\u691C\u8A3C\u3055\u308C\u308B\u9593\u9694\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F0\u3067\u3001\u7121\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.leakTimeout=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u308B\u6F5C\u5728\u7684\u306A\u63A5\u7D9A\u30EA\u30FC\u30AF\u306E\u691C\u51FA\u306B\u304A\u3044\u3066\u3001\u30E6\u30FC\u30B6\u30FC\u3092\u652F\u63F4\u3057\u307E\u3059\u3002\u6307\u5B9A\u3055\u308C\u305F\u671F\u9593\u5185\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u63A5\u7D9A\u3092\u30D7\u30FC\u30EB\u306B\u8FD4\u3055\u306A\u3044\u5834\u5408\u306F\u3001\u6F5C\u5728\u7684\u306A\u30EA\u30FC\u30AF\u3068\u898B\u306A\u3055\u308C\u3001\u547C\u51FA\u3057\u5074\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304C\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F0\u3067\u3001\u30EA\u30FC\u30AF\u306E\u691C\u51FA\u304C\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u30020\u4EE5\u5916\u306E\u6B63\u306E\u5024\u3067\u306F\u3001\u30EA\u30FC\u30AF\u306E\u691C\u51FA\u304C\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u305F\u3060\u3057\u3001\u3053\u306E\u5C5E\u6027\u306F\u3001\u63A5\u7D9A\u30EA\u30FC\u30AF\u304C\u5B58\u5728\u3059\u308B\u304B\u3069\u3046\u304B\u306E\u307F\u3092\u691C\u51FA\u3059\u308B\u3053\u3068\u306B\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u63A5\u7D9A\u3092\u518D\u5229\u7528\u3067\u304D\u308B\u306E\u306F\u3001connection-leak-reclaim\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u3067\u3059\u3002
create.jdbc.connection.pool.leakReclaim=\u6709\u52B9\u306B\u3057\u305F\u5834\u5408\u3001connection-leak-timeout-in-seconds\u306E\u767A\u751F\u5F8C\u306B\u63A5\u7D9A\u304C\u518D\u5229\u7528\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059(\u30D7\u30FC\u30EB\u306B\u623B\u3055\u308C\u308B)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.creationRetryAttempts=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F0\u3067\u3001\u518D\u8A66\u884C\u306A\u3057\u3092\u793A\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.creationRetryInterval=\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u518D\u8A66\u884C\u3059\u308B\u6642\u9593\u9593\u9694\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F10\u79D2\u3067\u3059\u3002connection-creation-retry-attempts\u304C0\u3088\u308A\u5927\u304D\u3044\u5834\u5408\u306B\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.statementTimeout=\u63A5\u7D9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3001\u5B9F\u884C\u6642\u9593\u304C\u7570\u5E38\u306B\u9577\u3044\u554F\u5408\u305B\u3092\u505C\u6B62\u3067\u304D\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306E-1\u306F\u3001\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.lazyConnectionEnlistment=\u30EA\u30BD\u30FC\u30B9\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3078\u306E\u767B\u9332\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u304C\u30E1\u30BD\u30C3\u30C9\u3067\u5B9F\u969B\u306B\u4F7F\u7528\u3055\u308C\u308B\u5834\u5408\u306B\u306E\u307F\u884C\u3063\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u4F7F\u7528\u3055\u308C\u306A\u3044\u63A5\u7D9A\u304C\u767B\u9332\u3055\u308C\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u547C\u51FA\u3057\u5074\u306E\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3067\u30AD\u30E3\u30C3\u30B7\u30E5\u3055\u308C\u3066\u3044\u308B\u63A5\u7D9A\u306E\u4E0D\u8981\u306A\u767B\u9332\u3082\u9632\u6B62\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.lazyConnectionAssociation=\u63A5\u7D9A\u306B\u5BFE\u3057\u3066\u64CD\u4F5C\u304C\u5B9F\u884C\u3055\u308C\u305F\u6642\u70B9\u3067\u521D\u3081\u3066\u63A5\u7D9A\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u307E\u3059\u3002\u307E\u305F\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u5B8C\u4E86\u3057\u3066\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u30FB\u30E1\u30BD\u30C3\u30C9\u304C\u7D42\u4E86\u3057\u305F\u3068\u304D\u306B\u95A2\u9023\u4ED8\u3051\u304C\u89E3\u9664\u3055\u308C\u308B\u305F\u3081\u3001\u7269\u7406\u7684\u306A\u63A5\u7D9A\u3092\u518D\u5229\u7528\u3057\u3084\u3059\u304F\u306A\u308A\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.associateWithThread=\u63A5\u7D9A\u3092\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u9023\u4ED8\u3051\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u540C\u3058\u30B9\u30EC\u30C3\u30C9\u304C\u63A5\u7D9A\u3092\u5FC5\u8981\u3068\u3059\u308B\u3068\u304D\u306F\u3001\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u3059\u3067\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u63A5\u7D9A\u3092\u518D\u5229\u7528\u3067\u304D\u308B\u305F\u3081\u3001\u30D7\u30FC\u30EB\u304B\u3089\u63A5\u7D9A\u3092\u53D6\u5F97\u3059\u308B\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u304C\u767A\u751F\u3057\u307E\u305B\u3093\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002(associate-with-thread-connections-count\u3082\u53C2\u7167)
create.jdbc.connection.pool.associateWithThreadConnectionsCount=\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u63A5\u7D9A\u306E\u6700\u5927\u6570\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F1\u3067\u3059\u3002associate-with-thread\u304Ctrue\u306E\u5834\u5408\u306B\u306E\u307F\u3001\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.driverClassname=\u30D9\u30F3\u30C0\u30FC\u304B\u3089\u63D0\u4F9B\u3055\u308C\u305FJDBC\u30C9\u30E9\u30A4\u30D0\u30FB\u30AF\u30E9\u30B9\u306E\u540D\u524D\u3002\u6307\u5B9A\u3055\u308C\u305F\u30C9\u30E9\u30A4\u30D0\u306F\u3001java.sql.Driver\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.matchConnections=\u30D7\u30FC\u30EB\u306B\u5BFE\u3057\u3066\u63A5\u7D9A\u30DE\u30C3\u30C1\u30F3\u30B0\u306E\u30AA\u30F3/\u30AA\u30D5\u3092\u5207\u308A\u66FF\u3048\u307E\u3059\u3002\u30D7\u30FC\u30EB\u5185\u306E\u63A5\u7D9A\u304C\u5E38\u306B\u540C\u3058\u7A2E\u985E\u3067\u3042\u308A\u3001\u30D7\u30FC\u30EB\u304B\u3089\u9078\u629E\u3057\u305F\u63A5\u7D9A\u3068\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u3092\u7167\u5408\u3059\u308B\u5FC5\u8981\u304C\u306A\u3044\u5834\u5408\u306F\u3001false\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.maxConnectionUsageCount=\u6307\u5B9A\u3057\u305F\u5834\u5408\u3001\u63A5\u7D9A\u306F\u6307\u5B9A\u3057\u305F\u56DE\u6570\u30D7\u30FC\u30EB\u3067\u518D\u5229\u7528\u3055\u308C\u3001\u305D\u306E\u5F8C\u9589\u3058\u3089\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u305F\u3068\u3048\u3070\u3001\u6587\u30EA\u30FC\u30AF\u3092\u56DE\u907F\u3059\u308B\u306E\u306B\u5F79\u7ACB\u3061\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F0\u3067\u3001\u3053\u306E\u6A5F\u80FD\u304C\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.ping=\u3053\u306E\u5C5E\u6027\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u30D7\u30FC\u30EB\u306B\u5BFE\u3057\u3066\u3001\u305D\u306E\u4F5C\u6210\u4E2D\u307E\u305F\u306F\u518D\u69CB\u6210\u4E2D\u306Bping\u304C\u5B9F\u884C\u3055\u308C\u3001\u5C5E\u6027\u306B\u5BFE\u3059\u308B\u8AA4\u3063\u305F\u5024\u304C\u3042\u308C\u3070\u305D\u308C\u3092\u8B58\u5225\u3057\u3066\u8B66\u544A\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.jdbc.connection.pool.pooling=false\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u3053\u306E\u5C5E\u6027\u306F\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002
create.jdbc.connection.pool.sqlTraceListeners=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u5B9F\u884C\u3055\u308C\u308BSQL\u6587\u3092\u30C8\u30EC\u30FC\u30B9\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u6587\u306E\u5206\u6790\u306B\u304A\u3044\u3066\u3001\u7BA1\u7406\u8005\u3092\u652F\u63F4\u3057\u307E\u3059\u3002\u8907\u6570\u306E\u30EA\u30B9\u30CA\u30FC\u3092\u3001\u30EA\u30B9\u30CA\u30FC\u5B9F\u88C5\u30AF\u30E9\u30B9\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3067\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
create.jdbc.connection.pool.statementCachesize=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30E1\u30AB\u30CB\u30BA\u30E0(\u6700\u9577\u6642\u9593\u672A\u4F7F\u7528)\u3092\u4F7F\u7528\u3057\u3066\u30AD\u30E3\u30C3\u30B7\u30E5\u3055\u308C\u308B\u6587\u306E\u6570\u306E\u8A2D\u5B9A\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306E0\u306F\u3001\u6587\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.wrapJdbcObjects=true\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306FStatement\u3001PreparedStatement\u3001CallableStatement\u3001ResultSet\u3001DatabaseMetaData\u306B\u5BFE\u3057\u3066\u30E9\u30C3\u30D7\u3055\u308C\u305FJDBC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ftrue\u3067\u3059\u3002
create.jdbc.connection.pool.validationClassname=\u30E6\u30FC\u30B6\u30FC\u304C\u5B9F\u88C5\u3057\u305F\u30AB\u30B9\u30BF\u30E0\u306E\u691C\u8A3C\u5B9F\u88C5\u30AF\u30E9\u30B9\u540D\u306E\u8A2D\u5B9A\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002connection-validation-type\u304Ccustom-validation\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u306F\u5FC5\u9808\u3067\u3059\u3002\u6307\u5B9A\u3057\u305F\u30AF\u30E9\u30B9\u540D\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
create.jdbc.connection.pool.description=\u6307\u5B9A\u3055\u308C\u305FJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u3064\u3044\u3066\u306E\u8A73\u7D30\u3092\u8AAC\u660E\u3059\u308B\u30C6\u30AD\u30B9\u30C8\u3002
create.jdbc.connection.pool.property=\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u69CB\u6210\u3059\u308B\u305F\u3081\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u5C5E\u6027\u540D/\u5024\u306E\u30DA\u30A2\u3002
create.jdbc.connection.pool.jdbc_connection_pool_id=\u4F5C\u6210\u3055\u308C\u308BJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3002
create.jdbc.connection.pool.success=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u306F\u6B63\u5E38\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
create.jdbc.connection.pool.fail=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002{1}
create.jdbc.connection.pool.duplicate={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30EA\u30BD\u30FC\u30B9\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.jdbc.connection.pool.validationtable_required=--validationmethod=table\u304B\u3064--isconnectvalidatereq=true\u306E\u5834\u5408\u3001--validationtable\u306F\u5FC5\u9808\u3067\u3059\u3002
delete.jdbc.connection.pool=\u6307\u5B9A\u3055\u308C\u305FJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u9664\u53BB\u3057\u307E\u3059\u3002
delete.jdbc.connection.pool.cascade=\u30AA\u30D7\u30B7\u30E7\u30F3\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D7\u30FC\u30EB\u81EA\u4F53\u306F\u6B8B\u308A\u307E\u3059\u304C\u3001\u30D7\u30FC\u30EB\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u3059\u3079\u3066\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002false\u306B\u8A2D\u5B9A\u3057\u305F\u3068\u304D\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u304C\u30D7\u30FC\u30EB\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D7\u30FC\u30EB\u306E\u524A\u9664\u306B\u5931\u6557\u3057\u307E\u3059\u3002\u30EA\u30BD\u30FC\u30B9\u3092\u660E\u793A\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092true\u306B\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306Ffalse\u3067\u3059\u3002
delete.jdbc.connection.pool.jdbc_connection_pool_id=\u9664\u53BB\u3055\u308C\u308BJDBC\u30EA\u30BD\u30FC\u30B9\u306E\u540D\u524D\u3067\u3059\u3002
delete.jdbc.connection.pool.success=\u30B3\u30DE\u30F3\u30C9delete-jdbc-connection pool\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
delete.jdbc.connection.pool.fail=\u30B3\u30DE\u30F3\u30C9delete-jdbc-connection-pool\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
delete.jdbc.connection.pool.notfound={0}\u3068\u3044\u3046\u540D\u524D\u306EJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.jdbc.connection.pool.noJndiName=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306BID\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
delete.jdbc.connection.pool.pool_in_use=\u4E00\u90E8\u306EJDBC\u30EA\u30BD\u30FC\u30B9\u307E\u305F\u306F\u6C38\u7D9A\u6027\u30DE\u30CD\u30FC\u30B8\u30E3\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u30FB\u30EA\u30BD\u30FC\u30B9\u304C\u3053\u306E\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002cascade\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u3001\u3053\u308C\u3089\u3082\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002
list.jdbc.connection.pools=\u3059\u3079\u3066\u306EJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
list.jdbc.connection.pools.success=\u30B3\u30DE\u30F3\u30C9list-jdbc-connection-pools\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
list.jdbc.connection.pools.fail=\u30B3\u30DE\u30F3\u30C9list-jdbc-connection-pools\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
list.jdbc.connection.pools.empty=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
ping.create.jdbc.connection.pool.fail=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u4F5C\u6210\u4E2D\u306Eping\u306E\u8A66\u884C: {0} - \u5931\u6557\u3002
ping.create.jdbc.connection.pool.success=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u4F5C\u6210\u4E2D\u306Eping\u306E\u8A66\u884C: {0} - \u6210\u529F\u3002
