#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

add.resources=La commande add-resources cr\u00E9e les ressources identifi\u00E9es dans le fichier XML indiqu\u00E9. xml_file_path est le chemin du fichier XML contenant les ressources \u00E0 cr\u00E9er. DOCTYPE doit \u00EAtre d\u00E9fini comme dans le fichier resources.xml
add.resources.target=Indique la cible pour laquelle vous cr\u00E9ez les ressources.
add.resources.xml_file_name=Chemin du fichier XML contenant les ressources \u00E0 cr\u00E9er. Le fichier XML doit se trouver dans le r\u00E9pertoire <install-dir>/domains/domain1/config. Si vous indiquez un chemin relatif ou seulement le nom du fichier XML, cette commande ajoute <install-dir>/domains/domain1/config \u00E0 cet op\u00E9rande.
add.resources.noJdbcConnectionPoolId=Nom attribu\u00E9 au pool de connexions JDBC.
add.resources.noDataSourceClassname=Aucun nom de classe de source de donn\u00E9es d\u00E9fini pour le pool de connexions JDBC.
create.jdbc.resource=Cr\u00E9ez une ressource JDBC portant le nom JNDI indiqu\u00E9.
create.jdbc.resource.connectionpoolid=Nom du pool de connexions JDBC. Si plusieurs \u00E9l\u00E9ments de ressource JDBC pointent vers le m\u00EAme \u00E9l\u00E9ment du pool de connexions, ils utilisent la m\u00EAme connexion du pool lors de l'ex\u00E9cution.
create.jdbc.resource.description=Texte de description de la ressource JDBC.
create.jdbc.resource.jndi_name=Nom JNDI de cette ressource JDBC.
create.jdbc.resource.enabled=D\u00E9termine si la ressource JDBC est activ\u00E9e durant l'ex\u00E9cution. La valeur par d\u00E9faut est true.
create.jdbc.resource.success=La ressource JDBC {0} a \u00E9t\u00E9 cr\u00E9\u00E9e.
create.jdbc.resource.duplicate=Une ressource nomm\u00E9e {0} existe d\u00E9j\u00E0.
create.jdbc.resource.fail=Echec de la commande create-jdbc-resource.
create.jdbc.resource.connPoolNotFound=Valeur d''attribut (pool-name = {0}) introuvable dans la liste de pools de connexions JDBC.
delete.jdbc.resource=Enlevez une ressource JDBC portant le nom JNDI indiqu\u00E9.
delete.jdbc.resource.jdbc_resource_name=Nom JNDI de cette ressource JDBC \u00E0 enlever.
delete.jdbc.resource.success=La commande delete-jdbc-resource a \u00E9t\u00E9 correctement ex\u00E9cut\u00E9e.
delete.jdbc.resource.fail=Echec de la commande create-jdbc-resource.
delete.jdbc.resource.notfound=La ressource JDBC nomm\u00E9e {0} n''existe pas.
delete.jdbc.resource.resource-ref.exist=La commande jdbc-resource [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans une cible d''instance/de cluster. Utilisez delete-resource-ref sur la cible correspondante.
delete.jdbc.resource.multiple.resource-refs=La commande jdbc-resource [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans plusieurs cibles d''instance/de cluster. Utilisez delete-resource-ref sur la cible correspondante.
delete.jdbc.resource.no.resource-ref=La commande jdbc-resource [ {0} ] n''est pas r\u00E9f\u00E9renc\u00E9e dans la cible [ {1} ].
delete.jdbc.resource.system-all-req.object-type=Impossible de supprimer la ressource JDBC [ {0} ] car elle doit obligatoirement \u00EAtre configur\u00E9e dans le syst\u00E8me.
list.jdbc.resources=Listez toutes les ressources JDBC.
list.jdbc.resources.success=La commande list-jdbc-resource a \u00E9t\u00E9 correctement ex\u00E9cut\u00E9e.
list.jdbc.resources.fail=Echec de la commande list-jdbc-resource.
list.jdbc.resources.empty=Rien \u00E0 r\u00E9pertorier.

create.jdbc.connection.pool=Inscrivez le pool de connexions JDBC.
create.jdbc.connection.pool.datasourceClassname=Nom du gestionnaire de ressources de source de donn\u00E9es JDBC fourni par le fournisseur.
create.jdbc.connection.pool.resType=Interface impl\u00E9ment\u00E9e par la classe datasource. Doit \u00EAtre javax.sql.DataSource, javax.sql.ConnectionPoolDataSource ou javax.sql.XADataSource. Lorsque cette option a une valeur admise, une erreur se produit si l'interface indiqu\u00E9e n'est pas impl\u00E9ment\u00E9e par la classe datasource. Cette option n'a pas de valeur par d\u00E9faut.
create.jdbc.connection.pool.steadyPoolSize=Nombre minimal et initial de connexions g\u00E9r\u00E9es dans le pool. La valeur par d\u00E9faut est 8.
create.jdbc.connection.pool.maxPoolSize=Nombre maximal de connexions pouvant \u00EAtre cr\u00E9\u00E9es. La valeur par d\u00E9faut est 32.
create.jdbc.connection.pool.maxWait=Dur\u00E9e pendant laquelle un appelant attend avant l'envoi de l'expiration d'une connexion. La valeur par d\u00E9faut est 60 secondes. Si la valeur est 0, l'appelant attend ind\u00E9finiment.
create.jdbc.connection.pool.poolResize=Nombre de connexions \u00E0 ajouter ou \u00E0 supprimer lors d'un redimensionnement du pool. Ajout : lorsque le pool ne comporte plus de connexions disponibles, ce nombre de connexions est ajout\u00E9. Suppression : toutes les connexions non valides et inactives sont supprim\u00E9es, le nombre de connexions supprim\u00E9es peut parfois \u00EAtre plus \u00E9lev\u00E9 que cette valeur. La taille de pool constante (steadypoolsize) est assur\u00E9e. Les valeurs possibles sont comprises entre 0 et MAX_INTEGER. La valeur par d\u00E9faut est 2.
create.jdbc.connection.pool.idleTimeout=Dur\u00E9e maximale (en secondes) pendant laquelle une connexion demeure inactive dans le pool. A la fin de ce d\u00E9lai, l'impl\u00E9mentation peut fermer cette connexion. La valeur de ce d\u00E9lai d'expiration doit \u00EAtre inf\u00E9rieure \u00E0 la valeur du d\u00E9lai d'expiration c\u00F4t\u00E9 serveur afin d'\u00E9viter l'accumulation de connexions inutilisables dans l'application. La valeur par d\u00E9faut est 300.
create.jdbc.connection.pool.initSql=Elle est utilis\u00E9e pour sp\u00E9cifier une cha\u00EEne SQL d\u00E9finie par l'utilisateur, \u00E0 ex\u00E9cuter lorsqu'une connexion est cr\u00E9\u00E9e \u00E0 partir du pool (et non lors de connexions recycl\u00E9es). Elle est ex\u00E9cut\u00E9e pour initialiser l'\u00E9tat de la connexion. Il s'agit d'un attribut facultatif qui doit comporter une valeur lors de l'ex\u00E9cution d'une cha\u00EEne SQL d'initialisation.
create.jdbc.connection.pool.isolationLevel=Niveau d'isolement de transaction sur les connexions de base de donn\u00E9es d'un pool. Cette option n'a pas de valeur par d\u00E9faut. Si elle n'est pas d\u00E9finie, le pool applique le niveau d'isolement par d\u00E9faut fourni par le pilote JDBC. Vous pouvez d\u00E9finir un niveau d'isolement en choisissant l'un des niveaux d'isolement de transaction standard : read-uncommitted, read-committed, repeatable-read, serializable. Les applications modifiant le niveau d'isolement sur une connexion de pool par programme risquent de polluer le pool. Cela peut entra\u00EEner des erreurs au niveau du programme.
create.jdbc.connection.pool.isIsolationGuaranteed=Ceci est applicable uniquement lorsqu'un niveau d'isolement de transaction particulier est d\u00E9fini. La valeur par d\u00E9faut est true. Cette option permet d'attribuer la valeur souhait\u00E9e au niveau d'isolement \u00E0 chaque fois qu'une connexion est obtenue \u00E0 partir du pool. Ceci peut affecter les performances de certains pilotes JDBC. Les administrateurs peuvent attribuer la valeur false lorsque l'application ne modifie pas --isolationlevel avant de renvoyer la connexion.
create.jdbc.connection.pool.isConnectValidatereq=Si la valeur est true, les connexions sont valid\u00E9es ou v\u00E9rifi\u00E9es pour d\u00E9terminer si elles sont utilisables avant leur envoi \u00E0 l'application. La valeur par d\u00E9faut est false.
create.jdbc.connection.pool.validationMethod=Nom de la table de validation utilis\u00E9e pour effectuer une requ\u00EAte de validation d'une connexion. Param\u00E8tres valides : auto-commit, meta-data ou table. La valeur par d\u00E9faut est auto-commit.
create.jdbc.connection.pool.validationTable=Nom de la table de validation utilis\u00E9e pour effectuer une requ\u00EAte de validation de connexion.
create.jdbc.connection.pool.failConnection=Si la valeur est true, toutes les connexions du pool doivent \u00EAtre ferm\u00E9es apr\u00E8s l'\u00E9chec d'une validation. La valeur par d\u00E9faut est false. Une tentative de r\u00E9tablissement des connexions en \u00E9chec est effectu\u00E9e.
create.jdbc.connection.pool.allowNonComponentCallers=Si la valeur de cette propri\u00E9t\u00E9 est true, le pool peut \u00EAtre utilis\u00E9 par des composants non J2EE, c'est-\u00E0-dire autres que du type EJB ou Servlet. La connexion renvoy\u00E9e est automatiquement enregistr\u00E9e sur le contexte de transaction du gestionnaire de transactions. 
create.jdbc.connection.pool.nonTransactionalConnections=Si la valeur de cette propri\u00E9t\u00E9 est true, le pool renvoie les connexions non transactionnelles. Cette connexion n'est pas automatiquement enregistr\u00E9e sur le gestionnaire de transactions.
create.jdbc.connection.pool.validateAtMostOncePeriod=Utilis\u00E9 pour d\u00E9finir l'intervalle dans lequel une connexion est valid\u00E9e au plus une fois. La valeur par d\u00E9faut est 0. Cela indique qu'il n'est pas activ\u00E9.
create.jdbc.connection.pool.leakTimeout=Cela permet \u00E0 l'utilisateur de d\u00E9tecter les pertes de connexion potentielles de l'application. Lorsqu'une connexion n'est pas renvoy\u00E9e vers le pool par l'application pendant la p\u00E9riode sp\u00E9cifi\u00E9e, cela suppose l'existence d'une perte potentielle ; une trace de pile du programme appelant sera journalis\u00E9e. La valeur par d\u00E9faut est 0 lorsqu'il n'existe pas de perte par d\u00E9faut. Une valeur positive non nulle active la d\u00E9tection de perte. Cependant, cet attribut d\u00E9tecte uniquement l'existence d'une perte de connexion. La connexion peut \u00EAtre r\u00E9cup\u00E9r\u00E9e uniquement si connection-leak-reclaim a la valeur true.
create.jdbc.connection.pool.leakReclaim=Si ce param\u00E8tre est activ\u00E9, la connexion peut \u00EAtre r\u00E9utilis\u00E9e (replac\u00E9e dans le pool) apr\u00E8s l'ex\u00E9cution de connection-leak-timeout-in-seconds. La valeur par d\u00E9faut est false.
create.jdbc.connection.pool.creationRetryAttempts=Nombre de tentatives de cr\u00E9ation d'une connexion. La valeur par d\u00E9faut est de 0. Cela indique l'absence de nouvelle tentative.
create.jdbc.connection.pool.creationRetryInterval=Intervalle de temps entre les nouvelles tentatives de cr\u00E9ation d'une connexion. La valeur par d\u00E9faut est de 10 secondes. Cela s'applique lorsque connection-creation-retry-attempts est sup\u00E9rieur \u00E0 0 (z\u00E9ro).
create.jdbc.connection.pool.statementTimeout=D\u00E9finit la propri\u00E9t\u00E9 de d\u00E9lai d'attente d'une connexion permettant de mettre fin aux requ\u00EAtes dont l'ex\u00E9cution est anormalement longue. La valeur par d\u00E9faut -1 indique qu'elle n'est pas activ\u00E9e.
create.jdbc.connection.pool.lazyConnectionEnlistment=Enregistrez une ressource dans la transaction uniquement lorsqu'elle est actuellement utilis\u00E9e dans une m\u00E9thode qui \u00E9vite l'enregistrement de connexions non utilis\u00E9es dans une transaction. Cela \u00E9vite \u00E9galement les enregistrements inutiles de connexions mises en cache dans les composants appelants. La valeur par d\u00E9faut est false.
create.jdbc.connection.pool.lazyConnectionAssociation=Les connexions sont associ\u00E9es en diff\u00E9r\u00E9 lorsque vous effectuez une op\u00E9ration sur ces derni\u00E8res. De plus, elles sont dissoci\u00E9es lorsque la transaction est termin\u00E9e et qu'une m\u00E9thode de composant prend fin, ce qui facilite la r\u00E9utilisation des connexions physiques. La valeur par d\u00E9faut est false.
create.jdbc.connection.pool.associateWithThread=Associez des connexions \u00E0 un thread de sorte que lorsque ce thread n\u00E9cessite une connexion, il puisse r\u00E9utiliser la connexion qui lui est d\u00E9j\u00E0 associ\u00E9e. Cela limitera le temps d'arr\u00EAt lors de l'obtention d'une connexion \u00E0 partir du pool. La valeur par d\u00E9faut est false. (voir \u00E9galement associate-with-thread-connections-count)
create.jdbc.connection.pool.associateWithThreadConnectionsCount=Nombre maximal de connexions \u00E0 associer \u00E0 un thread. La valeur par d\u00E9faut est 1. Cette valeur s'applique uniquement lorsque associate-with-thread a la valeur true.
create.jdbc.connection.pool.driverClassname=Nom du fournisseur fourni par le nom de la classe du pilote JDBC. Le pilote sp\u00E9cifi\u00E9 doit impl\u00E9menter l'interface java.sql.Driver.
create.jdbc.connection.pool.matchConnections=Activer/d\u00E9sactiver la correspondance de connexions pour le pool. Cette option peut avoir la valeur false si l'administrateur sait que les connexions du pool seront toujours homog\u00E8nes et qu'il est donc inutile d'associer une connexion emprunt\u00E9e au pool \u00E0 l'adaptateur de ressources. La valeur par d\u00E9faut est false.
create.jdbc.connection.pool.maxConnectionUsageCount=Elle permet de r\u00E9utiliser les connexions dans le pool autant de fois qu'il a \u00E9t\u00E9 sp\u00E9cifi\u00E9 avant sa fermeture. Cela permet d'\u00E9viter les pertes d'instructions, par exemple. La valeur par d\u00E9faut est 0. Cela indique que la fonctionnalit\u00E9 n'est pas activ\u00E9e.
create.jdbc.connection.pool.ping=Un pool avec cet attribut ayant la valeur true fait l'objet d'une commande Ping lors de la reconfiguration ou de la cr\u00E9ation du pool pour identifier et signaler toute valeur erron\u00E9e de ses attributs. La valeur par d\u00E9faut de cet attribut est false.
create.jdbc.connection.pool.pooling=Lorsqu'il a la valeur false, cet attribut d\u00E9sactive le groupement des connexions. La valeur par d\u00E9faut de cet attribut est true.
create.jdbc.connection.pool.sqlTraceListeners=Utilis\u00E9e pour d\u00E9finir si les instructions SQL ex\u00E9cut\u00E9es par les applications doivent \u00EAtre suivies. Permet aux administrateurs d'analyser les instructions. Plusieurs processus d'\u00E9coute peuvent \u00EAtre sp\u00E9cifi\u00E9s dans une liste de noms de classe d'impl\u00E9mentation de processus d'\u00E9coute s\u00E9par\u00E9s par des virgules.
create.jdbc.connection.pool.statementCachesize=Utilis\u00E9e pour d\u00E9finir le nombre d'instructions \u00E0 mettre en cache \u00E0 l'aide du m\u00E9canisme de mise en cache par d\u00E9faut (utilis\u00E9 le moins r\u00E9cemment). Une valeur par d\u00E9faut de 0 indique que la mise en cache des instructions n'est pas activ\u00E9e.
create.jdbc.connection.pool.wrapJdbcObjects=Lorsque ce param\u00E8tre a la valeur true, l'application obtient des objets JDBC encapsul\u00E9s pour Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. La valeur par d\u00E9faut est true.
create.jdbc.connection.pool.validationClassname=Utilis\u00E9e pour d\u00E9finir le nom de classe d'impl\u00E9mentation de validation personnalis\u00E9e impl\u00E9ment\u00E9 par l'utilisateur. Ce param\u00E8tre est obligatoire si le param\u00E8tre connection-validation-type a la valeur custom-validation. Le nom de classe fourni doit pouvoir acc\u00E9der au serveur d'applications.
create.jdbc.connection.pool.description=Texte de description du pool de connexions JDBC indiqu\u00E9.
create.jdbc.connection.pool.property=Paires nom/valeur d'attribut pour configurer le pool de connexions. (Facultatif)
create.jdbc.connection.pool.jdbc_connection_pool_id=Nom du pool de connexions JDBC \u00E0 cr\u00E9er
create.jdbc.connection.pool.success=Le pool de connexions JDBC {0} a \u00E9t\u00E9 cr\u00E9\u00E9.
create.jdbc.connection.pool.fail=Echec de la cr\u00E9ation du pool de connexions JDBC {0}. {1}
create.jdbc.connection.pool.duplicate=Une ressource nomm\u00E9e {0} existe d\u00E9j\u00E0.
create.jdbc.connection.pool.validationtable_required=L'option --validationtable est requise si les options suivantes sont pr\u00E9sentes : --validationmethod=table et --isconnectvalidatereq=true.
delete.jdbc.connection.pool=Enlevez le pool de connexions JDBC indiqu\u00E9.
delete.jdbc.connection.pool.cascade=Si la valeur de l'option est true, toutes les ressources JDBC associ\u00E9es au pool sont supprim\u00E9es, sauf le pool lui-m\u00EAme. Lorsque la valeur est false, la suppression du pool \u00E9choue si des ressources sont associ\u00E9es au pool. Vous devez supprimer les ressources explicitement ou attribuer la valeur true \u00E0 l'option. Par d\u00E9faut, la valeur de cette option est false.
delete.jdbc.connection.pool.jdbc_connection_pool_id=Nom de la ressource JDBC \u00E0 enlever.
delete.jdbc.connection.pool.success=La commande delete-jdbc-connection-pool a \u00E9t\u00E9 correctement ex\u00E9cut\u00E9e.
delete.jdbc.connection.pool.fail=Echec de la commande delete-jdbc-connection-pool
delete.jdbc.connection.pool.notfound=Le pool de connexions JDBC nomm\u00E9 {0} n''existe pas.
delete.jdbc.connection.pool.noJndiName=Aucun ID d\u00E9fini pour le pool de connexions JDBC.
delete.jdbc.connection.pool.pool_in_use=Des ressources JDBC ou des ressources de fabrique PersistenceManager font r\u00E9f\u00E9rence \u00E0 ce pool de connexions. Utilisez l'option 'cascade' pour les supprimer aussi.
list.jdbc.connection.pools=Listez tous les pools de connexions JDBC.
list.jdbc.connection.pools.success=La commande list-jdbc-connection-pools a \u00E9t\u00E9 correctement ex\u00E9cut\u00E9e.
list.jdbc.connection.pools.fail=Echec de la commande list-jdbc-connection-pools
list.jdbc.connection.pools.empty=Rien \u00E0 r\u00E9pertorier.
ping.create.jdbc.connection.pool.fail=Tentative d''envoi d''une commande Ping lors de la cr\u00E9ation du pool de connexions JDBC\u00A0: {0} - Echec.
ping.create.jdbc.connection.pool.success=Tentative d''envoi d''une commande Ping lors de la cr\u00E9ation du pool de connexions JDBC\u00A0: {0} - Succ\u00E8s.
