#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

add.resources=add-resources \uBA85\uB839\uC740 \uC9C0\uC815\uB41C XML \uD30C\uC77C\uC5D0 \uC774\uB984\uC774 \uC9C0\uC815\uB41C \uB9AC\uC18C\uC2A4\uB97C \uC0DD\uC131\uD569\uB2C8\uB2E4. xml_file_path\uB294 \uC0DD\uC131\uD560 \uB9AC\uC18C\uC2A4\uAC00 \uD3EC\uD568\uB41C XML \uD30C\uC77C\uC758 \uACBD\uB85C\uC785\uB2C8\uB2E4. DOCTYPE\uC744 resources.xml \uD30C\uC77C\uC5D0\uC11C\uCC98\uB7FC \uC9C0\uC815\uD574\uC57C \uD569\uB2C8\uB2E4.
add.resources.target=\uB9AC\uC18C\uC2A4\uB97C \uC0DD\uC131\uD560 \uB300\uC0C1\uC744 \uC9C0\uC815\uD569\uB2C8\uB2E4.
add.resources.xml_file_name=\uC0DD\uC131\uD560 \uB9AC\uC18C\uC2A4\uAC00 \uD3EC\uD568\uB41C XML \uD30C\uC77C\uC758 \uACBD\uB85C\uC785\uB2C8\uB2E4. XML \uD30C\uC77C\uC740 <install-dir>/domains/domain1/config \uB514\uB809\uD1A0\uB9AC\uC5D0 \uC788\uC5B4\uC57C \uD569\uB2C8\uB2E4. \uC0C1\uB300 \uACBD\uB85C\uB97C \uC9C0\uC815\uD558\uAC70\uB098 XML \uD30C\uC77C\uC758 \uC774\uB984\uC744 \uC785\uB825\uD558\uB294 \uACBD\uC6B0, \uC774 \uBA85\uB839\uC740 <install-dir>/domains/domain1/config\uB97C \uC774 \uD53C\uC5F0\uC0B0\uC790 \uC55E\uC5D0 \uCD94\uAC00\uD569\uB2C8\uB2E4.
add.resources.noJdbcConnectionPoolId=JDBC \uC811\uC18D \uD480\uC5D0 \uB300\uD574 \uC815\uC758\uB41C \uD480 \uC774\uB984\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
add.resources.noDataSourceClassname=JDBC \uC811\uC18D \uD480\uC5D0 \uB300\uD574 \uC815\uC758\uB41C datasourceclassname\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
create.jdbc.resource=\uC9C0\uC815\uB41C JNDI \uC774\uB984\uC758 JDBC \uB9AC\uC18C\uC2A4\uB97C \uC0DD\uC131\uD569\uB2C8\uB2E4.
create.jdbc.resource.connectionpoolid=JDBC \uC811\uC18D \uD480\uC758 \uC774\uB984\uC785\uB2C8\uB2E4. \uB450 \uAC1C \uC774\uC0C1\uC758 JDBC \uB9AC\uC18C\uC2A4 \uC694\uC18C\uAC00 \uB3D9\uC77C\uD55C \uC811\uC18D \uD480 \uC694\uC18C\uB97C \uAC00\uB9AC\uD0AC \uACBD\uC6B0 \uC774 \uC694\uC18C\uB4E4\uC740 \uB7F0\uD0C0\uC784 \uC2DC \uB3D9\uC77C\uD55C \uD480 \uC811\uC18D\uC744 \uC0AC\uC6A9\uD569\uB2C8\uB2E4.
create.jdbc.resource.description=JDBC \uB9AC\uC18C\uC2A4\uC5D0 \uB300\uD55C \uC138\uBD80 \uC124\uBA85\uC744 \uC81C\uACF5\uD558\uB294 \uD14D\uC2A4\uD2B8\uC785\uB2C8\uB2E4.
create.jdbc.resource.jndi_name=JDBC \uB9AC\uC18C\uC2A4\uC758 JNDI \uC774\uB984\uC785\uB2C8\uB2E4.
create.jdbc.resource.enabled=JDBC \uB9AC\uC18C\uC2A4\uAC00 \uB7F0\uD0C0\uC784 \uC2DC \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC5B4 \uC788\uB294\uC9C0 \uC5EC\uBD80\uB97C \uD655\uC778\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 true\uC785\uB2C8\uB2E4.
create.jdbc.resource.success=JDBC \uB9AC\uC18C\uC2A4 {0}\uC774(\uAC00) \uC131\uACF5\uC801\uC73C\uB85C \uC0DD\uC131\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
create.jdbc.resource.duplicate={0}(\uC774)\uB77C\uB294 \uB9AC\uC18C\uC2A4\uAC00 \uC874\uC7AC\uD569\uB2C8\uB2E4.
create.jdbc.resource.fail=create-jdbc-resource \uBA85\uB839\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
create.jdbc.resource.connPoolNotFound=\uC18D\uC131\uAC12(pool-name = {0})\uC774 jdbc \uC811\uC18D \uD480 \uBAA9\uB85D\uC5D0 \uC5C6\uC2B5\uB2C8\uB2E4.
delete.jdbc.resource=\uC9C0\uC815\uB41C JNDI \uC774\uB984\uC758 JDBC \uB9AC\uC18C\uC2A4\uB97C \uC81C\uAC70\uD569\uB2C8\uB2E4.
delete.jdbc.resource.jdbc_resource_name=\uC81C\uAC70\uB420 JDBC \uB9AC\uC18C\uC2A4\uC758 JNDI \uC774\uB984.
delete.jdbc.resource.success=delete-jdbc-resource \uBA85\uB839\uC774 \uC131\uACF5\uC801\uC73C\uB85C \uC2E4\uD589\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
delete.jdbc.resource.fail=create-jdbc-resource \uBA85\uB839\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
delete.jdbc.resource.notfound={0}(\uC774)\uB77C\uB294 JDBC \uB9AC\uC18C\uC2A4\uAC00 \uC874\uC7AC\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
delete.jdbc.resource.resource-ref.exist=jdbc-resource [ {0} ]\uC774(\uAC00) \uC778\uC2A4\uD134\uC2A4/\uD074\uB7EC\uC2A4\uD130 \uB300\uC0C1\uC5D0\uC11C \uCC38\uC870\uB429\uB2C8\uB2E4.\uC801\uC808\uD55C \uB300\uC0C1\uC5D0 \uB300\uD574 delete-resource-ref\uB97C \uC0AC\uC6A9\uD558\uC2ED\uC2DC\uC624.
delete.jdbc.resource.multiple.resource-refs=jdbc-resource [ {0} ]\uC774(\uAC00) \uC5EC\uB7EC \uC778\uC2A4\uD134\uC2A4/\uD074\uB7EC\uC2A4\uD130 \uB300\uC0C1\uC5D0\uC11C \uCC38\uC870\uB429\uB2C8\uB2E4. \uC801\uC808\uD55C \uB300\uC0C1\uC5D0 \uB300\uD574 delete-resource-ref\uB97C \uC0AC\uC6A9\uD558\uC2ED\uC2DC\uC624.
delete.jdbc.resource.no.resource-ref=jdbc-resource [ {0} ]\uC774(\uAC00) \uB300\uC0C1 [ {1} ]\uC5D0\uC11C \uCC38\uC870\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
delete.jdbc.resource.system-all-req.object-type=JDBC \uB9AC\uC18C\uC2A4 [ {0} ]\uC740(\uB294) \uC2DC\uC2A4\uD15C\uC5D0 \uAD6C\uC131\uD574\uC57C \uD558\uBBC0\uB85C \uC0AD\uC81C\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
list.jdbc.resources=\uBAA8\uB4E0 JDBC \uB9AC\uC18C\uC2A4\uB97C \uB098\uC5F4\uD569\uB2C8\uB2E4.
list.jdbc.resources.success=list-jdbc-resources \uBA85\uB839\uC774 \uC131\uACF5\uC801\uC73C\uB85C \uC2E4\uD589\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
list.jdbc.resources.fail=list-jdbc-resources \uBA85\uB839\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
list.jdbc.resources.empty=\uB098\uC5F4\uD560 \uAC83\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.

create.jdbc.connection.pool=JDBC \uC811\uC18D \uD480\uC744 \uB4F1\uB85D\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.datasourceClassname=\uACF5\uAE09\uC5C5\uCCB4 \uC774\uB984-\uC81C\uACF5\uB41C JDBC \uB370\uC774\uD130 \uC18C\uC2A4 \uB9AC\uC18C\uC2A4 \uAD00\uB9AC\uC790.
create.jdbc.connection.pool.resType=\uB370\uC774\uD130 \uC18C\uC2A4 \uD074\uB798\uC2A4\uC5D0\uC11C \uAD6C\uD604\uD558\uB294 \uC778\uD130\uD398\uC774\uC2A4. javax.sql.DataSource, javax.sql.ConnectionPoolDataSource \uB610\uB294 javax.sql.XADataSource \uC911 \uD558\uB098\uC5EC\uC57C \uD569\uB2C8\uB2E4. \uC774 \uC635\uC158\uC5D0 \uC62C\uBC14\uB978 \uAC12\uC774 \uC788\uACE0 \uD45C\uC2DC\uB41C \uC778\uD130\uD398\uC774\uC2A4\uAC00 \uB370\uC774\uD130 \uC18C\uC2A4\uC5D0 \uC758\uD574 \uAD6C\uD604\uB418\uC9C0 \uC54A\uC73C\uBA74 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD569\uB2C8\uB2E4. \uC774 \uC635\uC158\uC5D0\uB294 \uAE30\uBCF8\uAC12\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.steadyPoolSize=\uD480\uC5D0\uC11C \uC720\uC9C0 \uAD00\uB9AC\uB418\uB294 \uCD5C\uC18C \uBC0F \uCD08\uAE30 \uC811\uC18D \uC218. \uAE30\uBCF8\uAC12\uC740 8\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.maxPoolSize=\uC0DD\uC131\uD560 \uC218 \uC788\uB294 \uCD5C\uC18C \uC811\uC18D \uC218. \uAE30\uBCF8\uAC12\uC740 32\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.maxWait=\uD638\uCD9C\uC790\uAC00 \uC811\uC18D \uC2DC\uAC04 \uCD08\uACFC\uB97C \uBCF4\uB0B4\uAE30 \uC804\uC5D0 \uB300\uAE30\uD558\uB294 \uC2DC\uAC04. \uAE30\uBCF8\uAC12\uC740 60\uCD08\uC785\uB2C8\uB2E4. \uAC12\uC774 0\uC774\uBA74 \uD638\uCD9C\uC790\uB294 \uBB34\uAE30\uD55C \uB300\uAE30\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.poolResize=\uD480\uC5D0\uC11C \uC811\uC18D \uC218\uB97C \uB298\uB9AC\uAC70\uB098 \uC904\uC774\uB294 \uC218. \uB298\uB9AC\uAE30: \uD480\uC5D0 \uC0AC\uC6A9 \uAC00\uB2A5\uD55C \uC811\uC18D\uC774 \uC5C6\uC744 \uACBD\uC6B0 \uC774 \uC218\uB9CC\uD07C \uB298\uB9BD\uB2C8\uB2E4. \uC904\uC774\uAE30: \uBD80\uC801\uD569\uD558\uAC70\uB098 \uC720\uD734 \uC0C1\uD0DC\uC758 \uC811\uC18D\uC774 \uBAA8\uB450 \uC81C\uAC70\uB418\uBBC0\uB85C \uACBD\uC6B0\uC5D0 \uB530\uB77C \uC774 \uAC12\uBCF4\uB2E4 \uD070 \uC218\uC758 \uC811\uC18D\uC774 \uC81C\uAC70\uB429\uB2C8\uB2E4. Steadypoolsize\uB97C \uD655\uC778\uD569\uB2C8\uB2E4. \uAC00\uB2A5\uD55C \uAC12\uC740 0\uBD80\uD130 MAX_INTEGER\uAE4C\uC9C0\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 2\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.idleTimeout=\uD480\uC5D0\uC11C \uC811\uC18D\uC774 \uC720\uD734 \uC0C1\uD0DC\uB85C \uC788\uC744 \uC218 \uC788\uB294 \uCD5C\uB300 \uC2DC\uAC04(\uCD08)\uC785\uB2C8\uB2E4. \uC774 \uC2DC\uAC04\uC774 \uC9C0\uB098\uBA74 \uAD6C\uD604\uC5D0\uC11C \uC774 \uC811\uC18D\uC744 \uB2EB\uC744 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC5D0\uC11C \uC0AC\uC6A9\uD560 \uC218 \uC5C6\uB294 \uC811\uC18D\uC758 \uB204\uC801\uC744 \uBC29\uC9C0\uD558\uB824\uBA74 \uC2DC\uAC04 \uCD08\uACFC \uAC12\uC744 \uC11C\uBC84\uCE21 \uC2DC\uAC04 \uCD08\uACFC \uAC12\uBCF4\uB2E4 \uC791\uAC8C \uC720\uC9C0\uD574\uC57C \uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 300\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.initSql=\uD480\uC5D0\uC11C \uC811\uC18D\uC774 \uC0DD\uC131\uB420 \uB54C\uB9C8\uB2E4(\uC7AC\uC0AC\uC6A9\uB418\uB294 \uC811\uC18D \uC544\uB2D8) \uC2E4\uD589\uD560 SQL \uBB38\uC790\uC5F4\uC744 \uC9C0\uC815(\uC0AC\uC6A9\uC790\uC5D0 \uC758\uD574)\uD558\uB294 \uB370 \uC0AC\uC6A9\uB429\uB2C8\uB2E4. \uC774 \uC18D\uC131\uC740 \uC811\uC18D \uC0C1\uD0DC\uB97C \uCD08\uAE30\uD558\uAE30 \uC704\uD574 \uC2E4\uD589\uB429\uB2C8\uB2E4. \uC774 \uC18D\uC131\uC740 \uC120\uD0DD\uC801 \uC18D\uC131\uC73C\uB85C\uC11C \uCD08\uAE30\uD654 SQL\uC744 \uC2E4\uD589\uD560 \uB54C \uAC12\uC744 \uAC00\uC9C0\uACE0 \uC788\uC5B4\uC57C \uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.isolationLevel=\uD480\uB9C1\uB41C \uB370\uC774\uD130\uBCA0\uC774\uC2A4 \uC811\uC18D \uC0C1\uC758 transaction-isolation-level. \uC774 \uC635\uC158\uC5D0\uB294 \uAE30\uBCF8\uAC12\uC774 \uC5C6\uC2B5\uB2C8\uB2E4. \uC9C0\uC815\uD558\uC9C0 \uC54A\uC744 \uACBD\uC6B0 \uD480\uC740 JDBC \uB4DC\uB77C\uC774\uBC84\uAC00 \uC81C\uACF5\uD558\uB294 \uAE30\uBCF8 \uACA9\uB9AC \uB808\uBCA8\uB85C \uC791\uB3D9\uD569\uB2C8\uB2E4. \uD45C\uC900 \uD2B8\uB79C\uC7AD\uC158 \uACA9\uB9AC \uB808\uBCA8 \uC911 \uD558\uB098\uB97C \uC0AC\uC6A9\uD558\uC5EC \uC6D0\uD558\uB294 \uACA9\uB9AC \uB808\uBCA8(read-uncommitted, read-committed, repeatable-read, serializable)\uC744 \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uD480\uB9C1\uB41C \uC811\uC18D\uC5D0\uC11C \uACA9\uB9AC \uB808\uBCA8\uC744 \uBCC0\uACBD\uD558\uB294 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC740 \uD504\uB85C\uADF8\uB798\uBC0D \uBC29\uC2DD\uC73C\uB85C \uD480\uC744 \uBCC0\uACBD\uC2DC\uD0AC \uC704\uD5D8\uC774 \uC788\uC2B5\uB2C8\uB2E4. \uC774\uB85C \uC778\uD574 \uD504\uB85C\uADF8\uB7A8 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.isIsolationGuaranteed=\uC774\uAC83\uC740 transaction-isolation-level\uC5D0 \uD2B9\uC815 \uACA9\uB9AC \uB808\uBCA8\uC774 \uC9C0\uC815\uB41C \uACBD\uC6B0\uC5D0\uB9CC \uC801\uC6A9\uB429\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 true\uC785\uB2C8\uB2E4. \uC774 \uC635\uC158\uC744 \uC0AC\uC6A9\uD558\uBA74 \uD480\uC5D0\uC11C \uC811\uC18D\uC744 \uAC00\uC838\uC62C \uB54C\uB9C8\uB2E4 \uACA9\uB9AC \uB808\uBCA8\uC774 \uC6D0\uD558\uB294 \uAC12\uC73C\uB85C \uC124\uC815\uB429\uB2C8\uB2E4. \uC774\uAC83\uC740 JDBC \uB4DC\uB77C\uC774\uBC84\uC758 \uC131\uB2A5\uC5D0 \uB2E4\uC18C \uC601\uD5A5\uC744 \uC904 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC811\uC18D\uC744 \uBC18\uD658\uD558\uAE30 \uC804\uC5D0 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC774 --isolationlevel\uC744 \uBCC0\uACBD\uD558\uC9C0 \uC54A\uC744 \uACBD\uC6B0 \uAD00\uB9AC\uC790\uB294 \uC774 \uAC12\uC744 false\uB85C \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.isConnectValidatereq=true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0, \uC811\uC18D\uC744 \uAC80\uC99D \uBC0F \uAC80\uC0AC\uD558\uC5EC \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC73C\uB85C \uC804\uB2EC\uD558\uAE30 \uC804\uC5D0 \uD574\uB2F9 \uC811\uC18D\uC744 \uC0AC\uC6A9\uD560 \uC218 \uC788\uB294\uC9C0 \uC5EC\uBD80\uB97C \uD655\uC778\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.validationMethod=\uC9C8\uC758\uB97C \uC218\uD589\uD558\uC5EC \uC811\uC18D\uC744 \uAC80\uC99D\uD558\uB294 \uB370 \uC0AC\uC6A9\uB418\uB294 \uAC80\uC99D \uD14C\uC774\uBE14\uC758 \uC774\uB984. \uC801\uD569\uD55C \uC124\uC815\uC740 auto-commit, meta-data \uB610\uB294 table\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 auto-commit\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.validationTable=\uC9C8\uC758\uB97C \uC218\uD589\uD558\uC5EC \uC811\uC18D\uC744 \uAC80\uC99D\uD558\uB294 \uB370 \uC0AC\uC6A9\uB418\uB294 \uAC80\uC99D \uD14C\uC774\uBE14\uC758 \uC774\uB984.
create.jdbc.connection.pool.failConnection=true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0, \uB2E8\uC77C \uAC80\uC99D \uD655\uC778\uC744 \uC2E4\uD328\uD558\uBA74 \uD480\uC5D0 \uC788\uB294 \uBAA8\uB4E0 \uC811\uC18D\uC744 \uB2EB\uC544\uC57C \uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4. \uC2E4\uD328\uD55C \uC811\uC18D\uC744 \uB2E4\uC2DC \uC124\uC815\uD558\uB3C4\uB85D \uD55C \uBC88 \uC2DC\uB3C4\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.allowNonComponentCallers=\uC774 \uC18D\uC131\uC774 true\uB85C \uC124\uC815\uB41C \uD480\uC740 J2EE\uAC00 \uC544\uB2CC \uAD6C\uC131 \uC694\uC18C, \uC989 EJB \uB610\uB294 Servlet\uC774 \uC544\uB2CC \uB2E4\uB978 \uAD6C\uC131 \uC694\uC18C\uC5D0\uC11C \uC0AC\uC6A9\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uBC18\uD658\uB41C \uC811\uC18D\uC740 \uD2B8\uB79C\uC7AD\uC158 \uAD00\uB9AC\uC790\uC5D0\uC11C \uAC00\uC838\uC628 \uD2B8\uB79C\uC7AD\uC158 \uCEE8\uD14D\uC2A4\uD2B8\uB97C \uD1B5\uD574 \uC790\uB3D9\uC73C\uB85C \uB098\uC5F4\uB429\uB2C8\uB2E4. 
create.jdbc.connection.pool.nonTransactionalConnections=\uC774 \uC18D\uC131\uC774 true\uB85C \uC124\uC815\uB41C \uD480\uC740 \uD2B8\uB79C\uC7AD\uC158\uC774 \uC544\uB2CC \uC811\uC18D\uC744 \uBC18\uD658\uD569\uB2C8\uB2E4. \uC774 \uC811\uC18D\uC740 \uD2B8\uB79C\uC7AD\uC158 \uAD00\uB9AC\uC790\uB97C \uD1B5\uD574 \uC790\uB3D9\uC73C\uB85C \uB098\uC5F4\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.validateAtMostOncePeriod=\uC811\uC18D\uC774 \uCD5C\uB300 \uD55C \uBC88\uB9CC \uAC80\uC99D\uB418\uB294 \uC2DC\uAC04 \uAC04\uACA9\uC744 \uC124\uC815\uD558\uB294 \uB370 \uC0AC\uC6A9\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 0\uC785\uB2C8\uB2E4. \uAC12\uC774 0\uC774\uBA74 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.leakTimeout=\uC0AC\uC6A9\uC790\uAC00 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC5D0 \uC758\uD55C \uC7A0\uC7AC\uC801 \uC811\uC18D \uB204\uCD9C\uC744 \uAC10\uC9C0\uD558\uB294 \uB370 \uB3C4\uC6C0\uC744 \uC8FC\uAE30 \uC704\uD55C \uAC83\uC785\uB2C8\uB2E4. \uC9C0\uC815\uB41C \uAE30\uAC04 \uB0B4\uC5D0 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC774 \uC811\uC18D\uC744 \uD480\uB85C \uBC18\uD658\uD558\uC9C0 \uC54A\uB294 \uACBD\uC6B0 \uC7A0\uC7AC\uC801 \uB204\uCD9C\uB85C \uAC04\uC8FC\uB418\uC5B4 \uD638\uCD9C\uC790\uC758 \uC2A4\uD0DD \uCD94\uC801\uC774 \uAE30\uB85D\uB429\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 0\uC785\uB2C8\uB2E4. \uAC12\uC774 0\uC774\uBA74 \uAE30\uBCF8\uC801\uC73C\uB85C \uB204\uCD9C \uAC10\uC9C0\uAC00 \uC5C6\uC2B5\uB2C8\uB2E4. 0\uC774 \uC544\uB2CC \uC591\uC758 \uAC12\uC740 \uB204\uCD9C \uAC10\uC9C0\uB97C \uC124\uC815\uD569\uB2C8\uB2E4. \uADF8\uB7EC\uB098 \uC774 \uC18D\uC131\uC740 \uC811\uC18D \uB204\uCD9C\uC774 \uC788\uB294\uC9C0\uB9CC \uAC10\uC9C0\uD569\uB2C8\uB2E4. connection-leak-reclaim\uC774 true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0\uC5D0\uB9CC \uC811\uC18D\uC744 \uD68C\uC218\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.leakReclaim=\uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 connection-leak-timeout-in-seconds\uAC00 \uBC1C\uC0DD\uD55C \uD6C4 \uC811\uC18D\uC744 \uC7AC\uC0AC\uC6A9(\uD480\uB85C \uB418\uB3CC\uC544\uAC10)\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.creationRetryAttempts=\uC0C8 \uC811\uC18D\uC744 \uC0DD\uC131\uD558\uAE30 \uC704\uD55C \uC2DC\uB3C4 \uD69F\uC218\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 0\uC785\uB2C8\uB2E4. \uAC12\uC774 0\uC774\uBA74 \uC7AC\uC2DC\uB3C4\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.creationRetryInterval=\uC811\uC18D\uC744 \uC0DD\uC131\uD558\uAE30 \uC704\uD55C \uC7AC\uC2DC\uB3C4 \uAC04\uC758 \uC2DC\uAC04 \uAC04\uACA9\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 10\uCD08\uC785\uB2C8\uB2E4. connection-creation-retry-attempts\uAC00 0\uBCF4\uB2E4 \uD070 \uACBD\uC6B0 \uC801\uC6A9\uB429\uB2C8\uB2E4.
create.jdbc.connection.pool.statementTimeout=\uBE44\uC815\uC0C1\uC801\uC73C\uB85C \uC624\uB798 \uC2E4\uD589 \uC911\uC778 \uC9C8\uC758\uB97C \uC885\uB8CC\uD558\uAE30 \uC704\uD55C \uC811\uC18D\uC758 \uC2DC\uAC04 \uCD08\uACFC \uC18D\uC131\uC744 \uC124\uC815\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12 -1\uC740 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC9C0 \uC54A\uC74C\uC744 \uC758\uBBF8\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.lazyConnectionEnlistment=\uD2B8\uB79C\uC7AD\uC158\uC5D0 \uB300\uD55C \uB9AC\uC18C\uC2A4\uAC00 \uBA54\uC18C\uB4DC\uC5D0\uC11C \uC2E4\uC81C\uB85C \uC0AC\uC6A9\uB420 \uB54C\uC5D0\uB9CC \uD2B8\uB79C\uC7AD\uC158\uC5D0 \uB300\uD55C \uB9AC\uC18C\uC2A4\uB97C \uB098\uC5F4\uD569\uB2C8\uB2E4. \uC774\uB807\uAC8C \uD558\uBA74 \uD2B8\uB79C\uC7AD\uC158\uC5D0\uC11C \uC0AC\uC6A9\uB418\uC9C0 \uC54A\uB294 \uC811\uC18D\uC758 \uB098\uC5F4\uC774 \uBC29\uC9C0\uB429\uB2C8\uB2E4. \uD638\uCD9C\uD558\uB294 \uAD6C\uC131 \uC694\uC18C\uC5D0\uC11C \uCE90\uC2DC\uB41C \uC811\uC18D\uC758 \uBD88\uD544\uC694\uD55C \uB098\uC5F4\uB3C4 \uBC29\uC9C0\uB429\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.lazyConnectionAssociation=\uC791\uC5C5\uC774 \uD574\uB2F9 \uC811\uC18D\uC5D0\uC11C \uC218\uD589\uB420 \uB54C \uC811\uC18D\uC774 \uB290\uB9AC\uAC8C \uC811\uC18D\uB429\uB2C8\uB2E4. \uB610\uD55C \uD2B8\uB79C\uC7AD\uC158\uC774 \uC644\uB8CC\uB418\uACE0 \uAD6C\uC131 \uC694\uC18C \uBA54\uC18C\uB4DC\uAC00 \uC885\uB8CC\uB418\uBA74 \uC5F0\uAD00 \uD574\uC81C\uB418\uC5B4 \uBB3C\uB9AC\uC801 \uC811\uC18D\uC758 \uC7AC\uC0AC\uC6A9\uC744 \uB3D5\uC2B5\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.associateWithThread=\uC811\uC18D\uC744 \uC2A4\uB808\uB4DC\uC640 \uC5F0\uAD00\uC2DC\uCF1C \uC811\uC18D\uC5D0\uC11C \uAC19\uC740 \uC2A4\uB808\uB4DC\uAC00 \uD544\uC694\uD560 \uB54C \uD574\uB2F9 \uC2A4\uB808\uB4DC\uC640 \uC774\uBBF8 \uC5F0\uAD00\uB41C \uC811\uC18D\uC744 \uC7AC\uC0AC\uC6A9\uD568\uC73C\uB85C\uC368 \uD480\uC5D0\uC11C \uC811\uC18D\uC744 \uAC00\uC838\uC62C \uB54C \uC218\uBC18\uB418\uB294 \uC624\uBC84\uD5E4\uB4DC\uB97C \uC5C6\uC568 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4. (\uB610\uD55C associate-with-thread-connections-count \uCC38\uC870)
create.jdbc.connection.pool.associateWithThreadConnectionsCount=\uC2A4\uB808\uB4DC\uC640 \uC5F0\uAD00\uC2DC\uD0AC \uCD5C\uB300 \uC811\uC18D \uC218\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 1\uC785\uB2C8\uB2E4. associate-with-thread\uAC00 true\uC778 \uACBD\uC6B0\uC5D0\uB9CC \uC801\uC6A9\uB429\uB2C8\uB2E4.
create.jdbc.connection.pool.driverClassname=\uACF5\uAE09\uC5C5\uCCB4\uAC00 \uC81C\uACF5\uD55C JDBC \uB4DC\uB77C\uC774\uBC84 \uD074\uB798\uC2A4\uC758 \uC774\uB984\uC785\uB2C8\uB2E4. \uC9C0\uC815\uB41C \uB4DC\uB77C\uC774\uBC84\uB294 java.sql.Driver \uC778\uD130\uD398\uC774\uC2A4\uB97C \uAD6C\uD604\uD574\uC57C \uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.matchConnections=\uD480\uC5D0 \uB300\uD55C \uC811\uC18D \uC77C\uCE58\uB97C \uC124\uC815 \uBC0F \uC124\uC815 \uD574\uC81C\uD569\uB2C8\uB2E4. \uD480\uC758 \uC811\uC18D\uC774 \uD56D\uC0C1 \uAC19\uC740 \uC885\uB958\uC774\uBA70 \uB530\uB77C\uC11C \uD480\uC5D0\uC11C \uC120\uD0DD\uB41C \uC811\uC18D\uC744 \uB9AC\uC18C\uC2A4 \uC5B4\uB311\uD130\uC640 \uC77C\uCE58\uC2DC\uD0AC \uD544\uC694\uAC00 \uC5C6\uC74C\uC744 \uAD00\uB9AC\uC790\uAC00 \uC54C\uACE0 \uC788\uC744 \uB54C false\uB85C \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.maxConnectionUsageCount=\uC9C0\uC815\uB41C \uACBD\uC6B0 \uC9C0\uC815\uB41C \uD69F\uC218\uB9CC\uD07C \uD480\uC5D0\uC11C \uC811\uC18D\uC744 \uC7AC\uC0AC\uC6A9\uD55C \uD6C4 \uD480\uC774 \uB2EB\uD799\uB2C8\uB2E4. \uC774 \uC635\uC158\uC740 \uBB38 \uB204\uCD9C\uC744 \uBC29\uC9C0\uD558\uB824\uB294 \uACBD\uC6B0 \uB4F1\uC5D0 \uC720\uC6A9\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 0\uC785\uB2C8\uB2E4. \uAC12\uC774 0\uC774\uBA74 \uAE30\uB2A5\uC774 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.ping=\uC774 \uC18D\uC131\uC774 true\uB85C \uC124\uC815\uB41C \uD480\uC740 \uD480 \uC0DD\uC131 \uB610\uB294 \uC7AC\uAD6C\uC131 \uC911\uC5D0 \uD574\uB2F9 \uC18D\uC131\uC758 \uC798\uBABB\uB41C \uAC12\uC744 \uC2DD\uBCC4\uD558\uACE0 \uACBD\uACE0\uD558\uAE30 \uC704\uD574 \uD551\uC774 \uC218\uD589\uB429\uB2C8\uB2E4. \uC774 \uC18D\uC131\uC758 \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.pooling=false\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 \uC774 \uC18D\uC131\uC740 \uC811\uC18D \uD480\uB9C1\uC744 \uC0AC\uC6A9 \uC548\uD568\uC73C\uB85C \uC124\uC815\uD569\uB2C8\uB2E4. \uC774 \uC18D\uC131\uC758 \uAE30\uBCF8\uAC12\uC740 true\uC785\uB2C8\uB2E4.
create.jdbc.connection.pool.sqlTraceListeners=\uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC5D0\uC11C \uC2E4\uD589\uD55C SQL \uBB38\uC774 \uCD94\uC801\uB418\uC5B4\uC57C \uD558\uB294\uC9C0\uB97C \uC124\uC815\uD558\uB294 \uB370 \uC0AC\uC6A9\uB429\uB2C8\uB2E4. \uAD00\uB9AC\uC790\uAC00 \uBB38\uC744 \uBD84\uC11D\uD558\uB294 \uB370 \uB3C4\uC6C0\uC744 \uC90D\uB2C8\uB2E4. \uC5EC\uB7EC \uB9AC\uC2A4\uB108\uB97C \uB9AC\uC2A4\uB108 \uAD6C\uD604 \uD074\uB798\uC2A4 \uC774\uB984\uC758 \uC27C\uD45C\uB85C \uAD6C\uBD84\uB41C \uBAA9\uB85D\uC73C\uB85C \uC9C0\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.statementCachesize=\uAE30\uBCF8 \uCE90\uC2DC \uBC29\uC2DD(Least Recently Used)\uC744 \uC0AC\uC6A9\uD558\uC5EC \uCE90\uC2DC\uD560 \uBB38 \uC218\uB97C \uC124\uC815\uD558\uB294 \uB370 \uC0AC\uC6A9\uB429\uB2C8\uB2E4. \uAE30\uBCF8\uAC12 0\uC740 \uBB38 \uCE90\uC2DC\uAC00 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC9C0 \uC54A\uC74C\uC744 \uC758\uBBF8\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.wrapJdbcObjects=true\uB85C \uC124\uC815\uD558\uBA74 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC740 Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData\uC5D0 \uB300\uD574 \uB798\uD551\uB41C JDBC \uAC1D\uCCB4\uB97C \uAC00\uC838\uC635\uB2C8\uB2E4. true\uB97C \uAE30\uBCF8\uAC12\uC73C\uB85C \uC0AC\uC6A9\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.validationClassname=\uC0AC\uC6A9\uC790\uAC00 \uAD6C\uD604\uD558\uB294 \uC0AC\uC6A9\uC790 \uC815\uC758 \uAC80\uC99D \uAD6C\uD604 \uD074\uB798\uC2A4 \uC774\uB984\uC744 \uC124\uC815\uD558\uB294 \uB370 \uC0AC\uC6A9\uB429\uB2C8\uB2E4. connection-validation-type\uC774 custom-validation\uC73C\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 \uC774 \uB9E4\uAC1C\uBCC0\uC218\uB294 \uD544\uC218\uC785\uB2C8\uB2E4. \uC81C\uACF5\uB41C \uD074\uB798\uC2A4 \uC774\uB984\uC740 \uC560\uD50C\uB9AC\uCF00\uC774\uC158 \uC11C\uBC84\uC5D0\uC11C \uC561\uC138\uC2A4\uD560 \uC218 \uC788\uC5B4\uC57C \uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.description=\uC9C0\uC815\uB41C JDBC \uC811\uC18D \uD480\uC5D0 \uB300\uD55C \uC138\uBD80 \uC815\uBCF4\uB97C \uC81C\uACF5\uD558\uB294 \uD14D\uC2A4\uD2B8.
create.jdbc.connection.pool.property=\uC811\uC18D \uD480\uC744 \uAD6C\uC131\uD558\uAE30 \uC704\uD55C \uC120\uD0DD\uC801 \uC18D\uC131 \uC774\uB984/\uAC12 \uC30D.
create.jdbc.connection.pool.jdbc_connection_pool_id=\uC0DD\uC131\uD560 JDBC \uC811\uC18D \uD480\uC758 \uC774\uB984.
create.jdbc.connection.pool.success=JDBC \uC811\uC18D \uD480 {0}\uC744(\uB97C) \uC131\uACF5\uC801\uC73C\uB85C \uC0DD\uC131\uD588\uC2B5\uB2C8\uB2E4.
create.jdbc.connection.pool.fail=JDBC \uC811\uC18D \uD480 {0}\uC744(\uB97C) \uC0DD\uC131\uD558\uC9C0 \uBABB\uD588\uC2B5\uB2C8\uB2E4. {1}
create.jdbc.connection.pool.duplicate={0}(\uC774)\uB77C\uB294 \uB9AC\uC18C\uC2A4\uAC00 \uC874\uC7AC\uD569\uB2C8\uB2E4.
create.jdbc.connection.pool.validationtable_required=--validationmethod=table \uBC0F --isconnectvalidatereq=true\uC778 \uACBD\uC6B0 --validationtable\uC774 \uD544\uC218\uC785\uB2C8\uB2E4.
delete.jdbc.connection.pool=\uC9C0\uC815\uB41C JDBC \uC811\uC18D \uD480\uC744 \uC81C\uAC70\uD569\uB2C8\uB2E4.
delete.jdbc.connection.pool.cascade=\uC774 \uC635\uC158\uC774 true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 \uC790\uCCB4 \uD480\uACFC\uB294 \uBCC4\uAC1C\uB85C \uD574\uB2F9 \uD480\uC5D0 \uC5F0\uAD00\uB41C \uBAA8\uB4E0 JDBC \uB9AC\uC18C\uC2A4\uAC00 \uC0AD\uC81C\uB429\uB2C8\uB2E4. false\uB85C \uC124\uC815\uB41C \uC0C1\uD0DC\uC5D0\uC11C \uD480\uACFC \uC5F0\uAD00\uB41C \uB9AC\uC18C\uC2A4\uAC00 \uC788\uC744 \uACBD\uC6B0 \uD480\uC774 \uC0AD\uC81C\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uB9AC\uC18C\uC2A4\uB97C \uBA85\uC2DC\uC801\uC73C\uB85C \uC0AD\uC81C\uD558\uAC70\uB098 \uC635\uC158\uC744 true\uB85C \uC124\uC815\uD574\uC57C \uD569\uB2C8\uB2E4. \uAE30\uBCF8\uC801\uC73C\uB85C \uC774 \uC635\uC158\uC740 false\uC785\uB2C8\uB2E4.
delete.jdbc.connection.pool.jdbc_connection_pool_id=\uC81C\uAC70\uD560 JDBC \uB9AC\uC18C\uC2A4\uC758 \uC774\uB984.
delete.jdbc.connection.pool.success=delete-jdbc-connection \uD480 \uBA85\uB839\uC774 \uC131\uACF5\uC801\uC73C\uB85C \uC2E4\uD589\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
delete.jdbc.connection.pool.fail=delete-jdbc-connection-pool \uBA85\uB839\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
delete.jdbc.connection.pool.notfound={0}(\uC774)\uB77C\uB294 JDBC \uC811\uC18D \uD480\uC774 \uC874\uC7AC\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
delete.jdbc.connection.pool.noJndiName=JDBC \uC811\uC18D \uD480\uC5D0 \uB300\uD574 \uC815\uC758\uB41C ID\uAC00 \uC5C6\uC2B5\uB2C8\uB2E4.
delete.jdbc.connection.pool.pool_in_use=\uC77C\uBD80 jdbc \uB9AC\uC18C\uC2A4 \uB610\uB294 \uC9C0\uC18D\uC131 \uAD00\uB9AC\uC790 \uD329\uD1A0\uB9AC \uB9AC\uC18C\uC2A4\uC5D0\uC11C \uC774 \uC811\uC18D \uD480\uC744 \uCC38\uC870\uD558\uACE0 \uC788\uC2B5\uB2C8\uB2E4. \uC774 \uB9AC\uC18C\uC2A4\uB4E4\uB3C4 \uC0AD\uC81C\uD558\uB824\uBA74 '\uAD00\uB828 \uD56D\uBAA9 \uBAA8\uB450 \uC0AD\uC81C' \uC635\uC158\uC744 \uC0AC\uC6A9\uD558\uC2ED\uC2DC\uC624.
list.jdbc.connection.pools=\uBAA8\uB4E0 JDBC \uC811\uC18D \uD480\uC744 \uB098\uC5F4\uD569\uB2C8\uB2E4.
list.jdbc.connection.pools.success=list-jdbc-connection-pools \uBA85\uB839\uC774 \uC131\uACF5\uC801\uC73C\uB85C \uC2E4\uD589\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
list.jdbc.connection.pools.fail=list-jdbc-connection-pools \uBA85\uB839\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.
list.jdbc.connection.pools.empty=\uB098\uC5F4\uD560 \uAC83\uC774 \uC5C6\uC2B5\uB2C8\uB2E4.
ping.create.jdbc.connection.pool.fail=JDBC \uC811\uC18D \uD480 \uC0DD\uC131 \uC911 \uD551 \uC218\uD589 \uC2DC\uB3C4: {0} - \uC2E4\uD328.
ping.create.jdbc.connection.pool.success=JDBC \uC811\uC18D \uD480 \uC0DD\uC131 \uC911 \uD551 \uC218\uD589 \uC2DC\uB3C4: {0} - \uC131\uACF5.
