#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

add.resources=El comando add-resources crea los recursos nombrados en el archivo XML especificado. La xml_file_path es la ruta de acceso del archivo XML que contiene los recursos que se van a crear. El DOCTYPE se debe especificar como se hace en el archivo resources.xml.
add.resources.target=Especifica el destino para el que est\u00E1 creando los recursos.
add.resources.xml_file_name=La ruta de acceso al archivo XML contiene los recursos que se van a crear. El archivo XML debe residir en el directorio <directorio_instalaci\u00F3n>/domains/domain1/config. Si especifica una ruta de acceso relativa o simplemente proporciona el nombre del archivo XML, este comando preceder\u00E1 <directorio_instalaci\u00F3n>/domains/domain1/config a este operando.
add.resources.noJdbcConnectionPoolId=No se ha definido ning\u00FAn nombre de pool para el pool de conexiones JDBC.
add.resources.noDataSourceClassname=No se ha definido ning\u00FAn nombre de clase de origen de datos para el pool de conexiones JDBC.
create.jdbc.resource=Cree un recurso JDBC con el nombre de JNDI especificado.
create.jdbc.resource.connectionpoolid=Nombre del pool de conexiones JDBC. Si dos o m\u00E1s elementos de recurso JDBC apuntan al mismo elemento de pool de conexiones, utilizan la misma conexi\u00F3n de pool en tiempo de ejecuci\u00F3n.
create.jdbc.resource.description=Texto que proporciona detalles descriptivos acerca del recurso JDBC.
create.jdbc.resource.jndi_name=Nombre JNDI de este recurso JDBC.
create.jdbc.resource.enabled=Determina si el recurso JDBC se activa en tiempo de ejecuci\u00F3n. El valor por defecto es true.
create.jdbc.resource.success=El recurso JDBC {0} se ha creado correctamente.
create.jdbc.resource.duplicate=Ya existe un recurso denominado {0}.
create.jdbc.resource.fail=Fallo en el comando create-jdbc-resource.
create.jdbc.resource.connPoolNotFound=El valor de atributo (pool-name = {0}) no se encuentra en la lista de pools de conexiones jdbc.
delete.jdbc.resource=Elimine un recurso JDBC con el nombre de JNDI especificado.
delete.jdbc.resource.jdbc_resource_name=Nombre JNDI del recurso JDBC que se va a eliminar.
delete.jdbc.resource.success=El comando delete-jdbc-resource se ha ejecutado correctamente.
delete.jdbc.resource.fail=Fallo en el comando create-jdbc-resource.
delete.jdbc.resource.notfound=No existe un recurso JDBC denominado {0}.
delete.jdbc.resource.resource-ref.exist=Se hace referencia al recurso JDBC [ {0} ] en un destino de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.jdbc.resource.multiple.resource-refs=Se hace referencia al recurso JDBC [ {0} ] en varios destinos de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.jdbc.resource.no.resource-ref=No se hace referencia al recurso JDBC [ {0} ] en el destino [ {1} ]
delete.jdbc.resource.system-all-req.object-type=El recurso JDBC [ {0} ] no se puede suprimir porque es necesario que est\u00E9 configurado en el sistema.
list.jdbc.resources=Muestre todos los recursos de JDBC.
list.jdbc.resources.success=El comando list-jdbc-resources se ha ejecutado correctamente.
list.jdbc.resources.fail=Fallo en el comando list-jdbc-resources.
list.jdbc.resources.empty=No hay nada que mostrar.

create.jdbc.connection.pool=Registre el pool de conexiones JDBC.
create.jdbc.connection.pool.datasourceClassname=Nombre del gestor de recursos del origen de datos JDBC proporcionado por el proveedor.
create.jdbc.connection.pool.resType=Interfaz que implanta la clase de origen de datos. Debe haber un javax.sql.DataSource, javax.sql.ConnectionPoolDataSource o un javax.sql.XADataSource. Produce un error cuando esta opci\u00F3n tiene un valor v\u00E1lido y la clase de origen de datos no implanta la interfaz indicada. Esta opci\u00F3n no tiene un valor por defecto.
create.jdbc.connection.pool.steadyPoolSize=N\u00FAmero m\u00EDnimo e inicial de conexiones mantenidas en el pool. El valor por defecto es 8.
create.jdbc.connection.pool.maxPoolSize=N\u00FAmero m\u00E1ximo de conexiones que se pueden crear. El valor por defecto es 32.
create.jdbc.connection.pool.maxWait=Cantidad de tiempo que un emisor de la llamada esperar\u00E1 antes de que se env\u00EDe el timeout de la conexi\u00F3n. El valor por defecto es 60 segundos. Un valor 0 hace que el emisor de la llamada espere de manera indefinida.
create.jdbc.connection.pool.poolResize=Cantidad en la que el pool aumentar\u00E1 o reducir\u00E1 la escala del n\u00FAmero de conexiones. Aumentar la escala: cuando el pool no tiene conexiones libres, el pool aumentar\u00E1 la escala en esta cantidad. Reducir la escala: todas las conexiones inactivas o no v\u00E1lidas se eliminan, provocando a veces la eliminaci\u00F3n de una cantidad de conexiones mayor que este valor. Se garantizar\u00E1 un tama\u00F1o estable del pool. Los valores posibles son desde 0 a MAX_INTEGER. El valor por defecto es 2.
create.jdbc.connection.pool.idleTimeout=Tiempo m\u00E1ximo, en segundos, que una conexi\u00F3n puede permanecer inactiva en el pool. Cuando pase este tiempo, la implantaci\u00F3n puede cerrar esta conexi\u00F3n. El valor del timeout debe ser inferior al valor del timeout del servidor para evitar la acumulaci\u00F3n de conexiones inutilizables en la aplicaci\u00F3n. El valor por defecto es 300.
create.jdbc.connection.pool.initSql=Se utiliza para que el usuario especifique una cadena SQL, que se ejecutar\u00E1 cada vez que se cree una conexi\u00F3n desde el pool (no para las conexiones que se reutilicen). Se ejecuta para inicializar el estado de la conexi\u00F3n. Se trata de un atributo opcional y debe contener un valor si se va a ejecutar una sentencia SQL de inicializaci\u00F3n.
create.jdbc.connection.pool.isolationLevel=Nivel de aislamiento de transacci\u00F3n en las conexiones de base de datos de pool. Esta opci\u00F3n no tiene un valor por defecto. Si no se especifica, el pool funciona con el nivel de aislamiento por defecto que ofrece el controlador JDBC. Puede definir un nivel de aislamiento deseado utilizando uno de los niveles de aislamiento de transacci\u00F3n est\u00E1ndar: lectura no confirmada, lectura confirmada, lectura repetible, serializable. Las aplicaciones que modifican mediante programaci\u00F3n el nivel de aislamiento en una conexi\u00F3n de pool corren el riesgo de contaminar el pool. Esto puede provocar errores en el programa.
create.jdbc.connection.pool.isIsolationGuaranteed=Esto es aplicable \u00FAnicamente cuando se especifica un nivel de aislamiento particular para el nivel de aislamiento de la transacci\u00F3n. El valor por defecto es true. Esta opci\u00F3n garantiza que, cada vez que se obtiene una conexi\u00F3n del pool, el nivel de aislamiento se ajusta al valor deseado. Esto puede afectar al rendimiento en algunos controladores JDBC. Los administradores pueden definir este valor como false cuando la aplicaci\u00F3n no cambia el --isolationlevel antes de devolver la conexi\u00F3n.
create.jdbc.connection.pool.isConnectValidatereq=Si se define como true, las conexiones se validan o se comprueban para ver si se pueden usar antes de enviarlas a la aplicaci\u00F3n. El valor por defecto es false.
create.jdbc.connection.pool.validationMethod=Nombre de la tabla de validaci\u00F3n utilizada para realizar una consulta para validar una conexi\u00F3n. Las opciones v\u00E1lidas son: confirmaci\u00F3n autom\u00E1tica, metadatos o tabla. El valor por defecto es la confirmaci\u00F3n autom\u00E1tica.
create.jdbc.connection.pool.validationTable=Nombre de la tabla de validaci\u00F3n utilizada para realizar una consulta para validar una conexi\u00F3n.
create.jdbc.connection.pool.failConnection=Si se define como true, todas las conexiones del pool se deben cerrar s\u00F3lo cuando falle una \u00FAnica comprobaci\u00F3n de validaci\u00F3n. El valor por defecto es false. Se ha realizado un intento de restablecer las conexiones con fallos.
create.jdbc.connection.pool.allowNonComponentCallers=Un pool con esta propiedad definida como true s\u00F3lo lo pueden utilizar componentes que no sean J2EE, es decir, componentes diferentes a EJBs o Servlets. La conexi\u00F3n devuelta se inscribe de forma autom\u00E1tica con el contexto de transacci\u00F3n obtenido del gestor de transacciones. 
create.jdbc.connection.pool.nonTransactionalConnections=Un pool con esta propiedad definida como true devuelve conexiones no transaccionales. Esta conexi\u00F3n no se inscribe de manera autom\u00E1tica con el gestor de transacciones.
create.jdbc.connection.pool.validateAtMostOncePeriod=Se utiliza para definir el intervalo de tiempo dentro del cual una conexi\u00F3n se valida como m\u00E1ximo una vez. El valor por defecto es 0, es decir, que no est\u00E1 activada.
create.jdbc.connection.pool.leakTimeout=Facilita al usuario la detecci\u00F3n de posibles p\u00E9rdidas en la conexi\u00F3n mediante la aplicaci\u00F3n. Cuando la aplicaci\u00F3n no devuelve una conexi\u00F3n al pool durante el per\u00EDodo de tiempo especificado, se supone que existe una posible p\u00E9rdida y se registrar\u00E1 el rastreo de la pila del emisor de la llamada. El valor por defecto es 0, por lo que por defecto no se ha detectado ninguna p\u00E9rdida. Un valor positivo distinto de cero activa la detecci\u00F3n de p\u00E9rdidas. No obstante, tenga en cuenta que este atributo solamente detecta si existe alguna p\u00E9rdida en la conexi\u00F3n. La conexi\u00F3n s\u00F3lo se puede reclamar si el comando connection-leak-reclaim est\u00E1 definido en true.
create.jdbc.connection.pool.leakReclaim=Si est\u00E1 activada, se podr\u00E1 utilizar de nuevo la conexi\u00F3n (devolverla al pool) despu\u00E9s de que se produzca el timeout en segundos de la p\u00E9rdida de la conexi\u00F3n. El valor por defecto es false.
create.jdbc.connection.pool.creationRetryAttempts=N\u00FAmero de intentos para crear una conexi\u00F3n. El valor por defecto es 0, lo que implica que no se produce ning\u00FAn reintento.
create.jdbc.connection.pool.creationRetryInterval=Intervalo de tiempo entre los reintentos al intentar crear una conexi\u00F3n. El valor por defecto es 10 segundos. Resulta efectivo cuando el valor del comando connection-creation-retry-attempts es superior a 0.
create.jdbc.connection.pool.statementTimeout=Define la propiedad de timeout de una conexi\u00F3n para permitir la finalizaci\u00F3n de consultas demasiado largar. El valor por defecto es -1 indica que no se ha activado.
create.jdbc.connection.pool.lazyConnectionEnlistment=Se realiza una inscripci\u00F3n en la transacci\u00F3n \u00FAnicamente cuando realmente se utiliza en un m\u00E9todo, lo que evita el registro de conexiones que no se utilizan en una transacci\u00F3n. Esto tambi\u00E9n evita el registro innecesario de conexiones almacenadas en cach\u00E9 de los componentes de llamada. El valor por defecto es false.
create.jdbc.connection.pool.lazyConnectionAssociation=Las conexiones se asocian de forma lenta cuando se realiza una operaci\u00F3n en ellas. Adem\u00E1s, se disocian cuando la transacci\u00F3n se completa y un m\u00E9todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f\u00EDsicas. El valor por defecto es false.
create.jdbc.connection.pool.associateWithThread=Asocie las conexiones a un thread de forma que cuando el mismo thread necesite una conexi\u00F3n, se puedan reutilizar las conexiones ya asociadas a ese thread y, por tanto, no se incurra en una sobrecarga a la hora de obtener una conexi\u00F3n del pool. El valor por defecto es false. (Consulte tambi\u00E9n associate-with-thread-connections-count)
create.jdbc.connection.pool.associateWithThreadConnectionsCount=N\u00FAmero m\u00E1ximo de conexiones que asociar a un thread. El valor por defecto es 1. Solamente surte efecto si associate-with-thread es true.
create.jdbc.connection.pool.driverClassname=Nombre de la clase del controlador JDBC proporcionado por el proveedor. El controlador especificado debe implantar la interfaz java.sql.Driver.
create.jdbc.connection.pool.matchConnections=Activar/desactivar la b\u00FAsqueda de coincidencias de conexiones del pool. Se puede definir en false si el administrador sabe que las conexiones del pool siempre ser\u00E1n homog\u00E9neas y, por tanto, el adaptador de recursos no necesitar\u00E1 buscar una coincidencia de una conexi\u00F3n seleccionada del pool. El valor por defecto es false.
create.jdbc.connection.pool.maxConnectionUsageCount=Si se especifica, el pool volver\u00E1 a utilizar las conexiones el n\u00FAmero de veces especificado, tras el cual se cerrar\u00E1. Esto resulta \u00FAtil, por ejemplo, para evitar p\u00E9rdidas de sentencias. El valor por defecto es 0, de modo que la funci\u00F3n no est\u00E1 activada.
create.jdbc.connection.pool.ping=En un pool con este atributo definido en true se realiza un ping durante la creaci\u00F3n o reconfiguraci\u00F3n para identificar y notificar los valores err\u00F3neos de sus atributos. El valor por defecto de este atributo es false.
create.jdbc.connection.pool.pooling=Cuando se define como false, este atributo desactiva el pool de conexiones. El valor por defecto de este atributo es true.
create.jdbc.connection.pool.sqlTraceListeners=Se utiliza para definir si se debe realizar un rastreo de las sentencias SQL ejecutadas por las aplicaciones. Ayuda a los administradores a analizar las sentencias. Se pueden especificar varios listeners en una lista separada por comas y compuesta por nombres de clases de implantaciones de listener.
create.jdbc.connection.pool.statementCachesize=Se utiliza para definir el n\u00FAmero de sentencias que se deben almacenar en la cach\u00E9 mediante el mecanismo de almacenamiento en cach\u00E9 por defecto (Menos Recientemente Usado). El valor por defecto es 0, de modo que no est\u00E1 activado el almacenamiento en la cach\u00E9 de sentencias.
create.jdbc.connection.pool.wrapJdbcObjects=Cuando se define en true, la aplicaci\u00F3n ajustar\u00E1 objetos jdbc para Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. El valor por defecto es true.
create.jdbc.connection.pool.validationClassname=Se utiliza para definir el nombre de clase de implantaci\u00F3n de la validaci\u00F3n personalizada implantado por el usuario. Este par\u00E1metro es obligatorio si connection-validation-type est\u00E1 definido en custom-validation. El servidor de aplicaciones debe poder acceder al nombre de clase proporcionado.
create.jdbc.connection.pool.description=Texto que ofrece detalles acerca del pool de conexiones JDBC especificado.
create.jdbc.connection.pool.property=Pares de nombre/valor del atributo opcional para configurar el pool de conexiones.
create.jdbc.connection.pool.jdbc_connection_pool_id=Nombre del pool de conexiones JDBC que se va a crear.
create.jdbc.connection.pool.success=El pool de conexiones JDBC {0} se ha creado correctamente.
create.jdbc.connection.pool.fail=Fallo al crear el pool de conexiones JDBC {0}. {1}
create.jdbc.connection.pool.duplicate=Ya existe un recurso denominado {0}.
create.jdbc.connection.pool.validationtable_required=--validationtable es obligatorio si --validationmethod=table y --isconnectvalidatereq=true.
delete.jdbc.connection.pool=Elimine el pool de conexiones JDBC especificado.
delete.jdbc.connection.pool.cascade=Si la opci\u00F3n se define en true, se suprimen todos los recursos JDBC asociados al pool, aparte del pool en s\u00ED. Cuando se define en false, la supresi\u00F3n del pool falla si hay alg\u00FAn recurso asociado al pool. Los recursos se deben suprimir expl\u00EDcitamente o bien la opci\u00F3n se debe definir como true. Por defecto, la opci\u00F3n es false.
delete.jdbc.connection.pool.jdbc_connection_pool_id=Nombre del recurso JDBC que se va a eliminar.
delete.jdbc.connection.pool.success=El comando delete-jdbc-connection-pool se ha ejecutado correctamente.
delete.jdbc.connection.pool.fail=Fallo en el comando delete-jdbc-connection-pool.
delete.jdbc.connection.pool.notfound=El pool de conexiones JDBC denominado {0} no existe.
delete.jdbc.connection.pool.noJndiName=No hay ning\u00FAn ID definido para el pool de conexiones JDBC.
delete.jdbc.connection.pool.pool_in_use=Algunos recursos de jdbc o recursos de la f\u00E1brica de gestor de persistencia hacen referencia a este pool de conexiones. Utilice la opci\u00F3n 'cascade' para suprimirlos tambi\u00E9n.
list.jdbc.connection.pools=Muestre todos los pools de conexiones JDBC.
list.jdbc.connection.pools.success=El comando list-jdbc-connection-pools se ha ejecutado correctamente.
list.jdbc.connection.pools.fail=Fallo en el comando list-jdbc-connection-pools
list.jdbc.connection.pools.empty=No hay nada que mostrar.
ping.create.jdbc.connection.pool.fail=Se ha intentado realizar un ping durante la creaci\u00F3n del pool de conexiones JDBC: {0} - Con fallos.
ping.create.jdbc.connection.pool.success=Se ha intentando realizar un ping durante la creaci\u00F3n del pool de conexiones JDBC: {0} - Realizado correctamente.
