#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

button.Flush=Vaciar

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them

msg.JS.securityMap.enterUserGroups=Introducir un Valor para Grupos de Usuarios
msg.JS.securityMap.enterPrincipals=Introducir un Valor para Principales
msg.JS.confirmDeleteSM=Se suprimir\u00E1n las asignaciones de seguridad seleccionadas. \u00BFDesea continuar?
msg.JS.confirmDeleteAO=Se suprimir\u00E1n los objetos de administraci\u00F3n seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteCR=Se suprimir\u00E1n los recursos seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteCP=Se suprimir\u00E1n los pools de conexiones seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteAC=Se suprimir\u00E1n las configuraciones del adaptador seleccionadas. \u00BFDesea continuar?


## Admin Object Resource
adminObjectResources.pageTitle=Recursos de Objeto de Administraci\u00F3n
adminObjectResources.pageTitleHelp=Un recurso de objeto administrado proporciona funciones especializadas que se definen mediante el adaptador de recursos del m\u00F3dulo de conector desplegado.

adminObjectResource.editPageTitle=Editar Recurso de Objeto Administrado
adminObjectResource.editPageHelp=Modifique un recurso de objeto administrado existente.
adminObject.NewPageTitle=Nuevo Recurso de Objeto Administrado
adminObject.NewPageTitleHelp=Para crear un nuevo recurso de objeto administrado, especifique un nombre JNDI \u00FAnico, seleccione el adaptador de recursos y, a continuaci\u00F3n, elija un tipo de recurso y, de forma opcional, un nombre de clase.
#adminObject.step2PageTitle=New Admin Object Resource (Step 2 of 2)
#adminObject.step2PageTitleHelp=Add a description for the administered object, enable or disable the object on all resources and define name-value property pairs.
adminObjectResource.targetPageTitle=Destinos de Recurso de Objeto Administrado
adminObjectResource.resTypeHelp=Seleccione el tipo del recurso de objeto administrado
adminObjectResource.resourceAdapterHelp=Seleccione un elemento de la lista de adaptadores de recursos desplegados (m\u00F3dulos del conector).
adminObjectResource.classname=Nombre de Clase:
adminObjectResource.classnameHelp=Nombre de la clase de implantaci\u00F3n asociado al tipo de recurso

#Resources

resourcesTable.resources=Recursos
resourcesTable.sessions=Sesiones
resourcesTable.connectionFactories=F\u00E1bricas de Conexiones
resourcesTable.Pools=Pools
resourcesTable.destResources=Recursos de Destino

resourcesTable.colPoolName=Nombre de Pool
resourcesTable.colJndiName=Nombre JNDI
resourcesTable.colDesc=Descripci\u00F3n
resourcesTable.colPool=Pool de Conexiones
resourcesTable.colResType=Tipo de Recurso
resourcesTable.colDatasource=Nombre de Clase de Origen de Datos
resourcesTable.colDefinition=Definici\u00F3n de Conexi\u00F3n
resourcesTable.colResAdapter=Adaptador de Recursos

## Connectors
connectors.pageTitle=Conectores
connectors.pageTitleHelp=
connectorResources.pageTitle=Recursos de Conectores
connectorResources.pageTitleHelp=Un recurso de conector es un objeto de programa que proporciona a una aplicaci\u00F3n una conexi\u00F3n a un sistema EIS (Enterprise Information System).
connectorConnectionPools.pageTitle=Pools de Conexiones de Conectores
connectorConnectionPools.pageTitleHelp=Haga clic en Nuevo para crear un nuevo pool de conexiones del conector. Despliegue el m\u00F3dulo del conector antes de crear el pool. Los m\u00F3dulos del conector se pueden desplegar desde la p\u00E1gina <a href="#{request.contextPath}/applications/applications.jsf">Aplicaciones</a>.


## Connector Connection Pool

resource.targetPageTitleHelp=Gestione los destinos (clusters o instancias del servidor independientes) en los que est\u00E1 disponible el recurso.
connectorResource.editPageTitle=Editar Recurso de Conector
connectorResource.editPageTitleHelp=Modifique un recurso de conector existente.
connectorResource.targetPageTitle=Destinos de Recurso del Conector
connectorResource.newPageTitle=Nuevo Recurso de Conector
connectorResource.newPageTitleHelp=Para crear un recurso de conector, especifique el pool de conexiones al que est\u00E1 asociado. Varios recursos de conectores pueden utilizar un \u00FAnico pools de conexiones.
connectorResource.poolHelp=Use la p\u00E1gina <a href="#{request.contextPath}/jca/connectorConnectionPools.jsf">Pools de Conexiones de Conectores</a> para crear nuevos pools

connectorConnectionPool.editPageTitle=Editar Pool de Conexiones del Conector
connectorConnectionPool.editPageTitleHelp=Modifique la configuraci\u00F3n de un pool de conexiones de un conector existente.
connectorConnectionPool.step1PageTitle=Nuevo Pool de Conexiones del Conector (Paso 1 de 2)
connectorConnectionPool.step1PageTitleHelp=Especifique un nombre de pool, seleccione el adaptador de recursos asociado y la definici\u00F3n de la conexi\u00F3n y, a continuaci\u00F3n, haga clic en Siguiente.
connectorConnectionPool.step2PageTitle=Nuevo Pool de Conexiones del Conector (Paso 2 de 2)
connectorConnectionPool.step2PageTitleHelp=Verifique la configuraci\u00F3n del pool de conexiones, agregue las propiedades necesarias y haga clic en Finalizar.
connectorConnectionPool.connectionDefinitionName=Definici\u00F3n de Conexi\u00F3n:
connectorConnectionPool.connectionDefinitionNameHelp=Interfaz de la definici\u00F3n de conexi\u00F3n
connectorConnectionPool.onFail=Ante Cualquier Fallo:
connectorConnectionPool.onFailHelp=Cierra todas las conexiones y vuelve a conectar en caso de fallo; en caso contrario, vuelve a conectar s\u00F3lo cuando se utilice
connectorConnectionPool.closeAll=Cerrar Todas las Conexiones
connectorConnectionPool.transSupport=Soporte de Transacci\u00F3n:
connectorConnectionPool.transSupportHelp=Nivel de soporte de transacci\u00F3n. Sobrescribe el atributo de soporte de la transacci\u00F3n en el adaptador de recursos de forma descendente compatible.
connectorConnectionPool.conValidationHelp=Valide la conexi\u00F3n antes de transferirla al contenedor
connectorConnectionPool.validateAtmostOnce=Intervalo de Validaci\u00F3n:
connectorConnectionPool.validateAtmostHelp=Especifica el intervalo de tiempo, en segundos, entre solicitudes consecutivas para validar una conexi\u00F3n como m\u00E1ximo una vez. El valor por defecto es 0, lo que significa que el atributo no est\u00E1 activado.
connectorConnectionPool.advancePageTitle=Editar Atributos Avanzados del Pool de Conexiones de Conector
connectorConnectionPool.advancePageTitleHelp=Modifique los atributos avanzados de un pool de conexiones de un conector existente.
connectorConnectionPool.propertyPageTitle=Editar Propiedades de Pool de Conexiones de Conector
connectorConnectionPool.propertyPageTitleHelp=Modifique las propiedades de un pool de conexiones de un conector existente.
poolName=Nombre de Pool:

connectorSecurityMaps.pageTitle=Asignaciones de Seguridad del Pool de Conexiones del Conector
connectorSecurityMaps.pageTitleHelp=Gestione las asignaciones de seguridad. Las asignaciones de seguridad permiten crear una asignaci\u00F3n entre grupos y usuarios Java EE y grupos y usuarios EIS.
connectorSecurityMaps.tableTitle=Asignaciones de Seguridad
connectorSecurityMaps.tabTitle=Asignaciones de Seguridad
connectorSecurityMap.newPageTitle=Nueva Asignaci\u00F3n de Seguridad del Pool de Conexiones de Conector
connectorSecurityMap.newPageTitleHelp=Cree una nueva asignaci\u00F3n de seguridad. Las asignaciones de seguridad permiten crear una asignaci\u00F3n entre grupos y usuarios Java EE y grupos y usuarios EIS. Debe especificar principales o grupos de usuarios, pero no ambos elementos.
connectorSecurityMap.editPageTitle=Editar Asignaci\u00F3n de Seguridad del Pool de Conexiones de Conector
connectorSecurityMap.editPageTitleHelp=Modifique una asignaci\u00F3n de seguridad existente.
connectorSecurityMap.poolName=Nombre de Pool de Conexiones:
connectorSecurityMap.securityMapName=Nombre de Asignaci\u00F3n de Seguridad:
#it will be fine to leave value1, value2, and value3 not translated. These fields cannot take multibyte chars.
connectorSecurityMap.userGroups=Grupos de Usuarios:
connectorSecurityMap.userGroupsHelp=Ejemplo: valor1, valor2, valor3
connectorSecurityMap.principals=Principales:
connectorSecurityMap.principalsHelp=Ejemplo: valor1, valor2, valor3
connectorSecurityMap.backendPrincipal=Principal Backend
connectorSecurityMap.userName=Usuario:
connectorSecurityMap.password=Contrase\u00F1a:

workSecurityMaps.pageTitle=Asignaciones de Seguridad de Trabajo
workSecurityMaps.pageTitleHelp=Una asignaci\u00F3n de seguridad de trabajo asigna la identidad del emisor de la llamada del trabajo enviado por el principal del EIS o un grupo de usuarios del EIS del adaptador de recursos a un principal o grupo de usuarios adecuado del dominio de seguridad de GlassFish Server.
workSecurityMaps.tableTitle=Asignaciones de Seguridad de Trabajo
workSecurityMap.newPageTitle=Nueva Asignaci\u00F3n de Seguridad de Trabajo
workSecurityMap.newPageTitleHelp=Crea una asignaci\u00F3n de seguridad de trabajo nueva para un adaptador de recursos. Una asignaci\u00F3n de seguridad de trabajo asigna la identidad del emisor de la llamada del trabajo enviado por el principal del EIS o un grupo de usuarios del EIS del adaptador de recursos a un principal o grupo de usuarios adecuado del dominio de seguridad de GlassFish Server.
workSecurityMap.editPageTitle=Editar Asignaci\u00F3n de Seguridad de Trabajo
workSecurityMap.editPageTitleHelp=Modifique una asignaci\u00F3n de seguridad de trabajo existente de un adaptador de recursos.
workSecurityMap.Group=Grupo:
workSecurityMap.Principal=Principal:
workSecurityMap.MappedGroup=Grupo Asignado
workSecurityMap.EisGroup=Grupo EIS
workSecurityMap.EISGroupInlineHelp=Especifica una asignaci\u00F3n del grupo de usuarios EIS de backend al grupo de usuarios de GlassFish Server. Utilice una lista separada por comas para especificar m\u00E1s de una asignaci\u00F3n. Por ejemplo, grupo-eis-1=grupo-servidor-1,grupo-eis-2=grupo-servidor-2
workSecurityMap.EISPrincipalInlineHelp=Especifica una asignaci\u00F3n del principal EIS de backend al principal de GlassFish Server. Utilice una lista separada por comas para especificar m\u00E1s de una asignaci\u00F3n. Por ejemplo, principal-eis-1=principal-servidor-1,principal-eis-2=principal-servidor-2
workSecurityMap.PrincipalMapping=Asignaci\u00F3n de Principal
workSecurityMap.GroupMapping=Asignaci\u00F3n de Grupo

tree.resourceAdapterConfigs=Configuraciones del Adaptador de Recursos
resourceAdapterConfig.pageTitle=Configuraciones de Adaptador de Recursos
resourceAdapterConfig.pageTitleHelp=La configuraci\u00F3n del adaptador de recursos incluye la informaci\u00F3n de configuraci\u00F3n de un adaptador de recursos.
resourceAdapterConfig.tableTitle=Configuraciones de Adaptador de Recursos
resourceAdapterConfig.tabTitle=Configuraciones
resourceAdapterConfig.newPageTitle=Nueva Configuraci\u00F3n de Adaptador de Recursos
resourceAdapterConfig.newPageTitleHelp=Cree una nueva configuraci\u00F3n del adaptador de recursos.
resourceAdapterConfig.editPageTitle=Editar Configuraci\u00F3n de Adaptador de Recursos
resourceAdapterConfig.editPageTitleHelp=Modifique la configuraci\u00F3n de un adaptador de recursos existente.
resourceAdapterConfig.Name=Nombre de Adaptador de Recursos:
resourceAdapterConfig.NameHelp=Seleccione o introduzca un nombre de configuraci\u00F3n del adaptador de recursos.
resourceAdapterConfig.threadPoolId=ID de Pool de Threads:
resourceAdapterConfig.ThreadPoolIdsHelp=ID del pool de threads con el que el gestor de trabajo obtiene el thread. Use la p\u00E1gina <a href="#{request.contextPath}/web/configuration/threadPools.jsf">Pools de Threads</a> para crear un nuevo pool
resourceAdapterConfig.configs=Configuraciones


jcaPool.pooling=Pool:
jcaPool.poolingHelp=Si se define en false, desactiva el pool de conexiones
jcaPool.ping=Ping:
jcaPool.pingHelp=Si se activa, se hace ping en el pool durante la creaci\u00F3n o la nueva configuraci\u00F3n a fin de identificar y advertir si hay valores err\u00F3neos para sus atributos
jcaPool.poolSettings=Configuraci\u00F3n de Pool
jcaPool.initPoolSize=Tama\u00F1o de Pool Inicial y M\u00EDnimo:
jcaPool.initPoolSizeHelp=N\u00FAmero m\u00EDnimo e inicial de conexiones mantenidas en el pool
jcaPool.maxPoolSize=Tama\u00F1o de Pool M\u00E1ximo:
jcaPool.maxPoolSizeHelp=N\u00FAmero m\u00E1ximo de conexiones que se pueden crear para responder a las solicitudes del cliente
jcaPool.poolResize=Cantidad de Cambio de Tama\u00F1o del Pool:
jcaPool.poolResizeHelp=N\u00FAmero de conexiones que se van a eliminar cuando caduque el timeout de inactividad del pool
jcaPool.idleTimeout=Timeout de Inactividad:
jcaPool.idleTimeoutHelp=Tiempo m\u00E1ximo que una conexi\u00F3n puede permanecer inactiva en el pool
jcaPool.maxWait=Tiempo de Espera M\u00E1ximo:
jcaPool.maxWaitHelp=Tiempo que espera el emisor de la llamada antes de que se env\u00EDe un mensaje de timeout de conexi\u00F3n
jcaPool.Validation=Validaci\u00F3n de Conexi\u00F3n
jcaPool.conValidation=Validaci\u00F3n de Conexi\u00F3n:
jcaPool.conValidationHelp=Valida las conexiones y permite al servidor volver a conectar en caso de fallo
jcaPool.connectionSettings=Configuraci\u00F3n de Conexi\u00F3n
jcaPool.statementTimeoutInSeconds=Timeout de Sentencia:
jcaPool.statementTimeoutInSecondsHelp=Propiedad de timeout de una conexi\u00F3n para permitir la finalizaci\u00F3n de consultas demasiado largas. -1 indica que no se ha activado.
jcaPool.validateAtmostOnceInSeconds=Validar como M\u00E1ximo una Vez:
jcaPool.validateAtmostOnceInSecondsHelp=Especifica el intervalo de tiempo, en segundos, entre solicitudes consecutivas para validar una conexi\u00F3n como m\u00E1ximo una vez. El valor 0 significa que el atributo no est\u00E1 activado.
jcaPool.connectionLeakTimeoutInSeconds=Timeout de P\u00E9rdida:
jcaPool.connectionLeakTimeoutInSecondsHelp=El valor 0 indica que no se ha detectado ninguna p\u00E9rdida
jcaPool.connectionLeakReclaim=Recuperaci\u00F3n de P\u00E9rdida:
jcaPool.connectionLeakReclaimHelp=Si est\u00E1 activada, la conexi\u00F3n perdida ser\u00E1 reclamada por el pool despu\u00E9s de que se produzca el timeout de la p\u00E9rdida de conexi\u00F3n.
jcaPool.connectionCreationRetryAttempts=Reintentos de Creaci\u00F3n:
jcaPool.connectionCreationRetryAttemptsHelp=N\u00FAmero de intentos de crear una conexi\u00F3n nueva. 0 indica que no se han producido intentos.                     
jcaPool.connectionCreationRetryIntervalInSeconds=Intervalo de Reintentos:
jcaPool.connectionCreationRetryIntervalInSecondsHelp=Intervalo de tiempo entre los reintentos de creaci\u00F3n de una conexi\u00F3n. Se aplica cuando el valor de Reintentos de Creaci\u00F3n es superior a 0.
jcaPool.lazyConnectionEnlistment=Inscripci\u00F3n Lenta de Conexiones:
jcaPool.lazyConnectionEnlistmentHelp=Se realiza una inscripci\u00F3n del recurso en la transacci\u00F3n \u00FAnicamente cuando se utiliza realmente en un m\u00E9todo
jcaPool.lazyConnectionAssociation=Asociaci\u00F3n Lenta:
jcaPool.lazyConnectionAssociationHelp=Las conexiones se asocian de forma lenta cuando se realiza una operaci\u00F3n en ellas
jcaPool.associationWithThread=Asociar a Thread:
jcaPool.associationWithThreadHelp=Cuando el mismo thread necesita una conexi\u00F3n, se puede volver a utilizar la conexi\u00F3n ya asociada a ese thread.
jcaPool.matchConnections=Conexiones Coincidentes:
jcaPool.matchConnectionsHelp=Active o desactive la b\u00FAsqueda de coincidencias de conexiones del pool
jcaPool.maxConnectionUsageCount=Uso M\u00E1ximo de Conexi\u00F3n:
jcaPool.maxConnectionUsageCountHelp=El pool volver\u00E1 a utilizar las conexiones durante el n\u00FAmero especificado de veces y despu\u00E9s se cerrar\u00E1n. 0 indica que no se ha activado la funci\u00F3n.

msg.Error.resourceAdapterNameCannotBeEmpty=Debe especificar el nombre de configuraci\u00F3n del adaptador de recursos.

msg.warning.poolCreatedPingFailed=Pool creado correctamente con la siguiente advertencia
msg.warning.poolSavedPingFailed=Valores guardados correctamente con la siguiente advertencia


rar.editPageTitle=Editar un M\u00F3dulo de Conector
rar.editPageTitleHelp=Modificar un adaptador de recursos existente. Haga clic en <a href="#{request.contextPath}/jca/resourceAdapterConfigs.jsf">Configuraciones del Adaptador de Recursos</a> para crear o modificar la configuraci\u00F3n asociada.

tree.connectorService=Servicio de Conector

connectorService.editPageTitle=Servicio de Conector
connectorService.editPageTitleHelp=Los atributos especificados se aplicar\u00E1n a todos los adaptadores de recursos desplegados en GlassFish Server.
connectorService.shutdownTimeout=Timeout de Cierre:
connectorService.shutdownTimeoutHelp=Se ignorar\u00E1n los adaptadores de recursos que tardan m\u00E1s tiempo y continuar\u00E1 el procedimiento de cierre
connectorService.classLoadingPolicy=Pol\u00EDtica de Carga de Clases del Conector:
connectorService.classLoadingPolicyHelp=Pol\u00EDtica que se utiliza para cargar las clases.
