#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2012-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
create.module.config=cr\u00E9e ou affiche la configuration par d\u00E9faut pour les services indiqu\u00E9s dans la cible donn\u00E9e.
create.module.config.success=La configuration du service donn\u00E9 a \u00E9t\u00E9 cr\u00E9\u00E9e.
create.module.config.failure=Echec de l''ex\u00E9cution de la commande pour la raison suivante : {0}. Pour plus de d\u00E9tails, consultez le fichier journal.
create.module.config.no.such.service=Le service que vous avez indiqu\u00E9, {0}, ne correspond \u00E0 aucun service disponible dans la variable d''environnement classpath.
create.module.config.service.name.ignored=Un seul des param\u00E8tres de nom de service --all peut \u00EAtre utilis\u00E9 \u00E0 la fois. Vous ne pouvez pas utiliser ces deux options ensemble.
create.module.config.no.service.no.all=Aucun nom de service n''a \u00E9t\u00E9 indiqu\u00E9 et -all n''est pas utilis\u00E9. Cela entra\u00EEne l''affichage de toutes les configurations par d\u00E9faut non fusionn\u00E9es avec la configuration de domaine sous la cible {0}.
create.module.config.show.all=Affichage de toutes les configurations par d\u00E9faut non fusionn\u00E9es avec la configuration de domaine sous la cible {0}.
create.module.config.creating.all=Cr\u00E9ation de tous les \u00E9l\u00E9ments de configuration par d\u00E9faut qui ne sont pas pr\u00E9sents dans le fichier domain.xml sous la cible {0}.
create.module.config.creating.for.service.name=Cr\u00E9ation d''une configuration par d\u00E9faut pour {0} sous la cible {1}...
create.module.config.show.all.failed=Echec de l''affichage de toutes les configurations par d\u00E9faut non fusionn\u00E9es avec la configuration de domaine sous la cible {0} pour la raison suivante : {1}.
create.module.config.creating.all.failed=Echec de la cr\u00E9ation de tous les \u00E9l\u00E9ments de configuration par d\u00E9faut qui ne sont pas pr\u00E9sents dans le fichier domain.xml sous la cible {0} pour la raison suivante : {1}.
create.module.config.creating.for.service.name.failed=Echec de la cr\u00E9ation d''une configuration de module pour {0} sous la cible {1} pour la raison suivante : {2}.
create.module.config.not.such.a.service.found=Un ConfigBean de type {0} qui effectue la conversion vers les \u00E9l\u00E9ments de configuration de votre nom de service n''existe pas.
create.module.config.config.embedded.in.class=La configuration de service que vous avez demand\u00E9e, {0}, ne provient pas d''un fichier de fragment de code. La configuration par d\u00E9faut est extraite des valeurs par d\u00E9faut indiqu\u00E9es dans le code.
create.module.config.already.exists=Une configuration pour {0} existe d\u00E9j\u00E0. La commande n''a pas modifi\u00E9 la configuration existante.
create.module.config.all=Lorsque la commande est indiqu\u00E9e, elle est ex\u00E9cut\u00E9e sur toutes les configurations de service disponibles dans la variable d'environnement classpath.
create.module.config.target=La commande sera ex\u00E9cut\u00E9e sur la configuration propre \u00E0 la cible. Par exemple, si cluster-01 est utilis\u00E9 comme cible, la commande sera ex\u00E9cut\u00E9e sur la configuration de cluster-01 uniquement.
delete.module.config.no.configuration=Aucune configuration personnalis\u00E9e n'existe pour ce service et la configuration par d\u00E9faut n'a pas \u00E9t\u00E9 ajout\u00E9e au fichier domain.xml.
delete.module.config.failed.to.delete.config=Echec de la suppression de la configuration de service pour {0} en raison de {1}. Pour plus de d\u00E9tails, consultez le fichier journal de serveur.
delete.module.config.target=La commande sera ex\u00E9cut\u00E9e sur la configuration propre \u00E0 la cible. Par exemple, si cluster-01 est utilis\u00E9 comme cible, la commande sera ex\u00E9cut\u00E9e sur la configuration de cluster-01 uniquement.
delete.module.config=Supprime la configuration du service indiqu\u00E9 comme \u00E9tant le param\u00E8tre principal \u00E0 partir de la cible sp\u00E9cifi\u00E9e \u00E0 l'aide du param\u00E8tre cible. Si aucune cible n'est indiqu\u00E9e, la configuration sera supprim\u00E9e de la configuration du serveur.
delete.module.config.service.name.is.required=Le nom de service est obligatoire, indiquez le service dont vous souhaitez supprimer la configuration par d\u00E9faut.
delete.module.config.no.such.target=Aucune cible de ce type n'existe sur ce domaine.
create.module.config.no.such.target=Aucune cible de ce type n'existe sur ce domaine.
delete.module.config.not.such.a.service.found=Votre nom de service ne correspond \u00E0 aucun service install\u00E9 sur ce domaine.
create.module.config.target.name.invalid=Le nom de cible indiqu\u00E9 n'est pas valide. V\u00E9rifiez-le et r\u00E9essayez.
delete.module.config.target.name.invalid=Le nom de cible indiqu\u00E9 n'est pas valide. V\u00E9rifiez-le et r\u00E9essayez.
get.active.config.target.name.invalid=Le nom de cible indiqu\u00E9 n'est pas valide. V\u00E9rifiez-le et r\u00E9essayez.
get.active.config.service.name.required=Vous devez indiquer un nom de service pour obtenir sa configuration active.
get.active.config.getting.active.config.for.service.failed=Echec de l''obtention d''une configuration active pour {0} sous la cible {1} pour la raison suivante : {2}.
get.active.config.not.such.a.service.found=Un ConfigBean de type {0} qui effectue la conversion vers votre nom de service n''existe pas.
delete.module.config.failed.deleting.dependant=Echec de la suppression de tous les \u00E9l\u00E9ments de configuration relatifs \u00E0 votre formulaire de service domain.xml. Vous pouvez utiliser create-module-config --dryRun avec votre nom de module pour visualiser toutes les configurations pertinentes et tenter d'enlever les \u00E9l\u00E9ments de configuration
at.location=A l'emplacement :
get.active.config.target.service.and.all.exclusive=Vous ne pouvez pas sp\u00E9cifier un nom de service et utiliser --all=true en m\u00EAme temps.
create.module.config.done=Configuration par d\u00E9faut pour {0} ajout\u00E9e au fichier domain.xml.
