#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2012-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
create.module.config=crea o muestra la configuraci\u00F3n por defecto de los servicios proporcionados en el destino indicado.
create.module.config.success=La configuraci\u00F3n del servicio proporcionado se ha creado correctamente.
create.module.config.failure=Fallo al ejecutar el comando debido a: {0}. Para obtener m\u00E1s informaci\u00F3n, consulte el archivo log.
create.module.config.no.such.service=El servicio especificado {0} no corresponde a ning\u00FAn servicio disponible en la classpath.
create.module.config.service.name.ignored=S\u00F3lo puede utilizarse uno de los par\u00E1metros de nombre de servicio --all. Estas dos opciones no pueden utilizarse al mismo tiempo.
create.module.config.no.service.no.all=No se ha especificado ning\u00FAn nombre de servicio y tampoco se ha utilizado --all. Se muestran todas las configuraciones por defecto sin fusionar con la configuraci\u00F3n de dominio en el destino {0}.
create.module.config.show.all=Se muestran todas las configuraciones por defecto no fusionadas con la configuraci\u00F3n de dominio en el destino {0}.
create.module.config.creating.all=Se han creado todos los elementos de configuraci\u00F3n por defecto que no est\u00E1n presentes en domain.xml en el destino {0}.
create.module.config.creating.for.service.name=Creando la configuraci\u00F3n por defecto para {0} en el destino {1}...
create.module.config.show.all.failed=Fallo al mostrar todas las configuraciones por defecto sin fusionar con la configuraci\u00F3n de dominio en el destino {0} debido a: {1}.
create.module.config.creating.all.failed=Fallo al crear todos los elementos de configuraci\u00F3n por defecto que no est\u00E1n presentes en domain.xml en el destino {0} debido a: {1}.
create.module.config.creating.for.service.name.failed=Fallo al crear la configuraci\u00F3n del m\u00F3dulo para {0} en el destino {1} debido a: {2}.
create.module.config.not.such.a.service.found=No existe un ConfigBean de tipo {0} que convierte los elementos de configuraci\u00F3n del nombre de servicio.
create.module.config.config.embedded.in.class=Tenga en cuenta que la configuraci\u00F3n de servicio que ha solicitado, {0}, no proviene de un archivo de snippet. La configuraci\u00F3n por defecto se extrae de los valores por defecto que se especifican en el c\u00F3digo.
create.module.config.already.exists=La configuraci\u00F3n de {0} ya existe. El comando no ha cambiado la configuraci\u00F3n existente.
create.module.config.all=Se ha especificado el comando que funcionar\u00E1 en todas las configuraciones de servicio disponibles en la classpath.
create.module.config.target=El comando funcionar\u00E1 con la configuraci\u00F3n espec\u00EDfica del destino. Por ejemplo, si es cluster-01 el que se ha utilizado como destino, el comando funcionar\u00E1 s\u00F3lo en la configuraci\u00F3n de cluster-01.
delete.module.config.no.configuration=No existe ninguna configuraci\u00F3n personalizada para este servicio ni dicha configuraci\u00F3n se ha agregado a domain.xml.
delete.module.config.failed.to.delete.config=Fallo al suprimir la configuraci\u00F3n de servicio de {0} debido a {1}. Para obtener m\u00E1s informaci\u00F3n, compruebe el archivo log del servidor.
delete.module.config.target=El comando funcionar\u00E1 con la configuraci\u00F3n espec\u00EDfica del destino. Por ejemplo, si es cluster-01 el que se ha utilizado como destino, el comando funcionar\u00E1 s\u00F3lo en la configuraci\u00F3n de cluster-01.
delete.module.config=Suprime la configuraci\u00F3n del servicio especificada como el par\u00E1metro principal del destino especificado utilizando el par\u00E1metro de destino. Si no se especifica ning\u00FAn destino, se eliminar\u00E1 de la configuraci\u00F3n del servidor.
delete.module.config.service.name.is.required=Se necesita el nombre del servicio, especifique el servicio del que desea suprimir su configuraci\u00F3n por defecto.
delete.module.config.no.such.target=No existe ese destino en este dominio.
create.module.config.no.such.target=No existe ese destino en este dominio.
delete.module.config.not.such.a.service.found=El nombre de servicio no coincide con ning\u00FAn servicio instalado en este dominio.
create.module.config.target.name.invalid=El nombre de destino especificado no es v\u00E1lido. Vuelva a comprobar el nombre de destino e int\u00E9ntelo de nuevo.
delete.module.config.target.name.invalid=El nombre de destino especificado no es v\u00E1lido. Vuelva a comprobar el nombre de destino e int\u00E9ntelo de nuevo.
get.active.config.target.name.invalid=El nombre de destino especificado no es v\u00E1lido. Vuelva a comprobar el nombre de destino e int\u00E9ntelo de nuevo.
get.active.config.service.name.required=Necesita especificar un nombre de servicio para obtener su configuraci\u00F3n activa.
get.active.config.getting.active.config.for.service.failed=Fallo al obtener la configuraci\u00F3n activa para {0} en el destino {1} debido a: {2}.
get.active.config.not.such.a.service.found=No existe un ConfigBean de tipo {0} que convierte el nombre de servicio.
delete.module.config.failed.deleting.dependant=Fallo al eliminar todos los elementos de configuraci\u00F3n relacionados con el formulario de servicio domain.xml. Puede utilizar create-module-config --dryRun con el nombre del m\u00F3dulo para consultar toda la configuraci\u00F3n relevante e intentar eliminar los elementos de configuraci\u00F3n
at.location=En la ubicaci\u00F3n:
get.active.config.target.service.and.all.exclusive=La especificaci\u00F3n de un nombre de servicio y el uso de --all=true no se pueden utilizar al mismo tiempo.
create.module.config.done=Se ha agregado la configuraci\u00F3n por defecto de {0} a domain.xml.
