#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

validator.invalid_value=Valor no v\u00E1lido para {0}: {1}
validator.invalid_type=Tipo no v\u00E1lido para {0}. Se esperaba {1} o el subtipo, pero se ha obtenido {2}
fileValidator.no_read=No se dispone de permiso de lectura: {0}
fileValidator.no_write=No se dispone de permiso de escritura: {0}
fileValidator.not_a_dir={0} no es un directorio
portValidator.in_use=El puerto {0} est\u00E1 en uso
domainConfig=configuraci\u00F3n de dominio
adminUserComment=# Domain User and Password - Do Not Delete Entry Above
keyStoreNotCreated=Error al crear el almac\u00E9n de claves {0}
trustStoreNotCreated=Error al crear el almac\u00E9n de confianza {0}
masterPasswordFileNotCreated=Error al crear el archivo de contrase\u00F1as maestras {0}
timerDbnNotCreated=Error al crear el archivo dbn de la base de datos de temporizadores
timerWalNotCreated=Error al crear el archivo wal de la base de datos de temporizadores
jbiRegistryTemplateNotCopied=Error al copiar el archivo de plantilla del registro de JBI
installRoot=ra\u00EDz de instalaci\u00F3n
cannotDeleteJmsProviderInstance=Error al suprimir la instancia del broker de MQ
masterPasswordFileNotRead=Error al leer el archivo de contrase\u00F1as maestras {0}

keyStorePasswordNotChanged=Error al cambiar la contrase\u00F1a del almac\u00E9n de claves para el almac\u00E9n {0}

s1asKeyPasswordNotChanged=Error al cambiar la contrase\u00F1a de la clave por defecto con el alias s1as para el almac\u00E9n {0}

passwordAliasPasswordNotChanged=Error al cambiar la contrase\u00F1a del almac\u00E9n de alias de contrase\u00F1as {0}

couldNotValidateMasterPassword=Se ha producido una excepci\u00F3n al validar la contrase\u00F1a maestra con el almac\u00E9n {0}

masterPasswordInvalid=La contrase\u00F1a introducida no es v\u00E1lida
derbyEjbTimerDBNotCreated=No se ha podido crear la base de datos del temporizador de EJB embebida; mensaje detallado: {0}
noDerbyLog=No se ha podido leer el archivo log derby. No hay ninguna informaci\u00F3n detallada disponible.
nullArg=Se ha especificado un argumento nulo.
smfTokenNeeded=El token necesario [{0}] se ha inicializado con un valor no v\u00E1lido [{1}]. Defina el valor correctamente con la interfaz de ServiceHandler.
invalidTO=Valor no v\u00E1lido [{0}] especificado como timeout. S\u00F3lo se permiten valores enteros no negativos.
serviceNameInvalid=Nombre no v\u00E1lido [{0}] para el servicio.
smfManifestExists=Parece que el archivo de manifiesto [{0}] ya existe. Esto implica que ha habido un intento anterior de crear el servicio con el mismo nombre. Seleccione otro nombre para el servicio o suprima el servicio y el archivo de manifiesto correspondiente y vuelva a intentarlo. 
smfManifestFolderExists=Parece que la carpeta de servicios de la jerarqu\u00EDa de SMF de appserver [{0}] ya existe. No se puede continuar hasta que se haya limpiado.
doesNotExist=No se ha encontrado el objeto [{0}].
serviceTypeNotSet=El tipo de servicio no est\u00E1 configurado correctamente.
serviceTemplateNotFound=La plantilla de servicio [{0}] no existe; se ha producido un error en el entorno de configuraci\u00F3n como, por ejemplo, INSTALL_ROOT, etc.
notSolaris10=La plataforma presente, sistema operativo: {0} versi\u00F3n: {1} no es Solaris 10. No est\u00E1 soportada esta utilidad en plataformas que no sean Solaris 10.
noPermissionToCreateManifest=El usuario [{0}] no tiene permiso para crear los archivos y directorios relacionados con el manifiesto de servicio en [{1}]. Esta estructura es necesaria para las directrices de SMF. Convi\u00E9rtase en superusuario para realizar esta operaci\u00F3n o p\u00F3ngase en contacto con el Administrador del Sistema para obtener de forma expl\u00EDcita los permisos pertinentes y vuelva a intentarlo.
noSmfAuth=Parece que el usuario [{0}] no dispone de las autorizaciones necesarias [solaris.smf.*] en este sistema para crear y configurar un servicio de SMF. Las autorizaciones disponibles son [{1}].\nConsulte smf_security(5), rbac(5).\n
missingParamsInFile=El archivo de contrase\u00F1as especificado como [{0}] no contiene la propiedad [{1}] con el formato necesario. Vuelva a ejecutar el comando despu\u00E9s de agregar [{1}=valor] a este archivo en una l\u00EDnea independiente.
serviceNameExists=Parece que existe un servicio de SMF con el nombre [{0}], tal y como muestra el comando [svcs -a] en esta m\u00E1quina. Intente crear de nuevo el servicio con otro nombre.
runtimeStatusToString={0} es {1}
fileNotFound=No se ha encontrado el archivo {0}.
error=error
runtimeStatusToStringStopCluster.alreadyStopped=La instancia en cluster {0} ya se hab\u00EDa parado.
runtimeStatusToStringStopCluster.success=La instancia en cluster {0} se ha parado correctamente.
runtimeStatusToStringStopCluster.stoppedToRunning=Esto no es posible. La instancia en cluster {0} se ha parado y ahora es: {1}
runtimeStatusToStringStopCluster.error=La instancia en cluster {0} no se ha podido parar. Originalmente estaba en este estado: [{1}] y ahora est\u00E1 en el estado siguiente: [{2}].
noSuitableServiceImplementation=No se ha encontrado ning\u00FAn manejador de servicios adecuado para esta plataforma. No se puede crear el servicio.
runtimeStatusToStringStartCluster.alreadyStarted=La instancia en cluster {0} ya se est\u00E1 ejecutando.
runtimeStatusToStringStartCluster.success=La instancia en cluster {0} se ha iniciado correctamente.
runtimeStatusToStringStartCluster.startedToStopped=Esto no es posible. La instancia en cluster {0} estaba en ejecuci\u00F3n y ahora es: {1}
runtimeStatusToStringStartCluster.error=La instancia en cluster {0} no se ha podido iniciar. Originalmente estaba en este estado: [{1}] y ahora est\u00E1 en el estado siguiente: [{2}].

CertificateDN=El nombre distinguido del certificado del servidor X.509 autofirmado es:\n[{0}]
SomeProblemWithKeytool= El proceso de creaci\u00F3n de un dominio incluye el paso de crear una clave primaria y\n un certificado de servidor autofirmado. La raz\u00F3n por la que falla este paso se muestra a continuaci\u00F3n.\n Esto se podr\u00EDa deber a que el programa keytool que ofrece JDK no se ha encontrado (p. ej.\n est\u00E1 ejecutando con JRE) o por otra raz\u00F3n. No pasa nada, ya que\n puede utilizar el programa keytool de JDK siempre que lo necesite. Se crear\u00E1 un almac\u00E9n\n de claves JKS temporal. Debe sustituirlo con un almac\u00E9n de claves adecuado antes de usarlo para SSL.\n Consulte la documentaci\u00F3n para obtener m\u00E1s informaci\u00F3n. El error real es:\n{0}
