# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2016-2018 Payara Foundation and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://github.com/payara/Payara/blob/master/LICENSE.txt
# See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at glassfish/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# The Payara Foundation designates this particular file as subject to the "Classpath"
# exception as provided by the Payara Foundation in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
hazelcast.configurationTitle=\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210
hazelcast.configurationTitleHelp=Payara\u306E\u57CB\u3081\u8FBC\u307F\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u304A\u3088\u3073\u69CB\u6210\u3057\u307E\u3059\u3002<br/>\
<br/>\u300C<a href="/cluster/availability/availabilityService.jsf?configName=#{configName}">\u53EF\u7528\u6027\u30B5\u30FC\u30D3\u30B9</a>\u300D\u3067Hazelcast\u3092Web\u304A\u3088\u3073EJB\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6C38\u7D9A\u6027\u30BF\u30A4\u30D7\u3068\u3057\u3066\u4F7F\u7528\u3059\u308B\u306B\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 \
<br/>\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067<a href='https://jcp.org/en/jsr/detail?id=107'>JCache (JSR 107)</a>\u306E\u6A5F\u80FD\u3068API\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.local.configurationTitle=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u306E\u8A73\u7D30\u8A2D\u5B9A
hazelcast.local.configurationTitleHelp=\u3053\u3053\u3067\u306F\u3053\u306E\u69CB\u6210\u3092\u4F7F\u7528\u3059\u308B\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u8A73\u7D30\u8A2D\u5B9A\u3092\u9069\u7528\u3057\u307E\u3059\u3002\
\u3053\u308C\u3089\u306E\u69CB\u6210\u30AA\u30D7\u30B7\u30E7\u30F3\u3068\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u3092\u7D44\u307F\u5408\u308F\u305B\u308B\u3053\u3068\u3067\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u3069\u306E\u3088\u3046\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306B\u53C2\u52A0\u3059\u308B\u306E\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
hazelcast.configuration.enabled=\u6709\u52B9
hazelcast.configuration.enabledHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u8D77\u52D5\u6642\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u958B\u59CB\u3057\u307E\u3059\u3002\u3053\u308C\u3068\u300C\u52D5\u7684\u300D\u30DC\u30C3\u30AF\u30B9\u306E\u4E21\u65B9\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u305F\u5834\u5408\u306B\u306F\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u76F4\u3061\u306B\u958B\u59CB\u3057\u307E\u3059\u3002<br>\
DAS\u3067\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306F\u5E38\u306B\u6709\u52B9\u3067\u3059\u3002
hazelcast.configuration.configFile=\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9
hazelcast.configuration.configFileHelp=\u3053\u306E\u30DA\u30FC\u30B8\u306E\u5168\u8A2D\u5B9A\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3059\u308B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9 (\u30C9\u30E1\u30A4\u30F3\u306Econfig\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304B\u3089\u306E\u76F8\u5BFE\u30D1\u30B9) \u3002<br>\
\u3053\u306E\u9805\u76EE\u304C\u8A2D\u5B9A\u3055\u308C\u3001\u304B\u3064\u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u306B\u306F\u3001\u4EE5\u4E0B\u306E\u8A2D\u5B9A\u306F\u3059\u3079\u3066\u7121\u8996\u3055\u308C\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u5185\u5BB9\u304C\u9069\u7528\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.startPort=\u958B\u59CB\u30DD\u30FC\u30C8
hazelcast.configuration.startPortHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u30EA\u30B9\u30F3\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30DD\u30FC\u30C8\u3002\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u6709\u52B9\u306A\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u307E\u3067\u3053\u306E\u5024\u3092\u30A4\u30F3\u30AF\u30EA\u30E1\u30F3\u30C8\u3057\u307E\u3059\u3002
hazelcast.configuration.multicastPort=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30DD\u30FC\u30C8
hazelcast.configuration.multicastPortHelp=\u300Cmulticast\u300D\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u30B0\u30EB\u30FC\u30D7\u901A\u4FE1\u3067\u4F7F\u7528\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30DD\u30FC\u30C8
hazelcast.configuration.multicastGroup=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.multicastGroupHelp=\u300Cmulticast\u300D\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u901A\u4FE1\u3067\u4F7F\u7528\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.tcpipMembers=TCP/IP\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.tcpipMembersHelp=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u306B\u300Ctcpip\u300D\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u63A5\u7D9A\u5148\u3068\u306A\u308B\u4ED6\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.configuration.discoveryMode=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9
hazelcast.configuration.discoveryModeHelp=DAS\u304C\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u4ED6\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u63A2\u3059\u65B9\u6CD5
hazelcast.configuration.interfaces=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9
hazelcast.configuration.interfacesHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.configuration.dasPublicAddress=DAS\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasPublicAddressHelp=\u4ED6\u306E\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u304CDAS\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3002\u7A7A\u767D\u306E\u5834\u5408\u306F\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
hazelcast.configuration.dasBindAddress=DAS\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasBindAddressHelp=DAS\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u306E\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasPort=DAS\u958B\u59CB\u30DD\u30FC\u30C8
hazelcast.configuration.dasPortHelp=DAS\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u30EA\u30B9\u30F3\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30DD\u30FC\u30C8\u3002\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u6709\u52B9\u306A\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u307E\u3067\u3053\u306E\u5024\u3092\u30A4\u30F3\u30AF\u30EA\u30E1\u30F3\u30C8\u3057\u307E\u3059\u3002
hazelcast.configuration.clusterName=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u540D
hazelcast.configuration.clusterNameHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B0\u30EB\u30FC\u30D7\u540D\u3002\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u69CB\u6210\u3059\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u30B0\u30EB\u30FC\u30D7\u540D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u4E00\u81F4\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.clusterPassword=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9
hazelcast.configuration.clusterPasswordHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u306F\u3059\u3079\u3066\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u540C\u4E00\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.jndiName=Hazelcast\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9JNDI\u540D
hazelcast.configuration.jndiNameHelp=Hazelcast\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.licenseKey=\u30E9\u30A4\u30BB\u30F3\u30B9\u30FB\u30AD\u30FC
hazelcast.configuration.licenseKeyHelp=Hazelcast Enterprise\u306E\u30E9\u30A4\u30BB\u30F3\u30B9\u30FB\u30AD\u30FC
hazelcast.configuration=\u69CB\u6210
hazelcast.configurationTip=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210
hazelcast.membersTab=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.membersTabTip=View the Data Grid Instances
hazelcast.hazelcastTabs=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9
hazelcast.membersTitle=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.membersTitleHelp=\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u8868\u793A\u53EF\u80FD\u306A\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.domainMembersTitleHelp=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u8868\u793A\u53EF\u80FD\u306A\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.members.members=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.members.membersHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.dynamic=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u518D\u8D77\u52D5
hazelcast.configuration.dynamicHelp=\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u3092\u5FC5\u8981\u3068\u305B\u305A\u306B\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u306E\u5909\u66F4\u3092\u76F4\u3061\u306B\u53CD\u6620\u3057\u307E\u3059\u3002<br/>\u8B66\u544A \u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3067\u591A\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u76F4\u3061\u306B\u518D\u8D77\u52D5\u3059\u308B\u3068\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30C7\u30FC\u30BF\u304C\u5E83\u7BC4\u56F2\u306B\u5931\u308F\u308C\u308B\u539F\u56E0\u3068\u306A\u308A\u5F97\u307E\u3059\u3002
hazelcast.configuration.lite=Lite\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.liteHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092Lite\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3057\u307E\u3059\u3002\u5177\u4F53\u7684\u306B\u306F\u3001Lite\u30E1\u30F3\u30D0\u30FC\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306B\u306F\u53C2\u52A0\u3057\u307E\u3059\u304C\u81EA\u8EAB\u306E\u30D2\u30FC\u30D7\u306B\u30C7\u30FC\u30BF\u3092\u6301\u3061\u307E\u305B\u3093\u3002
hazelcast.configuration.hostaware =Host Aware Partitioning
hazelcast.configuration.hostawareHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u30C7\u30FC\u30BF\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306F\u540C\u3058IP\u30A2\u30C9\u30EC\u30B9\u3092\u6301\u3064\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u306F\u4FDD\u6301\u3055\u308C\u307E\u305B\u3093\u3002Payara Micro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u542B\u3080\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u3059\u3079\u3066\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067Host Aware Partitioning\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.memberGroup=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.memberGroupHelp=\u3053\u306E\u69CB\u6210\u3092\u4F7F\u7528\u3059\u308B\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.publicAddress=\u3053\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30CE\u30FC\u30C9\u306E\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.publicAddressHelp=\u3053\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30CE\u30FC\u30C9\u3067\u4F7F\u7528\u3059\u308B\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9\u3002\u30CE\u30FC\u30C9\u304CNAT\u306E\u80CC\u5F8C\u306B\u3042\u308B\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.cacheManagerJndiName=JCache \u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3 JNDI\u540D
hazelcast.configuration.cacheManagerJndiNameHelp=JCache \u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3 \u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.cachingProviderJndiName=JCache \u30AD\u30E3\u30C3\u30B7\u30F3\u30B0\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0 JNDI\u540D
hazelcast.configuration.cachingProviderJndiNameHelp=JCache \u30AD\u30E3\u30C3\u30B7\u30F3\u30B0\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0 \u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.executorPoolSize=\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.executorPoolSizeHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.scheduledExecutorPoolSize=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.scheduledExecutorPoolSizeHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.executorQueueCapacity=\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3
hazelcast.configuration.scheduledExecutorQueueCapacity=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3
hazelcast.configuration.executorQueueCapacityHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u6709\u52B9\u306B\u306A\u308B\u307E\u3067\u5B9F\u884C\u304C\u30AD\u30E5\u30FC\u30A4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.scheduledExecutorQueueCapacityHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u6709\u52B9\u306B\u306A\u308B\u307E\u3067\u5B9F\u884C\u304C\u30AD\u30E5\u30FC\u30A4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
hazelcast.allInstancesTableTitle=\u3059\u3079\u3066\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.allInstancesTable.instanceName=\u540D\u79F0
hazelcast.allInstancesTable.instanceType=\u30BF\u30A4\u30D7
hazelcast.allInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.allInstancesTable.hostName=\u30DB\u30B9\u30C8
hazelcast.allInstancesTable.httpPorts=HTTP\u30DD\u30FC\u30C8
hazelcast.allInstancesTable.httpsPorts=HTTPS\u30DD\u30FC\u30C8
hazelcast.allInstancesTable.adminPort=\u7BA1\u7406\u30DD\u30FC\u30C8
hazelcast.allInstancesTable.hazelcastPort=Hazelcast\u30DD\u30FC\u30C8
hazelcast.allInstancesTable.liteMember=Lite\u30E1\u30F3\u30D0\u30FC
hazelcast.allInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.allInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.serverInstancesTableTitle=Payara Server\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.serverInstancesTable.instanceName=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D
hazelcast.serverInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.serverInstancesTable.hostName=\u30DB\u30B9\u30C8\u540D
hazelcast.serverInstancesTable.httpPorts=HTTP \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.httpsPorts=HTTPS \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.adminPort=\u7BA1\u7406 \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.hazelcastPort=Hazelcast \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.liteMember=Lite \u30E1\u30F3\u30D0\u30FC
hazelcast.serverInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.serverInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306BPayara Server\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.microInstancesTableTitle=Payara Micro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.microInstancesTable.select=\u9078\u629E
hazelcast.microInstancesTable.instanceName=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D
hazelcast.microInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.microInstancesTable.hostName=\u30DB\u30B9\u30C8\u540D
hazelcast.microInstancesTable.httpPorts=HTTP \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.httpsPorts=HTTPS \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.adminPort=\u7BA1\u7406 \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.hazelcastPort=Hazelcast \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.liteMember=Lite \u30E1\u30F3\u30D0\u30FC
hazelcast.microInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.microInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306BMicro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.microInstancesTable.sendAdminCommand.label=\u30B3\u30DE\u30F3\u30C9:
hazelcast.microInstancesTable.sendAdminCommand.button=Asadmin\u30B3\u30DE\u30F3\u30C9\u9001\u4FE1
hazelcast.microInstancesTable.sendAdminCommand.confirm=Asadmin\u30B3\u30DE\u30F3\u30C9\u3092\u9001\u4FE1\u3057\u307E\u3059\u304B?
hazelcast.microInstancesTable.sendAdminCommand.error=\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
tree.hazelcast=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9

environmentWarning.environmentWarningTab=\u74B0\u5883\u8B66\u544A
environmentWarning.environmentWarningTabTip=\u300C\u74B0\u5883\u8B66\u544A\u300D\u30BF\u30D6
environmentWarning.configurationTitle=\u74B0\u5883\u8B66\u544A
environmentWarning.configurationTitleHelp=\u30E6\u30FC\u30B6\u30FC\u306B\u30B5\u30FC\u30D0\u30FC\u306E\u72B6\u614B\u3092\u77E5\u3089\u305B\u308B\u76EE\u7684\u3067\u3001\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u4E0A\u90E8\u306B\u8868\u793A\u3059\u308B\u8B66\u544A\u30D0\u30FC\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u4F8B\u3048\u3070\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u5546\u7528\u74B0\u5883\u306B\u5BFE\u3057\u3066\u5909\u66F4\u3092\u884C\u304A\u3046\u3068\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u6CE8\u610F\u559A\u8D77\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
environmentWarning.configuration.enabledHelp=\u74B0\u5883\u8B66\u544A\u30D0\u30FC\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
environmentWarning.configuration.message=\u8B66\u544A\u30E1\u30C3\u30BB\u30FC\u30B8
environmentWarning.configuration.messageHelp=\u30D0\u30FC\u306B\u8868\u793A\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
environmentWarning.configuration.backgroundColour=\u8B66\u544A\u306E\u80CC\u666F\u8272
environmentWarning.configuration.backgroundColourHelp=\u8B66\u544A\u30D0\u30FC\u306E\u80CC\u666F\u8272\u309216\u9032\u30C8\u30EA\u30D7\u30EC\u30C3\u30C8\u8868\u8A18\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024: #D9534F.
environmentWarning.configuration.textColour=\u8B66\u544A\u306E\u6587\u5B57\u8272
environmentWarning.configuration.textColourHelp=\u8B66\u544A\u30D0\u30FC\u306E\u6587\u5B57\u8272\u309216\u9032\u30C8\u30EA\u30D7\u30EC\u30C3\u30C8\u8868\u8A18\u3067\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024: #FFFFFF.

payaraRestEndpoint.viewEndpointsLink=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8868\u793A
payaraRestEndpoint.endpointTableTitle=REST\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8
payaraRestEndpoint.endpointPageTitle=REST\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8
payaraRestEndpoint.endpointPageTitleHelp=\u9078\u629E\u3055\u308C\u305F\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u5C5E\u3057\u3066\u3044\u308B\u3059\u3079\u3066\u306EREST\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u30EA\u30B9\u30C8\u3092\u8868\u793A\u3057\u307E\u3059
payaraRestEndpoint.endpointPath=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u30FB\u30D1\u30B9
payaraRestEndpoint.requestMethod=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30E1\u30BD\u30C3\u30C9

cdiDevMode.toolLink=CDI\u30D7\u30ED\u30FC\u30D6
cdiDevMode.toolPageTitle=CDI\u958B\u767A\u30C4\u30FC\u30EB
cdiDevMode.toolPageTitleHelp=\u5B9F\u884C\u6642\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306ECDI\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3092\u691C\u67FB\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002

asadminRecorder.configuration=\u69CB\u6210
asadminRecorder.configurationTip=Asadmin\u30EC\u30B3\u30FC\u30C0\u30FC\u69CB\u6210
asadminRecorder.configurationTitle=Asadmin\u30EC\u30B3\u30FC\u30C0\u30FC\u69CB\u6210
asadminRecorder.configurationTitleHelp=Asadmin\u30EC\u30B3\u30FC\u30C0\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u8A2D\u5B9A\u5024\u3092\u69CB\u6210\u3057\u307E\u3059\u3002
asadminRecorder.configuration.enabled=\u6709\u52B9
asadminRecorder.configuration.enabledHelp=Asadmin\u30EC\u30B3\u30FC\u30C0\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u73FE\u5728\u306E\u72B6\u614B\u3067\u3059\u3002
asadminRecorder.configuration.filterCommands=\u30B3\u30DE\u30F3\u30C9\u306E\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0
asadminRecorder.configuration.filterCommandsHelp=\u30D5\u30A1\u30A4\u30EB\u306B\u51FA\u529B\u3057\u305F\u304F\u306A\u3044asadmin\u30B3\u30DE\u30F3\u30C9\u3092\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3059\u308B\u304B\u3069\u3046\u304B\u3002
asadminRecorder.configuration.outputLocation=\u51FA\u529B\u5834\u6240
asadminRecorder.configuration.outputLocationHelp=\u8A18\u9332\u3057\u305Fasadmin\u30B3\u30DE\u30F3\u30C9\u3092\u51FA\u529B\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u7D76\u5BFE\u30D1\u30B9\u3002
asadminRecorder.configuration.filteredCommands=\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3059\u308B\u30B3\u30DE\u30F3\u30C9
asadminRecorder.configuration.filteredCommandsHelp=\u30D5\u30A1\u30A4\u30EB\u306B\u51FA\u529B\u3057\u306A\u3044asadmin\u30B3\u30DE\u30F3\u30C9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u6B63\u898F\u8868\u73FE\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
asadminRecorder.configuration.prependEnabled=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u524D\u7F6E
asadminRecorder.configuration.prependEnabledHelp=\u30AD\u30E3\u30D7\u30C1\u30E3\u3057\u305Fasadmin\u30B3\u30DE\u30F3\u30C9\u306E\u524D\u306B "host" \u3084 "user" \u7B49\u306Easadmin\u30E6\u30FC\u30C6\u30A3\u30EA\u30C6\u30A3\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u524D\u7F6E\u3059\u308B\u304B\u3069\u3046\u304B\u3002
asadminRecorder.configuration.prependedOptions=\u524D\u7F6E\u30AA\u30D7\u30B7\u30E7\u30F3
asadminRecorder.configuration.prependedOptionsHelp=\u30AD\u30E3\u30D7\u30C1\u30E3\u3057\u305F\u30B3\u30DE\u30F3\u30C9\u306E\u524D\u306B\u4ED8\u52A0\u3059\u308Basadmin\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002"host=example.com,port=4848" \u5F62\u5F0F\u3002
asadminRecorder.asadminRecorderTabs=Asadmin\u30EC\u30B3\u30FC\u30C0\u30FC

notification.serverTabs=\u901A\u77E5
notification.serverTabs.titleHelp=<a href="#{request.contextPath}/payaraExtras/notification/notification.jsf?configName=#{pageSession.configName}">\u901A\u77E5\u69CB\u6210</a>\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u300C\u6709\u52B9\u300D\u30C1\u30A7\u30C3\u30AF\u30DC\u30C3\u30AF\u30B9\u3092\u9078\u629E\u3057\u3066\u901A\u77E5\u3092\u6709\u52B9\u5316\u3057\u307E\u3059\u3002\u5B9F\u884C\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u9069\u7528\u3059\u308B\u306B\u306F\u300C\u52D5\u7684\u300D\u30C1\u30A7\u30C3\u30AF\u30DC\u30C3\u30AF\u30B9\u3092\u9078\u629E\u3057\u307E\u3059\u3002\u8A73\u7D30\u306F<a href="https://docs.payara.fish/" target="help_window" title="Online help in a new tab or window">\u30AA\u30F3\u30E9\u30A4\u30F3\u30D8\u30EB\u30D7</a>\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
button.notificationLogViewer=   \u901A\u77E5\u30ED\u30B0\u306E\u8868\u793A

notification.configurationTitle=\u901A\u77E5\u69CB\u6210
notification.configurationTitleHelp=\u901A\u77E5\u30B5\u30FC\u30D3\u30B9\u306E\u6709\u52B9\u5316\u3068\u8A2D\u5B9A\u5024\u306E\u69CB\u6210\u3092\u884C\u3044\u307E\u3059\u3002
notification.configuration.enabled=\u901A\u77E5\u30B5\u30FC\u30D3\u30B9\u6709\u52B9
notification.configuration.enabledHelp=\u901A\u77E5\u30B5\u30FC\u30D3\u30B9\u3092\u6709\u52B9\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
notification.configuration.dynamic=\u52D5\u7684
notification.configuration.dynamicHelp=\u5FC5\u8981\u306B\u5FDC\u3058\u3066Payara\u306E\u901A\u77E5\u30B5\u30FC\u30D3\u30B9\u3092\u958B\u59CB\u304A\u3088\u3073\u505C\u6B62\u3057\u307E\u3059\u3002
notification.configuration.logNotifierEnabled=\u30ED\u30B0\u30FB\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u6709\u52B9\u5316
notification.configuration.logNotifierEnabledHelp=\u30ED\u30B0\u30FB\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u3092\u6709\u52B9\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
notification.configuration.logNotifierNoisy=\u30ED\u30B0\u30FB\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC (Noisy)
notification.configuration.logNotifierNoisyHelp=\u30D8\u30EB\u30B9\u30C1\u30A7\u30C3\u30AF\u306E\u95BE\u5024\u304Cfine\u3067\u3082\u30ED\u30B0\u30FB\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u3092\u6709\u52B9\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
notification.configuration.useSeparateLogFile=\u5225\u306E\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u3092\u4F7F\u7528
notification.configuration.useSeparateLogFileHelp=\u901A\u77E5\u306E\u8A18\u9332\u306B\u5225\u306E\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u3092\u4F7F\u7528\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002<a href="#{request.contextPath}/common/configuration/loggerGeneral.jsf?configName=#{pageSession.configName}">Payara \u901A\u77E5\u30ED\u30AC\u30FC\u8A2D\u5B9A</a>\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066Payara\u901A\u77E5\u30B5\u30FC\u30D3\u30B9\u306E\u30ED\u30AE\u30F3\u30B0\u8A2D\u5B9A\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002
tree.notification=\u901A\u77E5

notification.configuration.notifier.enabled=\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u6709\u52B9
notification.configuration.notifier.enabledHelp=\u901A\u77E5\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
notification.configuration.notifier.dynamic=\u52D5\u7684\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC
notification.configuration.notifier.dynamicHelp=\u5FC5\u8981\u306B\u5FDC\u3058\u3066Payara\u306E\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u3092\u958B\u59CB\u307E\u305F\u306F\u505C\u6B62\u3057\u307E\u3059\u3002
notification.configuration.notifier.noisyLabel=Noisy
notification.configuration.notifier.noisyLabelHelpText=\u95BE\u5024\u306E\u30C1\u30A7\u30C3\u30AF\u3092\u884C\u308F\u305A\u3001\u5E38\u306B\u3059\u3079\u3066\u901A\u77E5\u5BFE\u8C61\u306B\u3057\u307E\u3059\u3002
notification.configuration.notifier.name=\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u540D
notification.configuration.notifier.nameHelp=\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u540D\u79F0\u3067\u3059\u3002


requestTracing.configurationTitle=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0\u69CB\u6210
requestTracing.configurationTitleHelp=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u6709\u52B9\u5316\u3068\u8A2D\u5B9A\u5024\u306E\u69CB\u6210\u3092\u884C\u3044\u307E\u3059\u3002
requestTracing.configuration.enabled=\u6709\u52B9
requestTracing.configuration.enabledHelp=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u6709\u52B9\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
requestTracing.configuration.dynamic=\u52D5\u7684
requestTracing.configuration.dynamicHelp=\u5FC5\u8981\u306B\u5FDC\u3058\u3066Payara\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0\u3092\u958B\u59CB\u307E\u305F\u306F\u505C\u6B62\u3057\u307E\u3059\u3002

requestTracing.configuration.requestTracingSamplingSection=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3
requestTracing.configuration.sampleRate=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30EC\u30FC\u30C8
requestTracing.configuration.sampleRateHelp=\u53D7\u4FE1\u3057\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u30C8\u30EC\u30FC\u30B9\u7387\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F 1 \u3067\u3001\u5168\u30EA\u30AF\u30A8\u30B9\u30C8\u306E 100% \u3092\u30C8\u30EC\u30FC\u30B9\u3059\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
requestTracing.configuration.adaptiveSamplingEnabled=\u9069\u5408\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0
requestTracing.configuration.adaptiveSamplingEnabledHelp=\u6709\u52B9\u306E\u5834\u5408\u3001\u6307\u5B9A\u3055\u308C\u305F\u6642\u9593\u5185\u306B\u6307\u5B9A\u3055\u308C\u305F\u6570\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3067\u304D\u308B\u3088\u3046\u306B\u3001\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30EC\u30FC\u30C8\u3092\u52D5\u7684\u306B\u5909\u5316\u3055\u305B\u307E\u3059\u3002
requestTracing.configuration.adaptiveSamplingTargetCount=\u30BF\u30FC\u30B2\u30C3\u30C8\u6570
requestTracing.configuration.adaptiveSamplingTargetCountHelp=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3059\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u5BFE\u8C61\u6570\u3002\u9069\u5408\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3092\u6709\u52B9\u5316\u3057\u305F\u5834\u5408\u306F\u5FC5\u9808\u3067\u3059\u3002
requestTracing.configuration.adaptiveSamplingTimeValue=\u6642\u9593(\u5024)
requestTracing.configuration.adaptiveSamplingTimeValueHelp=\u30BF\u30FC\u30B2\u30C3\u30C8\u6570\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53CE\u96C6\u3059\u308B\u6642\u9593\u91CF\u3002\u9069\u5408\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3092\u6709\u52B9\u5316\u3057\u305F\u5834\u5408\u306F\u5FC5\u9808\u3067\u3059\u3002
requestTracing.configuration.adaptiveSamplingTimeUnit=\u6642\u9593(\u5358\u4F4D)
requestTracing.configuration.adaptiveSamplingTimeUnitHelp=\u30BF\u30FC\u30B2\u30C3\u30C8\u6642\u9593\u306E\u5358\u4F4D\u3002\u9069\u5408\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3092\u6709\u52B9\u5316\u3057\u305F\u5834\u5408\u306F\u5FC5\u9808\u3067\u3059\u3002

requestTracing.configuration.requestTracingFiltersSection=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30D5\u30A3\u30EB\u30BF\u30FC
requestTracing.configuration.applicationsOnlyEnabled=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u307F
requestTracing.configuration.applicationsOnlyEnabledHelp=\u6709\u52B9\u306E\u5834\u5408\u3001\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u5BFE\u3059\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u307F\u3092\u30C8\u30EC\u30FC\u30B9\u3057\u307E\u3059\u3002
requestTracing.configuration.thresholdUnit=\u95BE\u5024(\u5358\u4F4D)
requestTracing.configuration.thresholdUnitHelp=\u95BE\u5024\u306E\u5358\u4F4D\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
requestTracing.configuration.thresholdValue=\u95BE\u5024(\u5024)
requestTracing.configuration.thresholdValueHelp=\u95BE\u5024\u306E\u6642\u9593\u91CF\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u51E6\u7406\u6642\u9593\u304C\u95BE\u5024\u4EE5\u4E0B\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002\u306A\u304A\u3001\u3053\u308C\u306F\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u5B9F\u65BD\u5F8C\u306B\u9069\u7528\u3055\u308C\u308B\u305F\u3081\u3001\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u5B9F\u65BD\u306E\u60F3\u5B9A\u306B\u5F71\u97FF\u3092\u53CA\u307C\u3059\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
requestTracing.configuration.sampleRateFirstEnabled=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30EC\u30FC\u30C8\u512A\u5148
requestTracing.configuration.sampleRateFirstEnabledHelp=\u6709\u52B9\u306E\u5834\u5408\u3001\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30EC\u30FC\u30C8\u3092\u512A\u5148\u3057\u307E\u3059\u3002\u7121\u52B9\u306E\u5834\u5408\u3001\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u30FB\u30EC\u30FC\u30C8\u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u95BE\u5024\u30C1\u30A7\u30C3\u30AF\u5F8C\u306B\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u7121\u52B9\u5316\u3059\u308B\u3068\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u60AA\u5F71\u97FF\u3092\u53CA\u307C\u3059\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002

requestTracing.configuration.traceStoreConfigSection=\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2
requestTracing.configuration.traceStoreSizeLabel=\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u30FB\u30B5\u30A4\u30BA
requestTracing.configuration.traceStoreSizeLabelHelpText=\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u306B\u4FDD\u6301\u3059\u308B\u6700\u5927\u30C8\u30EC\u30FC\u30B9\u6570\u3002
requestTracing.configuration.traceStoreTimeoutLabel=\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
requestTracing.configuration.traceStoreTimeoutLabelHelpText=\u30C8\u30EC\u30FC\u30B9\u3092\u524A\u9664\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024 (\u4F8B: 2d 3h 5m 20s)\u3002\u84C4\u7A4D\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u304C\u6709\u52B9\u306E\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
requestTracing.configuration.reservoirSamplingEnabled=\u84C4\u7A4D\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0
requestTracing.configuration.reservoirSamplingEnabledHelp=\u7121\u52B9\u306E\u5834\u5408\u3001\u30D2\u30B9\u30C8\u30EA\u30AB\u30EB\u30FB\u30B9\u30C8\u30A2\u306F\u6700\u3082\u9577\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u4FDD\u6301\u3057\u307E\u3059\u3002\u6709\u52B9\u306E\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u308B\u5EA6\u306B\u30D2\u30B9\u30C8\u30EA\u30AB\u30EB\u30FB\u30B9\u30C8\u30A2\u306B\u84C4\u7A4D\u3055\u308C\u307E\u3059\u3002

requestTracing.configuration.historicTraceStoreConfigSection=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3
requestTracing.configuration.historicTraceStoreEnabledLabel=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306E\u4FDD\u6301
requestTracing.configuration.historicTraceStoreEnabledLabelHelpText=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B9\u306E\u30E1\u30E2\u30EA\u3078\u306E\u4FDD\u6301\u3092\u6709\u52B9\u5316\u307E\u305F\u306F\u7121\u52B9\u5316\u3057\u307E\u3059\u3002
requestTracing.configuration.historicTraceStoreSizeLabel=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u30FB\u30B5\u30A4\u30BA
requestTracing.configuration.historicTraceStoreSizeLabelHelpText=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u306B\u4FDD\u6301\u3059\u308B\u6700\u5927\u30C8\u30EC\u30FC\u30B9\u6570\u3002
requestTracing.configuration.historicTraceStoreTimeoutLabel=\u30D2\u30B9\u30C8\u30EA\u30AB\u30EB\u30FB\u30C8\u30EC\u30FC\u30B9\u30FB\u30B9\u30C8\u30A2\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
requestTracing.configuration.historicTraceStoreTimeoutLabelHelpText=\u30D2\u30B9\u30C8\u30EA\u30AB\u30EB\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u524A\u9664\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u5024 (\u4F8B: 2d 3h 5m 20s)\u3002\u84C4\u7A4D\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u304C\u6709\u52B9\u306E\u5834\u5408\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
tree.requestTracing=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0

requestTracing.configuration.availableNotifiers=\u5229\u7528\u53EF\u80FD\u306A\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC
requestTracing.configuration.selectedNotifiers=\u9078\u629E\u3055\u308C\u305F\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC

requestTracing.traceStore.table.name=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B7\u30F3\u30B0
requestTracing.traceStore.table.empty=\u30D2\u30B9\u30C8\u30EA\u30C3\u30AF\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30C8\u30EC\u30FC\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
requestTracing.traceStore.table.headings.elapsedTime=\u7D4C\u904E\u6642\u9593
requestTracing.traceStore.table.headings.message=\u30E1\u30C3\u30BB\u30FC\u30B8
requestTracing.link.to.notification.page.text.prefix=\u9078\u629E\u3055\u308C\u305F\u30CE\u30FC\u30C6\u30A3\u30D5\u30A1\u30A4\u30E4\u30FC\u306F\u3001\u901A\u77E5\u3092\u53D7\u3051\u53D6\u308C\u308B\u3088\u3046\u306B
requestTracing.link.to.notification.page.text=\u901A\u77E5\u30B5\u30FC\u30D3\u30B9
requestTracing.link.to.notification.page.text.suffix=\u3067\u6709\u52B9\u5316\u3057\u3066\u304A\u304F\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002