# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2016-2018 Payara Foundation and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://github.com/payara/Payara/blob/master/LICENSE.txt
# See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at glassfish/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# The Payara Foundation designates this particular file as subject to the "Classpath"
# exception as provided by the Payara Foundation in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
hazelcast.configurationTitle=\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210
hazelcast.configurationTitleHelp=Payara\u306E\u57CB\u3081\u8FBC\u307F\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u304A\u3088\u3073\u69CB\u6210\u3057\u307E\u3059\u3002<br/>\
<br/>\u300C<a href="/cluster/availability/availabilityService.jsf?configName=#{configName}">\u53EF\u7528\u6027\u30B5\u30FC\u30D3\u30B9</a>\u300D\u3067Hazelcast\u3092Web\u304A\u3088\u3073EJB\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u6C38\u7D9A\u6027\u30BF\u30A4\u30D7\u3068\u3057\u3066\u4F7F\u7528\u3059\u308B\u306B\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 \
<br/>\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067<a href='https://jcp.org/en/jsr/detail?id=107'>JCache (JSR 107)</a>\u306E\u6A5F\u80FD\u3068API\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.local.configurationTitle=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u306E\u8A73\u7D30\u8A2D\u5B9A
hazelcast.local.configurationTitleHelp=\u3053\u3053\u3067\u306F\u3053\u306E\u69CB\u6210\u3092\u4F7F\u7528\u3059\u308B\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u8A73\u7D30\u8A2D\u5B9A\u3092\u9069\u7528\u3057\u307E\u3059\u3002\
\u3053\u308C\u3089\u306E\u69CB\u6210\u30AA\u30D7\u30B7\u30E7\u30F3\u3068\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u3092\u7D44\u307F\u5408\u308F\u305B\u308B\u3053\u3068\u3067\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u3069\u306E\u3088\u3046\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306B\u53C2\u52A0\u3059\u308B\u306E\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
hazelcast.configuration.enabled=\u6709\u52B9
hazelcast.configuration.enabledHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u8D77\u52D5\u6642\u306B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u958B\u59CB\u3057\u307E\u3059\u3002\u3053\u308C\u3068\u300C\u52D5\u7684\u300D\u30DC\u30C3\u30AF\u30B9\u306E\u4E21\u65B9\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u305F\u5834\u5408\u306B\u306F\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u76F4\u3061\u306B\u958B\u59CB\u3057\u307E\u3059\u3002<br>\
DAS\u3067\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306F\u5E38\u306B\u6709\u52B9\u3067\u3059\u3002
hazelcast.configuration.configFile=\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9
hazelcast.configuration.configFileHelp=\u3053\u306E\u30DA\u30FC\u30B8\u306E\u5168\u8A2D\u5B9A\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3059\u308B\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9 (\u30C9\u30E1\u30A4\u30F3\u306Econfig\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304B\u3089\u306E\u76F8\u5BFE\u30D1\u30B9) \u3002<br>\
\u3053\u306E\u9805\u76EE\u304C\u8A2D\u5B9A\u3055\u308C\u3001\u304B\u3064\u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u306B\u306F\u3001\u4EE5\u4E0B\u306E\u8A2D\u5B9A\u306F\u3059\u3079\u3066\u7121\u8996\u3055\u308C\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u306E\u5185\u5BB9\u304C\u9069\u7528\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.startPort=\u958B\u59CB\u30DD\u30FC\u30C8
hazelcast.configuration.startPortHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u30EA\u30B9\u30F3\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30DD\u30FC\u30C8\u3002\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u6709\u52B9\u306A\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u307E\u3067\u3053\u306E\u5024\u3092\u30A4\u30F3\u30AF\u30EA\u30E1\u30F3\u30C8\u3057\u307E\u3059\u3002
hazelcast.configuration.multicastPort=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30DD\u30FC\u30C8
hazelcast.configuration.multicastPortHelp=\u300Cmulticast\u300D\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u30B0\u30EB\u30FC\u30D7\u901A\u4FE1\u3067\u4F7F\u7528\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30DD\u30FC\u30C8
hazelcast.configuration.multicastGroup=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.multicastGroupHelp=\u300Cmulticast\u300D\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u901A\u4FE1\u3067\u4F7F\u7528\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.tcpipMembers=TCP/IP\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.tcpipMembersHelp=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9\u306B\u300Ctcpip\u300D\u304C\u6307\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u63A5\u7D9A\u5148\u3068\u306A\u308B\u4ED6\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.configuration.discoveryMode=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30FC\u30FB\u30E2\u30FC\u30C9
hazelcast.configuration.discoveryModeHelp=DAS\u304C\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u4ED6\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u63A2\u3059\u65B9\u6CD5
hazelcast.configuration.interfaces=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9
hazelcast.configuration.interfacesHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.configuration.dasPublicAddress=DAS\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasPublicAddressHelp=\u4ED6\u306E\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u304CDAS\u3078\u306E\u63A5\u7D9A\u306B\u4F7F\u7528\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3002\u7A7A\u767D\u306E\u5834\u5408\u306F\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
hazelcast.configuration.dasBindAddress=DAS\u30D0\u30A4\u30F3\u30C9\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasBindAddressHelp=DAS\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u306E\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.dasPort=DAS\u958B\u59CB\u30DD\u30FC\u30C8
hazelcast.configuration.dasPortHelp=DAS\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u30EA\u30B9\u30F3\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30DD\u30FC\u30C8\u3002\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u6709\u52B9\u306A\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u307E\u3067\u3053\u306E\u5024\u3092\u30A4\u30F3\u30AF\u30EA\u30E1\u30F3\u30C8\u3057\u307E\u3059\u3002
hazelcast.configuration.clusterName=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u540D
hazelcast.configuration.clusterNameHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B0\u30EB\u30FC\u30D7\u540D\u3002\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3092\u69CB\u6210\u3059\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u30B0\u30EB\u30FC\u30D7\u540D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u4E00\u81F4\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.clusterPassword=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9
hazelcast.configuration.clusterPasswordHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u306F\u3059\u3079\u3066\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u540C\u4E00\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.jndiName=Hazelcast\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9JNDI\u540D
hazelcast.configuration.jndiNameHelp=Hazelcast\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.licenseKey=\u30E9\u30A4\u30BB\u30F3\u30B9\u30FB\u30AD\u30FC
hazelcast.configuration.licenseKeyHelp=Hazelcast Enterprise\u306E\u30E9\u30A4\u30BB\u30F3\u30B9\u30FB\u30AD\u30FC
hazelcast.configuration=\u69CB\u6210
hazelcast.configurationTip=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210
hazelcast.membersTab=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.membersTabTip=View the Data Grid Instances
hazelcast.hazelcastTabs=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9
hazelcast.membersTitle=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.membersTitleHelp=\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u8868\u793A\u53EF\u80FD\u306A\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.domainMembersTitleHelp=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u8868\u793A\u53EF\u80FD\u306A\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EA\u30B9\u30C8
hazelcast.members.members=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.members.membersHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.dynamic=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u518D\u8D77\u52D5
hazelcast.configuration.dynamicHelp=\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u3092\u5FC5\u8981\u3068\u305B\u305A\u306B\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u69CB\u6210\u306E\u5909\u66F4\u3092\u76F4\u3061\u306B\u53CD\u6620\u3057\u307E\u3059\u3002<br/>\u8B66\u544A \u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u3067\u591A\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u76F4\u3061\u306B\u518D\u8D77\u52D5\u3059\u308B\u3068\u3001\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30C7\u30FC\u30BF\u304C\u5E83\u7BC4\u56F2\u306B\u5931\u308F\u308C\u308B\u539F\u56E0\u3068\u306A\u308A\u5F97\u307E\u3059\u3002
hazelcast.configuration.lite=Lite\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.configuration.liteHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092Lite\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3057\u307E\u3059\u3002\u5177\u4F53\u7684\u306B\u306F\u3001Lite\u30E1\u30F3\u30D0\u30FC\u306F\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306B\u306F\u53C2\u52A0\u3057\u307E\u3059\u304C\u81EA\u8EAB\u306E\u30D2\u30FC\u30D7\u306B\u30C7\u30FC\u30BF\u3092\u6301\u3061\u307E\u305B\u3093\u3002
hazelcast.configuration.hostaware =Host Aware Partitioning
hazelcast.configuration.hostawareHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u30C7\u30FC\u30BF\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306F\u540C\u3058IP\u30A2\u30C9\u30EC\u30B9\u3092\u6301\u3064\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u306F\u4FDD\u6301\u3055\u308C\u307E\u305B\u3093\u3002Payara Micro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u542B\u3080\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u5185\u306E\u3059\u3079\u3066\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067Host Aware Partitioning\u3092\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
hazelcast.configuration.memberGroup=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.memberGroupHelp=\u3053\u306E\u69CB\u6210\u3092\u4F7F\u7528\u3059\u308B\u3059\u3079\u3066\u306E\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30FB\u30B0\u30EB\u30FC\u30D7
hazelcast.configuration.publicAddress=\u3053\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30CE\u30FC\u30C9\u306E\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9
hazelcast.configuration.publicAddressHelp=\u3053\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30CE\u30FC\u30C9\u3067\u4F7F\u7528\u3059\u308B\u30D1\u30D6\u30EA\u30C3\u30AF\u30FB\u30A2\u30C9\u30EC\u30B9\u3002\u30CE\u30FC\u30C9\u304CNAT\u306E\u80CC\u5F8C\u306B\u3042\u308B\u5834\u5408\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.cacheManagerJndiName=JCache \u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3 JNDI\u540D
hazelcast.configuration.cacheManagerJndiNameHelp=JCache \u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3 \u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.cachingProviderJndiName=JCache \u30AD\u30E3\u30C3\u30B7\u30F3\u30B0\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0 JNDI\u540D
hazelcast.configuration.cachingProviderJndiNameHelp=JCache \u30AD\u30E3\u30C3\u30B7\u30F3\u30B0\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0 \u3092\u30D0\u30A4\u30F3\u30C9\u3059\u308BJNDI\u540D
hazelcast.configuration.executorPoolSize=\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.executorPoolSizeHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.scheduledExecutorPoolSize=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.scheduledExecutorPoolSizeHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA
hazelcast.configuration.executorQueueCapacity=\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3
hazelcast.configuration.scheduledExecutorQueueCapacity=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3
hazelcast.configuration.executorQueueCapacityHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u6709\u52B9\u306B\u306A\u308B\u307E\u3067\u5B9F\u884C\u304C\u30AD\u30E5\u30FC\u30A4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
hazelcast.configuration.scheduledExecutorQueueCapacityHelp=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u306E\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u6709\u52B9\u306B\u306A\u308B\u307E\u3067\u5B9F\u884C\u304C\u30AD\u30E5\u30FC\u30A4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002
hazelcast.allInstancesTableTitle=\u3059\u3079\u3066\u306E\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.allInstancesTable.instanceName=\u540D\u79F0
hazelcast.allInstancesTable.instanceType=\u30BF\u30A4\u30D7
hazelcast.allInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.allInstancesTable.hostName=\u30DB\u30B9\u30C8
hazelcast.allInstancesTable.httpPorts=HTTP \u30DD\u30FC\u30C8
hazelcast.allInstancesTable.httpsPorts=HTTPS \u30DD\u30FC\u30C8
hazelcast.allInstancesTable.adminPort=\u7BA1\u7406 \u30DD\u30FC\u30C8
hazelcast.allInstancesTable.hazelcastPort=Hazelcast \u30DD\u30FC\u30C8
hazelcast.allInstancesTable.liteMember=Lite \u30E1\u30F3\u30D0\u30FC
hazelcast.allInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.allInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.serverInstancesTableTitle=Payara Server\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.serverInstancesTable.instanceName=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D
hazelcast.serverInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.serverInstancesTable.hostName=\u30DB\u30B9\u30C8\u540D
hazelcast.serverInstancesTable.httpPorts=HTTP \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.httpsPorts=HTTPS \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.adminPort=\u7BA1\u7406 \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.hazelcastPort=Hazelcast \u30DD\u30FC\u30C8
hazelcast.serverInstancesTable.liteMember=Lite \u30E1\u30F3\u30D0\u30FC
hazelcast.serverInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.serverInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306BPayara Server\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.microInstancesTableTitle=Payara Micro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hazelcast.microInstancesTable.select=\u9078\u629E
hazelcast.microInstancesTable.instanceName=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D
hazelcast.microInstancesTable.instanceGroup=\u30B0\u30EB\u30FC\u30D7
hazelcast.microInstancesTable.hostName=\u30DB\u30B9\u30C8\u540D
hazelcast.microInstancesTable.httpPorts=HTTP \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.httpsPorts=HTTPS \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.adminPort=\u7BA1\u7406 \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.hazelcastPort=Hazelcast \u30DD\u30FC\u30C8
hazelcast.microInstancesTable.liteMember=Lite \u30E1\u30F3\u30D0\u30FC
hazelcast.microInstancesTable.applications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
hazelcast.microInstancesTable.emptyDataMsg=\u30AF\u30E9\u30B9\u30BF\u306BMicro\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
hazelcast.microInstancesTable.sendAdminCommand.label=\u30B3\u30DE\u30F3\u30C9:
hazelcast.microInstancesTable.sendAdminCommand.button=Asadmin\u30B3\u30DE\u30F3\u30C9\u9001\u4FE1
hazelcast.microInstancesTable.sendAdminCommand.confirm=Asadmin\u30B3\u30DE\u30F3\u30C9\u3092\u9001\u4FE1\u3057\u307E\u3059\u304B?
hazelcast.microInstancesTable.sendAdminCommand.error=\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
tree.hazelcast=\u30C7\u30FC\u30BF\u30FB\u30B0\u30EA\u30C3\u30C9

environmentWarning.environmentWarningTab=Environment Warning
environmentWarning.environmentWarningTabTip=Environment Warning Tab
environmentWarning.configurationTitle=Environment Warning
environmentWarning.configurationTitleHelp=Set a warning bar to appear at the top of the Admin Console to alert users of the server state, for example to alert the user that they may be making changes to a production environment.
environmentWarning.configuration.enabledHelp=Enable the environment warning bar.
environmentWarning.configuration.message=Warning Message
environmentWarning.configuration.messageHelp=Set the message to display in the bar.
environmentWarning.configuration.backgroundColour=Warning Background Colour
environmentWarning.configuration.backgroundColourHelp=Set the background colour of the warning bar. Accepts a hex colour. Default value: #D9534F.
environmentWarning.configuration.textColour=Warning Text Colour
environmentWarning.configuration.textColourHelp=Set the colour of the text in the warning bar. Accepts a hex colour. Default value: #FFFFFF.

payaraRestEndpoint.viewEndpointsLink=View Endpoints
payaraRestEndpoint.endpointTableTitle=REST Endpoints
payaraRestEndpoint.endpointPageTitle=REST Endpoints
payaraRestEndpoint.endpointPageTitleHelp=View a list of all REST endpoints belonging to a selected component
payaraRestEndpoint.endpointPath=Endpoint Path
payaraRestEndpoint.requestMethod=Request Method

cdiDevMode.toolLink=CDI Probe
cdiDevMode.toolPageTitle=CDI Development Tool
cdiDevMode.toolPageTitleHelp=Allows to inspect the application CDI components at runtime 

asadminRecorder.configuration=Configuration
asadminRecorder.configurationTip=Asadmin Recorder Configuration
asadminRecorder.configurationTitle=Asadmin Recorder Configuration
asadminRecorder.configurationTitleHelp=Configure the settings for the Asadmin Recorder Service.
asadminRecorder.configuration.enabled=Enabled
asadminRecorder.configuration.enabledHelp=The current status of the Asadmin Recorder Service.
asadminRecorder.configuration.filterCommands=Filter Commands
asadminRecorder.configuration.filterCommandsHelp=Whether to filter out unwanted asadmin commands so that they are not written to file.
asadminRecorder.configuration.outputLocation=Output Location
asadminRecorder.configuration.outputLocationHelp=The absolute file to write the recorded asadmin commands to.
asadminRecorder.configuration.filteredCommands=Filtered Commands
asadminRecorder.configuration.filteredCommandsHelp=A comma separated list of asadmin commands to not write to file. Accepts regular expressions.
asadminRecorder.configuration.prependEnabled=Prepend Options
asadminRecorder.configuration.prependEnabledHelp=Whether to prepend asadmin utility options such as "host" and "user" before captured asadmin commands.
asadminRecorder.configuration.prependedOptions=Prepended Options
asadminRecorder.configuration.prependedOptionsHelp=A comma separated list of asadmin options to prepend before captured commands, in the format "host=example.com,port=4848".
asadminRecorder.asadminRecorderTabs=Asadmin Recorder

notification.serverTabs=Notification
notification.serverTabs.titleHelp=Click <a href="#{request.contextPath}/payaraExtras/notification/notification.jsf?configName=#{pageSession.configName}">Configure Notification</a> and enable Notification by ticking the Enabled check-box. To turn on the service for a running server tick the Dynamic check-box. See the <a href="https://docs.payara.fish/" target="help_window" title="Online help in a new tab or window">Online Help</a> for more information.
button.notificationLogViewer=   View Notification Log

notification.configurationTitle=Notification Configuration
notification.configurationTitleHelp=Enable and configure the settings for the Notification Service.
notification.configuration.enabled=Notification Service Enabled
notification.configuration.enabledHelp=Determines whether the Notification Service is enabled.
notification.configuration.dynamic=Dynamic
notification.configuration.dynamicHelp=Starts or Stops the Notification Service in Payara if required.
notification.configuration.logNotifierEnabled=Log Notifier Enabled
notification.configuration.logNotifierEnabledHelp=Determines whether the Log Notifier is enabled.
notification.configuration.logNotifierNoisy=Log Notifier Noisy
notification.configuration.logNotifierNoisyHelp=Determines whether the Log Notifier is active even if HealthCheck's threshold is fine.
notification.configuration.useSeparateLogFile=Use Separate Log File
notification.configuration.useSeparateLogFileHelp=Determines whether to use separate log file for storing notifications. Click <a href="#{request.contextPath}/common/configuration/loggerGeneral.jsf?configName=#{pageSession.configName}">Payara Notification Logger Settings</a> to edit the logging settings for Payara Notification Service. 
tree.notification=Notification

notification.configuration.notifier.enabled=Notifier Enable
notification.configuration.notifier.enabledHelp=Enables or disables the Notification Notifier.
notification.configuration.notifier.dynamic=Notifier Dynamic
notification.configuration.notifier.dynamicHelp=Starts or Stops the Notifier in Payara if required.
notification.configuration.notifier.noisyLabel=Noisy
notification.configuration.notifier.noisyLabelHelpText=Does not check threshold, always apply notification
notification.configuration.notifier.name=Notifier Service Name
notification.configuration.notifier.nameHelp=Name of the Notifier Service


requestTracing.configurationTitle=Request Tracing Configuration
requestTracing.configurationTitleHelp=Enable and configure the settings for the Request Tracing Service.
requestTracing.configuration.enabled=Enabled
requestTracing.configuration.enabledHelp=Determines whether the Request Tracing Service is enabled.
requestTracing.configuration.dynamic=Dynamic
requestTracing.configuration.dynamicHelp=Starts or Stops the Request Tracing in Payara if required.

requestTracing.configuration.requestTracingSamplingSection=Sampling Options
requestTracing.configuration.sampleRate=Sample Rate
requestTracing.configuration.sampleRateHelp=Defines the probability of any given request being traced. Defaults to 1, meaning 100% of all requests will be traced.
requestTracing.configuration.adaptiveSamplingEnabled=Adaptive Sampling
requestTracing.configuration.adaptiveSamplingEnabledHelp=When enabled, the sample rate will change dynamically to attempt to match a specified number of sampled requests in a specified amount of time.
requestTracing.configuration.adaptiveSamplingTargetCount=Target Count
requestTracing.configuration.adaptiveSamplingTargetCountHelp=The target number of requests to sample. Requires adaptive sampling to be enabled.
requestTracing.configuration.adaptiveSamplingTimeValue=Time Value
requestTracing.configuration.adaptiveSamplingTimeValueHelp=The amount of time over which to collect the target number of requests. Requires adaptive sampling to be enabled.
requestTracing.configuration.adaptiveSamplingTimeUnit=Time Unit
requestTracing.configuration.adaptiveSamplingTimeUnitHelp=The unit of time for the target time value. Requires adaptive sampling to be enabled.

requestTracing.configuration.requestTracingFiltersSection=Request Filters
requestTracing.configuration.applicationsOnlyEnabled=Applications Only
requestTracing.configuration.applicationsOnlyEnabledHelp=When enabled, only requests for deployed applications will be traced.
requestTracing.configuration.thresholdUnit=Threshold Unit
requestTracing.configuration.thresholdUnitHelp=Defines a unit of time for the threshold value.
requestTracing.configuration.thresholdValue=Threshold Value
requestTracing.configuration.thresholdValueHelp=Defines amount of time. Requests that take less time than the threshold will be ignored. Note that this is applied after the sample chance, so may affect the perceived sample chance.
requestTracing.configuration.sampleRateFirstEnabled=Sample Rate First?
requestTracing.configuration.sampleRateFirstEnabledHelp=When enabled, the sample rate will be applied first. When disabled, the sample rate is applied after checking that a request passes the threshold value. Disabling this will negatively affect performance.

requestTracing.configuration.traceStoreConfigSection=Trace Store
requestTracing.configuration.traceStoreSizeLabel=Trace Store Size
requestTracing.configuration.traceStoreSizeLabelHelpText=The maximum number of traces to be stored in the trace store.
requestTracing.configuration.traceStoreTimeoutLabel=Trace Store Timeout
requestTracing.configuration.traceStoreTimeoutLabelHelpText=The timeout value for traces to be removed (e.g. 2d 3h 5m 20s). Ignored when Reservoir Sampling is enabled.
requestTracing.configuration.reservoirSamplingEnabled=Reservoir Sampling
requestTracing.configuration.reservoirSamplingEnabledHelp=When disabled, the historical store will contain the longest request traces. When enabled, the chance of any sampled request being in the historical store becomes constant.

requestTracing.configuration.historicTraceStoreConfigSection=Historic Tracing Options
requestTracing.configuration.historicTraceStoreEnabledLabel=Store Historic Traces?
requestTracing.configuration.historicTraceStoreEnabledLabelHelpText=Enables or disables the storing of request traces in memory.
requestTracing.configuration.historicTraceStoreSizeLabel=Historic Trace Store Size
requestTracing.configuration.historicTraceStoreSizeLabelHelpText=The maximum number of traces to be stored in the historic trace store.
requestTracing.configuration.historicTraceStoreTimeoutLabel=Historical Trace Store Timeout
requestTracing.configuration.historicTraceStoreTimeoutLabelHelpText=The timeout value for historical traces to be removed (e.g. 2d 3h 5m 20s). Ignored when Reservoir Sampling is enabled.
tree.requestTracing=Request Tracing

requestTracing.configuration.availableNotifiers=Available Notifiers
requestTracing.configuration.selectedNotifiers=Selected Notifiers

requestTracing.traceStore.table.name=Historic Request Tracing
requestTracing.traceStore.table.empty=No Historic Request Traces
requestTracing.traceStore.table.headings.elapsedTime=Elapsed Time
requestTracing.traceStore.table.headings.message=Message
requestTracing.link.to.notification.page.text.prefix=Selected Notifiers need to be enabled also in the
requestTracing.link.to.notification.page.text=Notification Service
requestTracing.link.to.notification.page.text.suffix=to receive notifications.