#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=El comando create-http-listener crea un listener HTTP.
create.http.listener.listeneraddress=Direcci\u00F3n IP o nombre de host (que se pueda resolver mediante DNS).
create.http.listener.listenerport=N\u00FAmero de puerto donde crear el socket de recepci\u00F3n. Los valores v\u00E1lidos se encuentran entre 1 y 65535. En UNIX, para crear sockets que reciban en los puertos 1-1024 se necesitan privilegios de superusuario. Se recomienda configurar un socket de recepci\u00F3n SSL para recibir en el puerto 443.
create.http.listener.defaultvs=Atributo de ID del servidor virtual por defecto de este listener.
create.http.listener.servername=Indica al servidor qu\u00E9 se debe colocar en la secci\u00F3n de nombres de host de las URL que se env\u00EDen al cliente. Este valor afecta a las URL que genera autom\u00E1ticamente el servidor; no afecta a las URL de los directorios y archivos almacenados en el servidor. Este nombre debe ser el nombre de alias si el servidor utiliza un alias. Si se agregan dos puntos y un n\u00FAmero de puerto, dicho puerto se utilizar\u00E1 en las URL que el servidor env\u00EDa al cliente.
create.http.listener.xpowered=Si se define en true, agrega las cabeceras X-Powered-By: Servlet/2.4 y X-Powered-By: JSP/2.0 a las respuestas adecuadas. La especificaci\u00F3n Servlet 2.4 define la cabecera X-Powered-By: Servlet/2.4, que los contenedores pueden agregar a respuestas generadas por el servlet. Asimismo, la especificaci\u00F3n JSP 2.0 define la cabecera X-Powered-By: JSP/2.0, que los contenedores pueden agregar a respuestas que usen la tecnolog\u00EDa JSP. El objetivo de estas cabeceras es ayudar a recopilar datos estad\u00EDsticos sobre el uso de la tecnolog\u00EDa JSP y Servlet.
create.http.listener.acceptorthreads=N\u00FAmero de threads del responsable de aceptaci\u00F3n para el socket de recepci\u00F3n. El valor recomendado es el n\u00FAmero de procesadores de la m\u00E1quina. El valor por defecto es 1.
create.http.listener.securityenabled=Si se define en true, el listener HTTP ejecuta SSL. Puede activar o desactivar SSL2 o SSL3 y definir cifrados mediante un elemento SSL. La opci\u00F3n de seguridad activa o desactiva SSL de forma global poniendo los certificados a disposici\u00F3n de la instancia del servidor. El valor por defecto es false.
create.http.listener.listener_id=ID de listener del listener HTTP.
create.http.listener.default-virtual-server=Atributo de ID del servidor virtual por defecto de este listener.

create.virtual.server=Con el comando create-virtual-server se crea el servidor virtual con nombre. La virtualizaci\u00F3n en el servidor de aplicaciones permite procesar varios dominios de URL mediante un \u00FAnico proceso de servidor HTTP que recibe en varias direcciones de host. Si la aplicaci\u00F3n est\u00E1 disponible en dos servidores virtuales, continuar\u00E1n compartiendo los mismos pools de recursos f\u00EDsicas.
create.virtual.server.hosts=Lista de valores separados por comas (,) permitidos en la cabecera de solicitud de host para seleccionar el servidor virtual actual. Cada uno de los servidores virtuales configurados en el mismo grupo de conexiones debe tener un host \u00FAnico para dicho grupo.
create.virtual.server.httplisteners=Lista de ID de listener HTTP separados por comas (,). Solamente es necesario para un servidor virtual que no sea el servidor virtual por defecto.
create.virtual.server.defaultwebmodule=M\u00F3dulo web independiente asociado a este servidor virtual por defecto.
create.virtual.server.state=Determina si un servidor virtual est\u00E1 activo (activado) o inactivo (desactivado). El valor por defecto es activo (activado). Cuando est\u00E1 inactivo, el servidor virtual no procesa solicitudes.
create.virtual.server.logfile=Nombre del archivo donde se van a escribir las entradas de log de este servidor virtual. Por defecto, se trata del log del servidor.
create.virtual.server.property=Pares de nombre y valor del atributo opcional para configurar el servidor virtual. 
create.virtual.server.virtual_server_id=Identifica el ID \u00FAnico del servidor virtual que se va a crear. Este ID no puede empezar por un n\u00FAmero.

delete.http.listener=El comando delete-http-listener elimina el listener de HTTP especificado.
delete.http.listener.listener_id=ID del listener de HTTP.
delete.http.listener.secure=Si se define en true, utiliza SSL/TLS para comunicarse con el servidor de administraci\u00F3n de dominio.

delete.virtual.server=El comando delete-virtual-server elimina el servidor virtual con el ID de servidor virtual especificado.
delete.virtual.server.virtual_server_id=Identificador \u00FAnico del servidor virtual que se va a suprimir.



list.http.listeners=El comando list-http-listeners enumera los listeners de HTTP existentes. 

list.virtual.servers=El comando list-virtual-servers enumera los servidores virtuales existentes.
