#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=La commande create-http-listener cr\u00E9e un processus d'\u00E9coute HTTP.
create.http.listener.listeneraddress=Adresse IP ou nom d'h\u00F4te (r\u00E9solution possible par DNS).
create.http.listener.listenerport=Num\u00E9ro de port sur lequel cr\u00E9er le socket d'\u00E9coute. Les valeurs autoris\u00E9es sont comprises entre 1 et 65535. Sous UNIX, vous devez disposer de privil\u00E8ges de superutilisateur pour pouvoir cr\u00E9er des sockets qui \u00E9coutent sur les ports 1 \u00E0 1024. La configuration d'un socket d'\u00E9coute SSL pour \u00E9couter le port 443 est recommand\u00E9e.
create.http.listener.defaultvs=Attribut de l'ID du serveur virtuel par d\u00E9faut de ce processus d'\u00E9coute.
create.http.listener.servername=Indique au serveur les \u00E9l\u00E9ments \u00E0 ajouter \u00E0 la section du nom d'h\u00F4te pour toutes les URL envoy\u00E9es au client. Cette valeur a une influence sur les URL que le serveur g\u00E9n\u00E8re automatiquement ; elle n'a aucun impact sur les URL des r\u00E9pertoires et des fichiers stock\u00E9s sur le serveur. Ce nom correspond au nom de l'alias si votre serveur en utilise un. Si vous ajoutez le signe deux-points et un num\u00E9ro de port \u00E0 la fin, ce port sera utilis\u00E9 dans les URL que le serveur envoie au client.
create.http.listener.xpowered=Si la valeur est True, permet d'ajouter les en-t\u00EAtes JSP/2.0 X-Powered-By: Servlet/2.4 et X-Powered-By: aux r\u00E9ponses correspondantes. La sp\u00E9cification Servlet 2.4 d\u00E9finit l'en-t\u00EAte X-Powered-By: Servlet/2.4 que les conteneurs peuvent ajouter aux r\u00E9ponses g\u00E9n\u00E9r\u00E9es par le servlet. De m\u00EAme, la sp\u00E9cification JSP 2.0 d\u00E9finit l'en-t\u00EAte X-Powered-By: JSP/2.0 que les conteneurs peuvent ajouter aux r\u00E9ponses utilisant la technologie JSP. Ces en-t\u00EAtes permettent de collecter des donn\u00E9es statistiques sur l'utilisation du servlet et de la technologie JSP.
create.http.listener.acceptorthreads=Nombre de threads d'acceptation du socket d'\u00E9coute. La valeur recommand\u00E9e correspond au nombre de processeurs de l'ordinateur. La valeur par d\u00E9faut est 1.
create.http.listener.securityenabled=Si le processus d'\u00E9coute HTTP a la valeur True, il est ex\u00E9cut\u00E9 sur un protocole SSL. Vous pouvez activer ou d\u00E9sactiver SSL2 ou SSL3, et d\u00E9finir un code de cryptage \u00E0 l'aide d'un \u00E9l\u00E9ment SSL. Le param\u00E8tre de s\u00E9curit\u00E9 permet d'activer ou de d\u00E9sactiver de mani\u00E8re globale le protocole SSL en mettant des certificats \u00E0 disposition de l'instance de serveur. La valeur par d\u00E9faut est False.
create.http.listener.listener_id=ID du processus d'\u00E9coute HTTP.
create.http.listener.default-virtual-server=Attribut de l'ID du serveur virtuel par d\u00E9faut de ce processus d'\u00E9coute.

create.virtual.server=La commande create-virtual-server permet de cr\u00E9er le serveur virtuel nomm\u00E9. La virtualisation du serveur d'applications permet \u00E0 plusieurs domaines d'URL d'utiliser un seul processus de serveur HTTP qui \u00E9coute plusieurs adresses d'h\u00F4te. Si l'application est disponible sur deux serveurs virtuels, cela indique qu'ils partagent toujours les m\u00EAmes pools de ressources physiques.
create.virtual.server.hosts=Liste de valeurs s\u00E9par\u00E9es par des virgules (,) autoris\u00E9es dans l'en-t\u00EAte de la demande de l'h\u00F4te permettant de s\u00E9lectionner le serveur virtuel en cours. Chaque serveur virtuel configur\u00E9 sur le m\u00EAme groupe de connexions doit disposer d'un h\u00F4te unique pour ce groupe.
create.virtual.server.httplisteners=Liste d'ID de processus d'\u00E9coute HTTP s\u00E9par\u00E9s par des virgules (,). Valeur requise uniquement pour un serveur virtuel autre que celui par d\u00E9faut.
create.virtual.server.defaultwebmodule=Module Web autonome associ\u00E9 par d\u00E9faut \u00E0 ce serveur virtuel.
create.virtual.server.state=D\u00E9termine si un serveur virtuel est actif (on) ou inactif (off ou disabled). Par d\u00E9faut, le serveur virtuel est actif (on). Lorsque le serveur virtuel est inactif, il n'est pas utilis\u00E9 pour les demandes.
create.virtual.server.logfile=Nom du fichier dans lequel les entr\u00E9es de journal de ce serveur virtuel doivent \u00EAtre \u00E9crites. Par d\u00E9faut, il s'agit du journal du serveur.
create.virtual.server.property=Paires nom/valeur d'attribut facultatives pour configurer le serveur virtuel. 
create.virtual.server.virtual_server_id=Identifie l'ID unique du serveur virtuel \u00E0 cr\u00E9er. L'ID ne peut pas commencer par un chiffre.

delete.http.listener=La commande delete-http-listener permet d'enlever le processus d'\u00E9coute HTTP sp\u00E9cifi\u00E9.
delete.http.listener.listener_id=ID du processus d'\u00E9coute HTTP.
delete.http.listener.secure=Si la valeur est True, utilisation du protocole SSL/TLS pour communiquer avec le serveur d'administration de domaine.

delete.virtual.server=La commande delete-virtual-server permet d'enlever le serveur virtuel avec l'ID de serveur virtuel sp\u00E9cifi\u00E9.
delete.virtual.server.virtual_server_id=Identificateur unique du serveur virtuel \u00E0 supprimer.



list.http.listeners=La commande list-http-listeners r\u00E9pertorie les processus d'\u00E9coute HTTP existants. 

list.virtual.servers=La commande list-virtual-servers r\u00E9pertorie les serveurs virtuels existants.
