#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=Der Befehl "create-http-listener" erstellt einen HTTP-Listener.
create.http.listener.listeneraddress=Die IP-Adresse oder der Hostname (von DNS aufl\u00F6sbar).
create.http.listener.listenerport=Die Nummer des Ports, auf dem das Listener Socket erstellt werden soll. G\u00FCltige Werte sind 1 - 65535. Bei UNIX erfordert das Erstellen von Sockets, die die Ports 1 - 1024 \u00FCberwachen, Superuser-Rechte. Es wird empfohlen, ein SSL-Listener-Socket zum \u00DCberwachen von Port 443 zu konfigurieren.
create.http.listener.defaultvs=Das ID-Attribut des Standard-Virtual Server f\u00FCr diesen Listener.
create.http.listener.servername=Teilt dem Server mit, was in den Hostnamenabschnitt der URLs, die er an den Client sendet, abgelegt wird. Dies wirkt sich auf URLs aus, die vom Server automatisch generiert werden; URLs f\u00FCr Verzeichnisse und im Server gespeicherte Dateien sind davon nicht betroffen. Dieser Name sollte der Aliasname sein, falls Ihr Server einen Alias verwendet. Werden ein Doppelpunkt und eine Portnummer angeh\u00E4ngt, wird dieser Port in URLs verwendet, die vom Server an den Client gesendet werden.
create.http.listener.xpowered=Wenn der Wert auf "True" gesetzt ist, werden den entsprechenden Antworten X-Powered-By: Servlet/2.4- und der X-Powered-By: JSP/2.06-Header hinzugef\u00FCgt. Die Servlet 2.4-Spezifikation definiert den X-Powered-By: Servlet/2.4-Header, den Container in Servlet-erzeugte Antworten einf\u00FCgen k\u00F6nnen. Auf \u00E4hnliche Weise definiert die JSP 2.0-Spezifikation den X-Powered-By: JSP/2.0-Header, den Container zu Antworten hinzuf\u00FCgen k\u00F6nnen, die die JSP-Technologie nutzen. Ziel dieser Header ist die Unterst\u00FCtzung bei der Sammlung statistischer Daten zur Verwendung der Servlet- und JSP-Technologie.
create.http.listener.acceptorthreads=Die Anzahl der Acceptor-Threads f\u00FCr das Listener Socket. Der empfohlene Wert entspricht der Anzahl der Prozessoren im Rechner. Der Standardwert betr\u00E4gt 1. 
create.http.listener.securityenabled=Wenn der Wert auf "True" gesetzt ist, f\u00FChrt der HTTP-Listener SSL aus. Sie k\u00F6nnen SSL2 oder SSL3 aktivieren bzw. deaktivieren und anhand eines SSL-Elements Verschl\u00FCsselungen festlegen. Die Sicherheitseinstellungen aktivieren oder deaktivieren SSL global, indem der Serverinstanz Zertifikate zur Verf\u00FCgung gestellt werden. Der Standardwert lautet "False".
create.http.listener.listener_id=Die Listener-ID des HTTP-Listeners.
create.http.listener.default-virtual-server=Das ID-Attribut des Standard-Virtual Server f\u00FCr diesen Listener.

create.virtual.server=Der Befehl "create-virtual-server" erstellt den benannten virtuellen Server. Die Visualisierung im Application Server erm\u00F6glicht die Bearbeitung mehrerer URL-Domains durch einen einzigen HTTP-Servervorgang, der mehrere Hostadressen \u00FCberwacht. Wenn die Anwendung auf zwei virtuellen Servern verf\u00FCgbar ist, weisen diese nach wie vor dieselben physischen Ressourcenpools auf. 
create.virtual.server.hosts=Eine durch Komma (,) getrennte Liste der im Anforderungsheader des Hosts zul\u00E4ssigen Werte zum Ausw\u00E4hlen des aktuellen virtuellen Servers. Jeder virtuelle Server, der f\u00FCr dieselbe Verbindungsgruppe konfiguriert ist, muss \u00FCber einen eindeutigen Host f\u00FCr diese Gruppe verf\u00FCgen.
create.virtual.server.httplisteners=Eine durch Komma (,) getrennte Liste der HTTP-Listener-IDs. Nur f\u00FCr virtuelle Server erforderlich, bei denen es sich nicht um den Standard-Virtual Server handelt.
create.virtual.server.defaultwebmodule=Das standardm\u00E4\u00DFig mit diesem virtuellen Server verbundene Standalone-Webmodul.
create.virtual.server.state=Legt fest, ob ein virtueller Server aktiv ("Ein") oder inaktiv ("Aus" bzw. deaktiviert) ist. Die Standardeinstellung lautet aktiv ("Ein"). Wenn der virtuelle Server inaktiv ist, bearbeitet er keine Anforderungen.
create.virtual.server.logfile=Name der Datei, in die Protokolleintr\u00E4ge f\u00FCr diesen virtuellen Server geschrieben werden sollen. Standardm\u00E4\u00DFig handelt es sich hierbei um das Serverlog.
create.virtual.server.property=Optionale Name/Wert-Paare f\u00FCr Attribute zur Konfiguration des virtuellen Servers. 
create.virtual.server.virtual_server_id=Gibt die eindeutige ID f\u00FCr den zu erstellenden virtueller Server an. Diese ID darf nicht mit einer Zahl beginnen.

delete.http.listener=Der Befehl "delete-http-listener" entfernt den angegebenen HTTP-Listener.
delete.http.listener.listener_id=Die Listener-ID des HTTP-Listeners.
delete.http.listener.secure=Wenn der Wert auf "True" gesetzt ist, wird SSL/TLS zur Kommunikation mit dem Domainadministrationsserver verwendet.

delete.virtual.server=Der Befehl "delete-virtual-server" entfernt den virtuellen Server mit der angegebenen ID.
delete.virtual.server.virtual_server_id=Die eindeutige ID f\u00FCr den zu l\u00F6schenden virtuellen Server.



list.http.listeners=Der Befehl "list-http-listeners" listet die bestehenden HTTP-Listener auf. 

list.virtual.servers=Der Befehl "list-virtual-servers" listet die bestehenden virtuellen Server auf.
