#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=create-http-listener \uBA85\uB839\uC740 HTTP \uB9AC\uC2A4\uB108\uB97C \uC0DD\uC131\uD569\uB2C8\uB2E4.
create.http.listener.listeneraddress=IP \uC8FC\uC18C \uB610\uB294 DNS\uC5D0\uC11C \uD655\uC778 \uAC00\uB2A5\uD55C \uD638\uC2A4\uD2B8 \uC774\uB984\uC785\uB2C8\uB2E4.
create.http.listener.listenerport=\uC218\uC2E0 \uC18C\uCF13\uC744 \uC0DD\uC131\uD560 \uD3EC\uD2B8 \uBC88\uD638\uC785\uB2C8\uB2E4. \uC801\uD569\uD55C \uAC12\uC740 1-65535\uC785\uB2C8\uB2E4. UNIX\uC758 \uACBD\uC6B0 1-1024 \uD3EC\uD2B8\uC5D0\uC11C \uC218\uC2E0\uD558\uB294 \uC18C\uCF13\uC744 \uC0DD\uC131\uD558\uB824\uBA74 \uC218\uD37C\uC720\uC800 \uAD8C\uD55C\uC774 \uD544\uC694\uD569\uB2C8\uB2E4. \uD3EC\uD2B8 443\uC5D0\uC11C \uC218\uC2E0\uD558\uB294 SSL \uC218\uC2E0 \uC18C\uCF13\uC744 \uAD6C\uC131\uD558\uB294 \uAC83\uC774 \uC88B\uC2B5\uB2C8\uB2E4.
create.http.listener.defaultvs=\uC774 \uB9AC\uC2A4\uB108\uC5D0 \uB300\uD55C \uAE30\uBCF8 \uAC00\uC0C1 \uC11C\uBC84\uC758 ID \uC18D\uC131\uC785\uB2C8\uB2E4.
create.http.listener.servername=\uC11C\uBC84\uC5D0 \uC11C\uBC84\uAC00 \uD074\uB77C\uC774\uC5B8\uD2B8\uC5D0 \uBCF4\uB0B4\uB294 URL\uC758 \uD638\uC2A4\uD2B8 \uC774\uB984 \uC139\uC158\uC5D0 \uB458 \uB0B4\uC6A9\uC744 \uC54C\uB9BD\uB2C8\uB2E4. \uC774 \uC18D\uC131\uC740 \uC11C\uBC84\uC5D0\uC11C \uC790\uB3D9\uC73C\uB85C \uC0DD\uC131\uD558\uB294 URL\uC5D0 \uC601\uD5A5\uC744 \uC8FC\uC9C0\uB9CC \uC11C\uBC84\uC5D0 \uC800\uC7A5\uB41C \uB514\uB809\uD1A0\uB9AC \uBC0F \uD30C\uC77C\uC758 URL\uC5D0\uB294 \uC601\uD5A5\uC744 \uC8FC\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uC11C\uBC84\uAC00 \uBCC4\uCE6D\uC744 \uC0AC\uC6A9\uD558\uB294 \uACBD\uC6B0 \uC774 \uC774\uB984\uC740 \uBCC4\uCE6D \uC774\uB984\uC774\uC5B4\uC57C \uD569\uB2C8\uB2E4. \uCF5C\uB860 \uBC0F \uD3EC\uD2B8 \uBC88\uD638\uB97C \uCD94\uAC00\uD558\uB294 \uACBD\uC6B0 \uC11C\uBC84\uC5D0\uC11C \uD074\uB77C\uC774\uC5B8\uD2B8\uC5D0 \uBCF4\uB0B4\uB294 URL\uC5D0 \uD574\uB2F9 \uD3EC\uD2B8\uAC00 \uC0AC\uC6A9\uB429\uB2C8\uB2E4.
create.http.listener.xpowered=true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 X-Powered-By: Servlet/2.4 \uBC0F X-Powered-By: JSP/2.0 \uD5E4\uB354\uB97C \uC801\uC808\uD55C \uC751\uB2F5\uC5D0 \uCD94\uAC00\uD569\uB2C8\uB2E4. Servlet 2.4 \uC0AC\uC591\uC740 X-Powered-By: Servlet/2.4 \uD5E4\uB354\uB97C \uC815\uC758\uD558\uACE0 \uC774 \uCEE8\uD14C\uC774\uB108\uB294 \uC11C\uBE14\uB9BF\uC5D0\uC11C \uC0DD\uC131\uD55C \uC751\uB2F5\uC5D0 \uCD94\uAC00\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uB9C8\uCC2C\uAC00\uC9C0\uB85C, JSP 2.0 \uC0AC\uC591\uC740 X-Powered-By: JSP/2.0 \uD5E4\uB354\uB97C \uC815\uC758\uD558\uACE0 \uC774 \uCEE8\uD14C\uC774\uB108\uB294 JSP \uAE30\uC220\uC744 \uC0AC\uC6A9\uD558\uB294 \uC751\uB2F5\uC5D0 \uCD94\uAC00\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC774\uB7EC\uD55C \uD5E4\uB354\uC758 \uBAA9\uC801\uC740 \uC11C\uBE14\uB9BF \uBC0F JSP \uAE30\uC220 \uC0AC\uC6A9\uC5D0 \uB300\uD55C \uD1B5\uACC4 \uB370\uC774\uD130\uC758 \uC218\uC9D1\uC5D0 \uB3C4\uC6C0\uC744 \uC8FC\uAE30 \uC704\uD55C \uAC83\uC785\uB2C8\uB2E4.
create.http.listener.acceptorthreads=\uC218\uC2E0 \uC18C\uCF13\uC758 \uC218\uB77D\uC790 \uC2A4\uB808\uB4DC \uC218\uC785\uB2C8\uB2E4. \uAD8C\uC7A5 \uAC12\uC740 \uC2DC\uC2A4\uD15C\uC758 \uD504\uB85C\uC138\uC11C \uC218\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 1\uC785\uB2C8\uB2E4.
create.http.listener.securityenabled=true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 HTTP \uB9AC\uC2A4\uB108\uAC00 SSL\uC744 \uC2E4\uD589\uD569\uB2C8\uB2E4. SSL2 \uB610\uB294 SSL3\uC744 \uC124\uC815 \uB610\uB294 \uD574\uC81C\uB85C \uC124\uC815\uD558\uACE0 SSL \uC694\uC18C\uB97C \uC0AC\uC6A9\uD558\uC5EC \uBE44\uBC00\uBC88\uD638\uB97C \uC124\uC815\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uBCF4\uC548 \uC124\uC815\uC740 \uC11C\uBC84 \uC778\uC2A4\uD134\uC2A4\uC5D0 \uC778\uC99D\uC11C\uB97C \uC0AC\uC6A9\uD560 \uC218 \uC788\uB3C4\uB85D \uD558\uC5EC \uC804\uC5ED\uC801\uC73C\uB85C SSL\uC744 \uC0AC\uC6A9 \uB610\uB294 \uC0AC\uC6A9 \uC548\uD568\uC73C\uB85C \uC124\uC815\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 false\uC785\uB2C8\uB2E4.
create.http.listener.listener_id=HTTP \uB9AC\uC2A4\uB108\uC758 \uB9AC\uC2A4\uB108 ID\uC785\uB2C8\uB2E4.
create.http.listener.default-virtual-server=\uC774 \uB9AC\uC2A4\uB108\uC5D0 \uB300\uD55C \uAE30\uBCF8 \uAC00\uC0C1 \uC11C\uBC84\uC758 ID \uC18D\uC131\uC785\uB2C8\uB2E4.

create.virtual.server=create-virtual-server \uBA85\uB839\uC740 \uC774\uB984\uC774 \uC9C0\uC815\uB41C \uAC00\uC0C1 \uC11C\uBC84\uB97C \uC0DD\uC131\uD569\uB2C8\uB2E4. Application Server\uC758 \uAC00\uC0C1\uD654\uB97C \uC0AC\uC6A9\uD558\uBA74 \uC5EC\uB7EC \uD638\uC2A4\uD2B8 \uC8FC\uC18C\uB97C \uC218\uC2E0\uD558\uB294 \uB2E8\uC77C HTTP \uC11C\uBC84 \uD504\uB85C\uC138\uC2A4\uB97C \uD1B5\uD574 \uC5EC\uB7EC URL \uB3C4\uBA54\uC778\uC744 \uC11C\uBE44\uC2A4\uD560 \uC218 \uC788\uC2B5\uB2C8\uB2E4. \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC774 \uB450 \uAC1C\uC758 \uAC00\uC0C1 \uC11C\uBC84\uC5D0\uC11C \uC0AC\uC6A9 \uAC00\uB2A5\uD55C \uACBD\uC6B0 \uC774 \uAC00\uC0C1 \uC11C\uBC84\uB294 \uACC4\uC18D\uD574\uC11C \uB3D9\uC77C\uD55C \uBB3C\uB9AC\uC801 \uB9AC\uC18C\uC2A4 \uD480\uC744 \uACF5\uC720\uD569\uB2C8\uB2E4.
create.virtual.server.hosts=\uD604\uC7AC \uAC00\uC0C1 \uC11C\uBC84\uB97C \uC120\uD0DD\uD558\uAE30 \uC704\uD574 \uD638\uC2A4\uD2B8 \uC694\uCCAD \uD5E4\uB354\uC5D0 \uD5C8\uC6A9\uB418\uB294 \uAC12\uC758 \uC27C\uD45C(,)\uB85C \uAD6C\uBD84\uB41C \uBAA9\uB85D\uC785\uB2C8\uB2E4. \uB3D9\uC77C\uD55C \uC811\uC18D \uADF8\uB8F9\uC5D0 \uB300\uD574 \uAD6C\uC131\uB41C \uAC01 \uAC00\uC0C1 \uC11C\uBC84\uB294 \uD574\uB2F9 \uADF8\uB8F9\uC5D0 \uB300\uD55C \uACE0\uC720 \uD638\uC2A4\uD2B8\uB97C \uAC00\uC838\uC57C \uD569\uB2C8\uB2E4.
create.virtual.server.httplisteners=HTTP \uB9AC\uC2A4\uB108 ID\uC758 \uC27C\uD45C(,)\uB85C \uAD6C\uBD84\uB41C \uBAA9\uB85D\uC785\uB2C8\uB2E4. \uAE30\uBCF8 \uAC00\uC0C1 \uC11C\uBC84\uAC00 \uC544\uB2CC \uAC00\uC0C1 \uC11C\uBC84\uC5D0\uB9CC \uD544\uC694\uD569\uB2C8\uB2E4.
create.virtual.server.defaultwebmodule=\uAE30\uBCF8\uC801\uC73C\uB85C \uC774 \uAC00\uC0C1 \uC11C\uBC84\uC640 \uC5F0\uAD00\uB41C \uB3C5\uB9BD\uD615 \uC6F9 \uBAA8\uB4C8\uC785\uB2C8\uB2E4.
create.virtual.server.state=\uAC00\uC0C1 \uC11C\uBC84\uAC00 \uD65C\uC131(on)\uC778\uC9C0 \uBE44\uD65C\uC131(off \uB610\uB294 disabled)\uC778\uC9C0 \uD655\uC778\uD569\uB2C8\uB2E4. \uAE30\uBCF8\uAC12\uC740 \uD65C\uC131(on)\uC785\uB2C8\uB2E4. \uBE44\uD65C\uC131\uC778 \uACBD\uC6B0 \uAC00\uC0C1 \uC11C\uBC84\uAC00 \uC694\uCCAD\uC744 \uCC98\uB9AC\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.
create.virtual.server.logfile=\uC774 \uAC00\uC0C1 \uC11C\uBC84\uC5D0 \uB300\uD55C \uB85C\uADF8 \uD56D\uBAA9\uC744 \uAE30\uB85D\uD560 \uD30C\uC77C\uC758 \uC774\uB984\uC785\uB2C8\uB2E4. \uAE30\uBCF8\uC801\uC73C\uB85C \uC774 \uD30C\uC77C\uC740 \uC11C\uBC84 \uB85C\uADF8\uC785\uB2C8\uB2E4.
create.virtual.server.property=\uAC00\uC0C1 \uC11C\uBC84\uB97C \uAD6C\uC131\uD558\uAE30 \uC704\uD55C \uC120\uD0DD\uC801 \uC18D\uC131 \uC774\uB984/\uAC12 \uC30D\uC785\uB2C8\uB2E4.
create.virtual.server.virtual_server_id=\uC0DD\uC131\uD560 \uAC00\uC0C1 \uC11C\uBC84\uC758 \uACE0\uC720 ID\uB97C \uB098\uD0C0\uB0C5\uB2C8\uB2E4. \uC774 ID\uB294 \uC22B\uC790\uB85C \uC2DC\uC791\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

delete.http.listener=delete-http-listener \uBA85\uB839\uC740 \uC9C0\uC815\uB41C HTTP \uB9AC\uC2A4\uB108\uB97C \uC81C\uAC70\uD569\uB2C8\uB2E4.
delete.http.listener.listener_id=HTTP \uB9AC\uC2A4\uB108\uC758 \uB9AC\uC2A4\uB108 ID\uC785\uB2C8\uB2E4.
delete.http.listener.secure=true\uB85C \uC124\uC815\uB41C \uACBD\uC6B0 SSL/TLS\uB97C \uC0AC\uC6A9\uD558\uC5EC \uB3C4\uBA54\uC778 \uAD00\uB9AC \uC11C\uBC84\uC640 \uD1B5\uC2E0\uD569\uB2C8\uB2E4.

delete.virtual.server=delete-virtual-server \uBA85\uB839\uC740 \uC9C0\uC815\uB41C \uAC00\uC0C1 \uC11C\uBC84 ID\uB85C \uAC00\uC0C1 \uC11C\uBC84\uB97C \uC81C\uAC70\uD569\uB2C8\uB2E4.
delete.virtual.server.virtual_server_id=\uC0AD\uC81C\uD560 \uAC00\uC0C1 \uC11C\uBC84\uC758 \uACE0\uC720 \uC2DD\uBCC4\uC790\uC785\uB2C8\uB2E4.



list.http.listeners=list-http-listeners \uBA85\uB839\uC740 \uAE30\uC874 HTTP \uB9AC\uC2A4\uB108\uB97C \uB098\uC5F4\uD569\uB2C8\uB2E4.

list.virtual.servers=list-virtual-servers \uBA85\uB839\uC740 \uAE30\uC874 \uAC00\uC0C1 \uC11C\uBC84\uB97C \uB098\uC5F4\uD569\uB2C8\uB2E4.
