#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=create-http-listener\u306F\u3001HTTP\u30EA\u30B9\u30CA\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002
create.http.listener.listeneraddress=IP\u30A2\u30C9\u30EC\u30B9\u307E\u305F\u306F(DNS\u3067\u89E3\u6C7A\u53EF\u80FD\u306A)\u30DB\u30B9\u30C8\u540D\u3002
create.http.listener.listenerport=\u30EA\u30B9\u30CB\u30F3\u30B0\u30FB\u30BD\u30B1\u30C3\u30C8\u3092\u4F5C\u6210\u3059\u308B\u30DD\u30FC\u30C8\u756A\u53F7\u3002\u9069\u5207\u306A\u5024\u306F1-65535\u3067\u3059\u3002UNIX\u3067\u306F\u3001\u30DD\u30FC\u30C81-1024\u3067\u30EA\u30B9\u30CB\u30F3\u30B0\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u3092\u4F5C\u6210\u3059\u308B\u306B\u306F\u3001\u30B9\u30FC\u30D1\u30FC\u30E6\u30FC\u30B6\u30FC\u6A29\u9650\u304C\u5FC5\u8981\u3067\u3059\u3002SSL\u30EA\u30B9\u30CB\u30F3\u30B0\u30FB\u30BD\u30B1\u30C3\u30C8\u306F\u30DD\u30FC\u30C8443\u3092\u30EA\u30B9\u30CB\u30F3\u30B0\u3059\u308B\u3088\u3046\u306B\u69CB\u6210\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
create.http.listener.defaultvs=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306EID\u5C5E\u6027\u3002
create.http.listener.servername=\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u9001\u4FE1\u3055\u308C\u308BURL\u306E\u30DB\u30B9\u30C8\u540D\u30BB\u30AF\u30B7\u30E7\u30F3\u306E\u5185\u5BB9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u81EA\u52D5\u7684\u306B\u751F\u6210\u3059\u308BURL\u306B\u306F\u5F71\u97FF\u3057\u307E\u3059\u304C\u3001\u30B5\u30FC\u30D0\u30FC\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3084\u30D5\u30A1\u30A4\u30EB\u306EURL\u306B\u306F\u5F71\u97FF\u3057\u307E\u305B\u3093\u3002\u30B5\u30FC\u30D0\u30FC\u304C\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u3001\u3053\u306E\u540D\u524D\u306F\u30A8\u30A4\u30EA\u30A2\u30B9\u540D\u306B\u3057\u307E\u3059\u3002\u30B3\u30ED\u30F3\u3068\u30DD\u30FC\u30C8\u756A\u53F7\u3092\u8FFD\u52A0\u3059\u308B\u3068\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u9001\u4FE1\u3059\u308BURL\u5185\u3067\u305D\u306E\u30DD\u30FC\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
create.http.listener.xpowered=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u8A72\u5F53\u3059\u308B\u30EC\u30B9\u30DD\u30F3\u30B9\u306BX-Powered-By: Servlet/2.4\u30D8\u30C3\u30C0\u30FC\u3068X-Powered-By: JSP/2.0\u30D8\u30C3\u30C0\u30FC\u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002Servlet 2.4\u4ED5\u69D8\u3067\u306F\u3001\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u304C\u751F\u6210\u3059\u308B\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u30B3\u30F3\u30C6\u30CA\u304CX-Powered-By: Servlet/2.4\u30D8\u30C3\u30C0\u30FC\u3092\u8FFD\u52A0\u3067\u304D\u308B\u3088\u3046\u306B\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u540C\u69D8\u306B\u3001JSP 2.0\u4ED5\u69D8\u3067\u306F\u3001JSP\u30C6\u30AF\u30CE\u30ED\u30B8\u3092\u4F7F\u7528\u3059\u308B\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u30B3\u30F3\u30C6\u30CA\u304CX-Powered-By: JSP/2.0\u30D8\u30C3\u30C0\u30FC\u3092\u8FFD\u52A0\u3067\u304D\u308B\u3088\u3046\u306B\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30D8\u30C3\u30C0\u30FC\u306E\u76EE\u7684\u306F\u3001\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3068JSP\u30C6\u30AF\u30CE\u30ED\u30B8\u306E\u4F7F\u7528\u306B\u95A2\u3059\u308B\u7D71\u8A08\u30C7\u30FC\u30BF\u3092\u53CE\u96C6\u3059\u308B\u3053\u3068\u3067\u3059\u3002
create.http.listener.acceptorthreads=\u30EA\u30B9\u30CB\u30F3\u30B0\u30FB\u30BD\u30B1\u30C3\u30C8\u306E\u30A2\u30AF\u30BB\u30D7\u30BF\u30FB\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3002\u63A8\u5968\u5024\u306F\u30DE\u30B7\u30F3\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u306E\u6570\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F1\u3067\u3059\u3002
create.http.listener.securityenabled=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001HTTP\u30EA\u30B9\u30CA\u30FC\u3067SSL\u304C\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002SSL2\u307E\u305F\u306FSSL3\u3092\u30AA\u30F3\u307E\u305F\u306F\u30AA\u30D5\u306B\u3057\u3001SSL\u8981\u7D20\u3092\u4F7F\u7528\u3057\u3066\u6697\u53F7\u5316\u65B9\u5F0F\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3092\u4F7F\u7528\u3057\u3066\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u8A3C\u660E\u66F8\u3092\u4F7F\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u3053\u3068\u3067\u3001SSL\u3092\u30B0\u30ED\u30FC\u30D0\u30EB\u306B\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3067\u304D\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.http.listener.listener_id=HTTP\u30EA\u30B9\u30CA\u30FC\u306E\u30EA\u30B9\u30CA\u30FCID\u3002
create.http.listener.default-virtual-server=\u3053\u306E\u30EA\u30B9\u30CA\u30FC\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306EID\u5C5E\u6027\u3002

create.virtual.server=create-virtual-server\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u4F5C\u6210\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002Application Server\u3067\u4EEE\u60F3\u5316\u3092\u884C\u3046\u3053\u3068\u3067\u3001\u8907\u6570\u306E\u30DB\u30B9\u30C8\u30FB\u30A2\u30C9\u30EC\u30B9\u4E0A\u3067\u30EA\u30B9\u30CB\u30F3\u30B0\u3057\u3066\u3044\u308B1\u3064\u306EHTTP\u30B5\u30FC\u30D0\u30FC\u30FB\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u3001\u8907\u6570\u306EURL\u30C9\u30E1\u30A4\u30F3\u3092\u51E6\u7406\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30922\u3064\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3067\u4F7F\u7528\u3067\u304D\u308B\u5834\u5408\u306F\u3001\u540C\u3058\u7269\u7406\u30EA\u30BD\u30FC\u30B9\u30FB\u30D7\u30FC\u30EB\u3092\u5171\u6709\u3057\u307E\u3059\u3002
create.virtual.server.hosts=\u73FE\u5728\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u9078\u629E\u3059\u308B\u305F\u3081\u306B\u30DB\u30B9\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30D8\u30C3\u30C0\u30FC\u3067\u4F7F\u7528\u3067\u304D\u308B\u30AB\u30F3\u30DE(,)\u533A\u5207\u308A\u306E\u5024\u306E\u30EA\u30B9\u30C8\u3002\u540C\u3058\u63A5\u7D9A\u30B0\u30EB\u30FC\u30D7\u306B\u69CB\u6210\u3055\u308C\u308B\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306B\u306F\u3001\u305D\u308C\u305E\u308C\u306B\u305D\u306E\u30B0\u30EB\u30FC\u30D7\u306E\u4E00\u610F\u306E\u30DB\u30B9\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002
create.virtual.server.httplisteners=HTTP\u30EA\u30B9\u30CA\u30FCID\u306E\u30AB\u30F3\u30DE(,)\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3067\u306A\u3044\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306B\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002
create.virtual.server.defaultwebmodule=\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3Web\u30E2\u30B8\u30E5\u30FC\u30EB\u3002
create.virtual.server.state=\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u30A2\u30AF\u30C6\u30A3\u30D6(on)\u306B\u3059\u308B\u304B\u975E\u30A2\u30AF\u30C6\u30A3\u30D6(off\u307E\u305F\u306Fdisabled)\u306B\u3059\u308B\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u30A2\u30AF\u30C6\u30A3\u30D6(on)\u3067\u3059\u3002\u975E\u30A2\u30AF\u30C6\u30A3\u30D6\u306E\u5834\u5408\u3001\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3057\u307E\u305B\u3093\u3002
create.virtual.server.logfile=\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u30ED\u30B0\u30FB\u30A8\u30F3\u30C8\u30EA\u3092\u66F8\u304D\u8FBC\u3080\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u306B\u306A\u308A\u307E\u3059\u3002
create.virtual.server.property=\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u69CB\u6210\u3059\u308B\u305F\u3081\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u5C5E\u6027\u540D/\u5024\u306E\u30DA\u30A2\u3002 
create.virtual.server.virtual_server_id=\u4F5C\u6210\u3059\u308B\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u4E00\u610F\u306EID\u3092\u793A\u3057\u307E\u3059\u3002\u3053\u306EID\u306E\u5148\u982D\u3092\u6570\u5B57\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002

delete.http.listener=delete-http-listener\u306F\u3001\u6307\u5B9A\u3055\u308C\u305FHTTP\u30EA\u30B9\u30CA\u30FC\u3092\u9664\u53BB\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002
delete.http.listener.listener_id=HTTP\u30EA\u30B9\u30CA\u30FC\u306E\u30EA\u30B9\u30CA\u30FCID\u3002
delete.http.listener.secure=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001SSL/TLS\u3092\u4F7F\u7528\u3057\u3066\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u3068\u901A\u4FE1\u3057\u307E\u3059\u3002

delete.virtual.server=delete-virtual-server\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FCID\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u9664\u53BB\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002
delete.virtual.server.virtual_server_id=\u524A\u9664\u3059\u308B\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u4E00\u610F\u306E\u8B58\u5225\u5B50\u3002



list.http.listeners=list-http-listeners\u306F\u3001\u65E2\u5B58\u306EHTTP\u30EA\u30B9\u30CA\u30FC\u3092\u4E00\u89A7\u8868\u793A\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002 

list.virtual.servers=list-virtual-servers\u306F\u3001\u65E2\u5B58\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u3092\u4E00\u89A7\u8868\u793A\u3059\u308B\u30B3\u30DE\u30F3\u30C9\u3067\u3059\u3002
