#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.http.listener=O comando create-http-listener cria um listener HTTP.
create.http.listener.listeneraddress=O endere\u00E7o IP ou o nome do host (resolv\u00EDvel pelo DNS).
create.http.listener.listenerport=O n\u00FAmero da porta na qual criar o soquete de listener. Os valores v\u00E1lidos s\u00E3o 1 a 65535. Em sistemas UNIX, a cria\u00E7\u00E3o de soquetes de listener nas portas 1 a 1024 requer privil\u00E9gios de superusu\u00E1rio. Recomenda-se a configura\u00E7\u00E3o de um soquete de listener SSL na porta 443.
create.http.listener.defaultvs=O atributo de ID do servidor virtual default para esse listener.
create.http.listener.servername=Diz ao servidor o que colocar na se\u00E7\u00E3o nome do host de quaisquer URLs e o envia ao cliente. Isso afeta os URLs gerados automaticamente pelo servidor; n\u00E3o afeta os URLs para diret\u00F3rios e arquivos armazenados no servidor. Esse nome deveria ser o nome alias se o servidor utilizar um alias. Se dois-pontos e um n\u00FAmero de porta forem anexados, esta porta ser\u00E1 utilizada em URLs que o servidor envia ao cliente.
create.http.listener.xpowered=Se definido como verdadeiro, adiciona os cabe\u00E7alhos X-Powered-By: Servlet/2.4 e X-Powered-By: JSP/2.0 \u00E0s respostas apropriadas. A especifica\u00E7\u00E3o Servlet 2.4 define o cabe\u00E7alho X-Powered-By: Servlet/2.4, cujos cont\u00EAineres podem adicionar as respostas geradas pelo servlet. De forma similar, a especifica\u00E7\u00E3o JSP 2.0 define o cabe\u00E7alho X-Powered-By: JSP/2.0, cujos cont\u00EAineres podem adicionar respostas que usam a tecnologia JSP. O objetivo desses cabe\u00E7alhos \u00E9 ajudar a obter dados estat\u00EDsticos sobre o uso da tecnologia Servlet e JSP.
create.http.listener.acceptorthreads=O n\u00FAmero de threads do aceitador no soquete de listener. O valor recomendado \u00E9 o n\u00FAmero de processadores na m\u00E1quina. O valor default \u00E9 1.
create.http.listener.securityenabled=Se definido como verdadeiro, o listener HTTP executar\u00E1 o protocolo SSL. Voc\u00EA pode ativar ou desativar o SSL2 ou o SSL3 e definir cifras usando um elemento SSL. A defini\u00E7\u00E3o de seguran\u00E7a ativa ou desativa globalmente o SSL tornando dispon\u00EDveis certificados para a inst\u00E2ncia do servidor. O valor default \u00E9 falso.
create.http.listener.listener_id=O ID do listener HTTP.
create.http.listener.default-virtual-server=O atributo de ID do servidor virtual default para esse listener.

create.virtual.server=O comando create-virtual-server cria o determinado servidor virtual. A virtualiza\u00E7\u00E3o no Servidor de Aplica\u00E7\u00F5es permite que m\u00FAltiplos dom\u00EDnios URL sejam atendidos por um \u00FAnico processo de servidor HTTP cujo listener tem v\u00E1rios endere\u00E7os de host. Se a aplica\u00E7\u00E3o estiver dispon\u00EDvel em dois servidores virtuais, eles ainda compartilhar\u00E3o os mesmos pools de recursos f\u00EDsicos.
create.virtual.server.hosts=Uma lista de valores separados por v\u00EDrgulas (,) permitidos no cabe\u00E7alho de solicita\u00E7\u00E3o do host para selecionar o servidor virtual atual. Cada servidor virtual configurado para o mesmo grupo de conex\u00F5es deve ter um host exclusivo para esse grupo.
create.virtual.server.httplisteners=Uma lista separada por v\u00EDrgulas (,) de IDs de listeners HTTP. Necess\u00E1rio apenas para um servidor virtual que n\u00E3o seja o servidor virtual default.
create.virtual.server.defaultwebmodule=O m\u00F3dulo Web standalone associado a este servidor virtual por default.
create.virtual.server.state=Determina se um servidor virtual est\u00E1 ativo (on) ou inativo (off ou desativado). O default \u00E9 ativo (on). Quando inativo, o servidor virtual n\u00E3o atende \u00E0s solicita\u00E7\u00F5es.
create.virtual.server.logfile=O nome do arquivo nos quais as entradas de log para este servidor virtual devem ser gravadas. Por default, este \u00E9 o log do servidor.
create.virtual.server.property=Pares opcionais de nome/valor de atributo para configurar o servidor virtual.
create.virtual.server.virtual_server_id=Identifica o ID exclusivo para o servidor virtual a ser criado. Esse ID n\u00E3o pode come\u00E7ar com um n\u00FAmero.

delete.http.listener=O comando delete-http-listener remove o listener HTTP especificado.
delete.http.listener.listener_id=O ID do listener HTTP.
delete.http.listener.secure=Se definido como verdadeiro, usa SSL/TLS para comunicar-se com o servidor de administra\u00E7\u00E3o de dom\u00EDnios.

delete.virtual.server=O comando delete-virtual-server remove o servidor virtual com o ID de servidor virtual especificado.
delete.virtual.server.virtual_server_id=O identificador exclusivo do servidor virtual a ser deletado.



list.http.listeners=O comando list-http-listeners lista os listeners HTTP existentes.

list.virtual.servers=O comando list-virtual-servers lista os servidores virtuais existentes.
