#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

button.Flush=\u30D5\u30E9\u30C3\u30B7\u30E5
tree.jdbcResources=JDBC\u30EA\u30BD\u30FC\u30B9
tree.jdbcResources.tooltip=JDBC\u30EA\u30BD\u30FC\u30B9
tree.connectionPools=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB
tree.connectionPools.tooltip=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB
tree.jdbc=JDBC
tree.jdbc.tooltip=JDBC

jdbc.pageTitle=JDBC
jdbc.pageTitleHelp=

jdbcResources.pageTitle=JDBC\u30EA\u30BD\u30FC\u30B9
jdbcResources.pageTitleHelp=JDBC\u30EA\u30BD\u30FC\u30B9\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u63A5\u7D9A\u3059\u308B\u624B\u6BB5\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u63D0\u4F9B\u3057\u307E\u3059\u3002
jdbcResource.editPageTitle=JDBC\u30EA\u30BD\u30FC\u30B9\u306E\u7DE8\u96C6
jdbcResource.editPageTitleHelp=\u65E2\u5B58\u306EJDBC\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002
jdbcResource.targetPageTitle=JDBC\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8
jdbcResource.newPageTitle=\u65B0\u898FJDBC\u30EA\u30BD\u30FC\u30B9
jdbcResource.newPageTitleHelp=\u4F5C\u6210\u3059\u308BJDBC\u30EA\u30BD\u30FC\u30B9\u3092\u7279\u5B9A\u3059\u308B\u4E00\u610F\u306AJNDI\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u540D\u524D\u306B\u542B\u3081\u308B\u3053\u3068\u304C\u3067\u304D\u308B\u306E\u306F\u3001\u82F1\u6570\u5B57\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30C0\u30C3\u30B7\u30E5\u3001\u307E\u305F\u306F\u30C9\u30C3\u30C8\u306E\u5404\u6587\u5B57\u306E\u307F\u3067\u3059\u3002
jdbcResource.poolHelp=\u300C<a href="#{request.contextPath}/jdbc/jdbcConnectionPools.jsf">JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB</a>\u300D\u30DA\u30FC\u30B8\u3092\u4F7F\u7528\u3057\u3066\u65B0\u898F\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059

#JDBC Connection Pool
jdbcConnectionPools.pageTitle=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB
jdbcConnectionPools.pageTitleHelp=\u30C7\u30FC\u30BF\u3092\u683C\u7D0D\u3001\u7DE8\u6210\u3001\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u3001\u307B\u3068\u3093\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u30EA\u30EC\u30FC\u30B7\u30E7\u30CA\u30EB\u30FB\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002Java EE\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001JDBC API\u3092\u4ECB\u3057\u3066\u30EA\u30EC\u30FC\u30B7\u30E7\u30CA\u30EB\u30FB\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u30A2\u30AF\u30BB\u30B9\u3057\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u306B\u306F\u3001\u63A5\u7D9A\u3092\u53D6\u5F97\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002

jdbcConnectionPool.step1PageTitle=\u65B0\u898FJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB(\u30B9\u30C6\u30C3\u30D71/2)
jdbcConnection.step1PageHelp=\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u5168\u822C\u7684\u306A\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002
jdbcConnectionPool.Step2PageTitle=\u65B0\u898FJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB(\u30B9\u30C6\u30C3\u30D72/2)
jdbcConnection.step2PageHelp=\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u5168\u822C\u7684\u306A\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u306F\u3001\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u540D\u307E\u305F\u306F\u30C9\u30E9\u30A4\u30D0\u30FB\u30AF\u30E9\u30B9\u540D\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002


jdbcConnectionPool.editPageTitle=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u7DE8\u96C6
jdbcConnection.editPageHelp=\u65E2\u5B58\u306EJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u5909\u66F4\u3057\u307E\u3059\u3002JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3068\u306F\u3001\u7279\u5B9A\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u305F\u3081\u306E\u518D\u5229\u7528\u53EF\u80FD\u306A\u63A5\u7D9A\u306E\u30B0\u30EB\u30FC\u30D7\u3067\u3059\u3002
jdbcPool.general=\u4E00\u822C\u8A2D\u5B9A
jdbcPool.poolName=\u30D7\u30FC\u30EB\u540D:
jdbcPool.datasource=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u540D:
jdbcPool.driver=\u30C9\u30E9\u30A4\u30D0\u30FB\u30AF\u30E9\u30B9\u540D:

## do not translate DataSource and XADataSource
jdbcPool.datasourceHelpEnter=DataSource API\u3068XADataSource API\u306E\u3069\u3061\u3089\u304B\u307E\u305F\u306F\u4E21\u65B9\u3092\u5B9F\u88C5\u3059\u308B\u3001\u30D9\u30F3\u30C0\u30FC\u56FA\u6709\u306E\u30AF\u30E9\u30B9\u540D\u3092\u9078\u629E\u307E\u305F\u306F\u5165\u529B\u3057\u307E\u3059
## do not translate java.sql.Driver
jdbcPool.driverHelpEnter=java.sql.Driver\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u30D9\u30F3\u30C0\u30FC\u56FA\u6709\u306E\u30AF\u30E9\u30B9\u540D\u3092\u9078\u629E\u307E\u305F\u306F\u5165\u529B\u3057\u307E\u3059\u3002
## do not translate DataSource and XADataSource

jdbcPool.datasourceHelp=DataSource API\u3068XADataSource API\u306E\u3069\u3061\u3089\u304B\u307E\u305F\u306F\u4E21\u65B9\u3092\u5B9F\u88C5\u3059\u308B\u30D9\u30F3\u30C0\u30FC\u56FA\u6709\u306E\u30AF\u30E9\u30B9\u540D

## do not translate java.sql.Driver
jdbcPool.driverHelp=java.sql.Driver\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u30D9\u30F3\u30C0\u30FC\u56FA\u6709\u306E\u30AF\u30E9\u30B9\u540D

jdbcPool.resTypeHelp=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u304C2\u3064\u4EE5\u4E0A\u306E\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u5834\u5408\u306B\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002  
jdbcPool.dbVendor=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30C9\u30E9\u30A4\u30D0\u306E\u30D9\u30F3\u30C0\u30FC:
jdbcPool.dbVendorHelp=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30C9\u30E9\u30A4\u30D0\u306E\u30D9\u30F3\u30C0\u30FC\u3092\u9078\u629E\u307E\u305F\u306F\u5165\u529B
jdbcPool.introspect=\u30A4\u30F3\u30C8\u30ED\u30B9\u30DA\u30AF\u30C8:
jdbcPool.introspectHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u540D\u307E\u305F\u306F\u30C9\u30E9\u30A4\u30D0\u5B9F\u88C5\u30AF\u30E9\u30B9\u540D\u3067\u30A4\u30F3\u30C8\u30ED\u30B9\u30DA\u30AF\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002
jdbcPool.poolSettings=\u30D7\u30FC\u30EB\u8A2D\u5B9A
jdbcPool.initPoolSize=\u521D\u671F\u304A\u3088\u3073\u6700\u5C0F\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA:
jdbcPool.initPoolSizeHelp=\u30D7\u30FC\u30EB\u3067\u7DAD\u6301\u3059\u308B\u63A5\u7D9A\u306E\u6700\u5C0F\u6570\u304A\u3088\u3073\u521D\u671F\u6570
jdbcPool.maxPoolSize=\u6700\u5927\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA:
jdbcPool.maxPoolSizeHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u6E80\u305F\u3059\u305F\u3081\u306B\u4F5C\u6210\u3067\u304D\u308B\u63A5\u7D9A\u306E\u6700\u5927\u6570
jdbcPool.poolResize=\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA\u5909\u66F4\u91CF:
jdbcPool.poolResizeHelp=\u30D7\u30FC\u30EB\u30FB\u30A2\u30A4\u30C9\u30EB\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u6709\u52B9\u671F\u9650\u5207\u308C\u306B\u306A\u3063\u305F\u3068\u304D\u306B\u9664\u53BB\u3055\u308C\u308B\u63A5\u7D9A\u306E\u6570
jdbcPool.idleTimeout=\u30A2\u30A4\u30C9\u30EB\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jdbcPool.idleTimeoutHelp=\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u5185\u3067\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u6700\u5927\u6642\u9593
jdbcPool.maxWait=\u6700\u5927\u5F85\u6A5F\u6642\u9593:
jdbcPool.maxWaitHelp=\u547C\u51FA\u3057\u5074\u304C\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u9001\u4FE1\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u6642\u9593
jdbcPool.Validation=\u63A5\u7D9A\u691C\u8A3C
jdbcPool.conValidation=\u63A5\u7D9A\u691C\u8A3C:
jdbcPool.conValidationHelp=\u63A5\u7D9A\u3092\u691C\u8A3C\u3057\u3001\u969C\u5BB3\u767A\u751F\u6642\u306B\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u63A5\u7D9A\u3092\u8A31\u53EF\u3059\u308B
jdbcPool.valMethod=\u691C\u8A3C\u65B9\u6CD5:
jdbcPool.valCN=\u691C\u8A3C\u30AF\u30E9\u30B9\u540D:
jdbcPool.valCNHelp=\u30AB\u30B9\u30BF\u30E0\u691C\u8A3C\u3092\u9078\u629E\u3057\u305F\u5834\u5408\u306F\u3001\u691C\u8A3C\u30AF\u30E9\u30B9\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
jdbcPool.tableName=\u8868\u540D:
jdbcPool.tableNameHelp=\u8868\u306E\u691C\u8A3C\u3092\u9078\u629E\u3057\u305F\u5834\u5408\u306F\u3001\u8868\u540D\u3092\u9078\u629E\u307E\u305F\u306F\u5165\u529B\u3057\u307E\u3059\u3002
jdbcPool.populatetableNames=\u8868\u540D\u306E\u53D6\u8FBC\u307F
jdbcPool.failOnAny=\u3059\u3079\u3066\u306E\u969C\u5BB3\u6642:
jdbcPool.failOnAnyHelp=\u969C\u5BB3\u767A\u751F\u6642\u306B\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u3066\u304B\u3089\u518D\u63A5\u7D9A\u3057\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F\u4F7F\u7528\u6642\u306B\u306E\u307F\u518D\u63A5\u7D9A\u3059\u308B
jdbcPool.closeAll=\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u308B
jdbcPool.allowCaller=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u547C\u51FA\u3057\u5074\u4EE5\u5916\u3092\u8A31\u53EF:
jdbcPool.allowCallerHelp=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30FB\u30D5\u30A3\u30EB\u30BF\u306A\u3069\u3001\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306E\u547C\u51FA\u3057\u5074\u4EE5\u5916\u304C\u30D7\u30FC\u30EB\u3092\u4F7F\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059
jdbcPool.nonTransConnection=\u975E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u63A5\u7D9A:
jdbcPool.nonTransConnectionHelp=\u975E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u63A5\u7D9A\u3092\u8FD4\u3057\u307E\u3059

jdbcPool.transIsolationSection=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3
jdbcPool.transIsolation=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5206\u96E2:
jdbcPool.transIsolationHelp=\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u3001JDBC\u30C9\u30E9\u30A4\u30D0\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30EC\u30D9\u30EB\u304C\u9069\u7528\u3055\u308C\u307E\u3059

#the following is a checkbox labeled  Isolation Label, followed by the word Guaranteed
#   Isolation Level: []  Guaranteed

jdbcPool.isoLevel=\u5206\u96E2\u30EC\u30D9\u30EB:
jdbcPool.Guaranteed=\u4FDD\u8A3C\u4ED8\u304D
jdbcPool.isoLevelHelp=\u3059\u3079\u3066\u306E\u63A5\u7D9A\u304C\u540C\u3058\u5206\u96E2\u30EC\u30D9\u30EB\u3092\u4F7F\u7528\u3057\u307E\u3059(\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5206\u96E2\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059)


jdbcPool.Guaranteed=\u4FDD\u8A3C\u4ED8\u304D
jdbcPool.initSqlHelp=\u30D7\u30FC\u30EB\u304B\u3089\u63A5\u7D9A\u304C\u4F5C\u6210\u3055\u308C\u305F\u3068\u304D\u306B\u5E38\u306B\u5B9F\u884C\u3059\u308BSQL\u6587\u5B57\u5217\u3092\u6307\u5B9A\u3057\u307E\u3059
jdbcPool.initSql=SQL\u306E\u521D\u671F\u5316:
jdbcPool.sqlTL=SQL\u30C8\u30EC\u30FC\u30B9\u30FB\u30EA\u30B9\u30CA\u30FC:
jdbcPool.sqlTLHelp=org.glassfish.api.jdbc.SQLTraceListener\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8
jdbcPool.pooling=\u30D7\u30FC\u30EB:
jdbcPool.poolingHelp=false\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u63A5\u7D9A\u306E\u30D7\u30FC\u30EB\u304C\u7121\u52B9\u306B\u306A\u308A\u307E\u3059
jdbcPool.duringCreation=\u4F5C\u6210\u4E2D
jdbcPool.ping=Ping:
jdbcPool.pingHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u4F5C\u6210\u307E\u305F\u306F\u518D\u69CB\u6210\u4E2D\u306B\u30D7\u30FC\u30EB\u306Bping\u304C\u5B9F\u884C\u3055\u308C\u3001\u5C5E\u6027\u306B\u5BFE\u3059\u308B\u8AA4\u3063\u305F\u5024\u304C\u3042\u308C\u3070\u305D\u308C\u3092\u8B58\u5225\u3057\u3066\u8B66\u544A\u3057\u307E\u3059
jdbcConnectionPool.advancePageTitle=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u8A73\u7D30\u5C5E\u6027\u306E\u7DE8\u96C6
jdbcConnectionPool.advancePageTitleHelp=\u65E2\u5B58\u306EJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u5909\u66F4\u3057\u307E\u3059\u3002JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u3068\u306F\u3001\u7279\u5B9A\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u305F\u3081\u306E\u518D\u5229\u7528\u53EF\u80FD\u306A\u63A5\u7D9A\u306E\u30B0\u30EB\u30FC\u30D7\u3067\u3059\u3002 
jdbcPool.connectionSettings=\u63A5\u7D9A\u8A2D\u5B9A
jdbcPool.wrapJdbcObjects=JDBC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30E9\u30C3\u30D7:

## do not translate the StudlyCaps word: Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData
jdbcPool.wrapJdbcObjectsHelp=true\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306FStatement\u3001PreparedStatement\u3001CallableStatement\u3001ResultSet\u3001DatabaseMetaData\u306B\u5BFE\u3057\u3066\u30E9\u30C3\u30D7\u3055\u308C\u305FJDBC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3059

jdbcPool.statementCacheSize=\u6587\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30B5\u30A4\u30BA:
jdbcPool.statementCacheSizeHelp=0\u4EE5\u5916\u306E\u6B63\u306E\u6570(\u305F\u3068\u3048\u3070\u300110)\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u6709\u52B9\u306B\u306A\u308A\u307E\u3059
jdbcPool.statementTimeoutInSeconds=\u6587\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jdbcPool.statementTimeoutInSecondsHelp=\u63A5\u7D9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3001\u5B9F\u884C\u6642\u9593\u304C\u7570\u5E38\u306B\u9577\u3044\u554F\u5408\u305B\u3092\u505C\u6B62\u3067\u304D\u307E\u3059\u3002-1\u306F\u3001\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
jdbcPool.validateAtmostOnceInSeconds=\u6700\u5927\u30671\u56DE\u691C\u8A3C:
jdbcPool.validateAtmostOnceInSecondsHelp=\u63A5\u7D9A\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306E\u9023\u7D9A\u3057\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6642\u9593\u9593\u9694\u3092\u79D2\u5358\u4F4D\u3067\u4E00\u5EA6\u306E\u307F\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F0\u3067\u3059\u3002\u3053\u306E\u5C5E\u6027\u304C\u7121\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
jdbcPool.connectionLeakTimeoutInSeconds=\u63A5\u7D9A\u30EA\u30FC\u30AF\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jdbcPool.connectionLeakTimeoutInSecondsHelp=0\u306F\u3001\u63A5\u7D9A\u30EA\u30FC\u30AF\u306E\u691C\u51FA\u3092\u884C\u308F\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059
jdbcPool.connectionLeakReclaim=\u63A5\u7D9A\u30EA\u30FC\u30AF\u518D\u8981\u6C42:
jdbcPool.connectionLeakReclaimHelp=\u6709\u52B9\u306B\u3057\u305F\u5834\u5408\u306F\u3001\u63A5\u7D9A\u30EA\u30FC\u30AF\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u767A\u751F\u5F8C\u3001\u30EA\u30FC\u30AF\u3055\u308C\u305F\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u306B\u3088\u3063\u3066\u518D\u8981\u6C42\u3055\u308C\u307E\u3059
jdbcPool.statementLeakTimeoutInSeconds=\u6587\u30EA\u30FC\u30AF\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jdbcPool.statementLeakTimeoutInSecondsHelp=0\u306F\u3001\u6587\u30EA\u30FC\u30AF\u306E\u691C\u51FA\u3092\u884C\u308F\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059
jdbcPool.statementLeakReclaim=\u6587\u30EA\u30FC\u30AF\u306E\u518D\u8981\u6C42:
jdbcPool.statementLeakReclaimHelp=\u6709\u52B9\u306B\u3057\u305F\u5834\u5408\u306F\u3001\u6587\u306E\u30EA\u30FC\u30AF\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u767A\u751F\u5F8C\u3001\u30EA\u30FC\u30AF\u3055\u308C\u305F\u6587\u304C\u30D7\u30FC\u30EB\u306B\u3088\u3063\u3066\u518D\u8981\u6C42\u3055\u308C\u307E\u3059
jdbcPool.connectionCreationRetryAttempts=\u4F5C\u6210\u518D\u8A66\u884C\u56DE\u6570:
jdbcPool.connectionCreationRetryAttemptsHelp=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u30020\u306F\u3001\u518D\u8A66\u884C\u306A\u3057\u3092\u793A\u3057\u307E\u3059\u3002
jdbcPool.connectionCreationRetryIntervalInSeconds=\u518D\u8A66\u884C\u9593\u9694:
jdbcPool.connectionCreationRetryIntervalInSecondsHelp=\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u518D\u8A66\u884C\u3059\u308B\u6642\u9593\u9593\u9694\u3002\u63A5\u7D9A\u518D\u8A66\u884C\u56DE\u6570\u304C0\u3088\u308A\u3082\u5927\u304D\u3044\u5834\u5408\u306B\u6709\u52B9\u3067\u3059\u3002
jdbcPool.lazyConnectionEnlistment=\u4F7F\u7528\u6642\u306B\u306E\u307F\u63A5\u7D9A\u3092\u767B\u9332:
jdbcPool.lazyConnectionEnlistmentHelp=\u5B9F\u969B\u306B\u30E1\u30BD\u30C3\u30C9\u3067\u4F7F\u7528\u3059\u308B\u3068\u304D\u306B\u9650\u308A\u3001\u30EA\u30BD\u30FC\u30B9\u3092\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306B\u767B\u9332\u3057\u307E\u3059
jdbcPool.lazyConnectionAssociation=\u4F7F\u7528\u6642\u306B\u306E\u307F\u95A2\u9023\u4ED8\u3051:
jdbcPool.lazyConnectionAssociationHelp=\u63A5\u7D9A\u306B\u5BFE\u3057\u3066\u64CD\u4F5C\u304C\u5B9F\u884C\u3055\u308C\u308B\u6642\u70B9\u3067\u521D\u3081\u3066\u63A5\u7D9A\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u307E\u3059
jdbcPool.associationWithThread=\u30B9\u30EC\u30C3\u30C9\u3068\u306E\u95A2\u9023\u4ED8\u3051:
jdbcPool.associationWithThreadHelp=\u540C\u3058\u30B9\u30EC\u30C3\u30C9\u3067\u63A5\u7D9A\u304C\u5FC5\u8981\u306B\u306A\u3063\u305F\u3068\u304D\u3001\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u306F\u3059\u3067\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u63A5\u7D9A\u3092\u518D\u5229\u7528\u3067\u304D\u307E\u3059
jdbcPool.matchConnections=\u63A5\u7D9A\u306E\u30DE\u30C3\u30C1\u30F3\u30B0:
jdbcPool.matchConnectionsHelp=\u30D7\u30FC\u30EB\u306B\u5BFE\u3059\u308B\u63A5\u7D9A\u30DE\u30C3\u30C1\u30F3\u30B0\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3057\u307E\u3059
jdbcPool.maxConnectionUsageCount=\u6700\u5927\u63A5\u7D9A\u4F7F\u7528\u6570:
jdbcPool.maxConnectionUsageCountHelp=\u63A5\u7D9A\u306F\u6307\u5B9A\u3057\u305F\u56DE\u6570\u30D7\u30FC\u30EB\u3067\u518D\u5229\u7528\u3055\u308C\u3001\u305D\u306E\u5F8C\u9589\u3058\u3089\u308C\u307E\u3059\u30020\u306F\u3001\u3053\u306E\u6A5F\u80FD\u304C\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
jdbcConnectionPool.propertyPageTitle=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u7DE8\u96C6
jdbcConnectionPool.propertyPageTitleHelp=\u65E2\u5B58\u306EJDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u5909\u66F4\u3057\u307E\u3059\u3002

resourcesTable.colPoolName=\u30D7\u30FC\u30EB\u540D
resourcesTable.colJndiName=JNDI\u540D
resourcesTable.colDesc=\u8AAC\u660E
resourcesTable.colPool=\u63A5\u7D9A\u30D7\u30FC\u30EB
resourcesTable.colResType=\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7
resourcesTable.colClassname=\u30AF\u30E9\u30B9\u540D
resourcesTable.colResAdapter=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF
resourcesTable.resources=\u30EA\u30BD\u30FC\u30B9
resourcesTable.Pools=\u30D7\u30FC\u30EB

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteJR=\u9078\u629E\u3057\u305FJDBC\u30EA\u30BD\u30FC\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteCP=\u9078\u629E\u3057\u305F\u63A5\u7D9A\u30D7\u30FC\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002

msg.warning.poolCreatedPingFailed=\u30D7\u30FC\u30EB\u306F\u6B63\u5E38\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u6B21\u306E\u8B66\u544A\u304C\u3042\u308A\u307E\u3059:
msg.warning.poolSavedPingFailed=\u5024\u306F\u6B63\u5E38\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u6B21\u306E\u8B66\u544A\u304C\u3042\u308A\u307E\u3059:
msg.Error.classNameCannotBeEmpty=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u540D\u307E\u305F\u306F\u30C9\u30E9\u30A4\u30D0\u30FB\u30AF\u30E9\u30B9\u540D\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
