#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

button.Flush=Vider
tree.jdbcResources=Ressources JDBC
tree.jdbcResources.tooltip=Ressources JDBC
tree.connectionPools=Pools de connexions JDBC
tree.connectionPools.tooltip=Pools de connexions JDBC
tree.jdbc=JDBC
tree.jdbc.tooltip=JDBC

jdbc.pageTitle=JDBC
jdbc.pageTitleHelp=

jdbcResources.pageTitle=Ressources JDBC
jdbcResources.pageTitleHelp=Les ressources JDBC fournissent des applications pouvant se connecter \u00E0 une base de donn\u00E9es.
jdbcResource.editPageTitle=Modifier une ressource JDBC
jdbcResource.editPageTitleHelp=Modifiez une source de donn\u00E9es JDBC existante.
jdbcResource.targetPageTitle=Cibles de ressources JDBC
jdbcResource.newPageTitle=Nouvelle ressource JDBC
jdbcResource.newPageTitleHelp=Sp\u00E9cifiez un nom JNDI unique identifiant la ressource JDBC \u00E0 cr\u00E9er. Le nom ne peut contenir que des caract\u00E8res alphanum\u00E9riques, des traits de soulignement, des tirets ou des points.
jdbcResource.poolHelp=Utilisez la page <a href="#{request.contextPath}/jdbc/jdbcConnectionPools.jsf">Pools de connexions JDBC</a> pour cr\u00E9er des pools

#JDBC Connection Pool
jdbcConnectionPools.pageTitle=Pools de connexions JDBC
jdbcConnectionPools.pageTitleHelp=Pour stocker, organiser et extraire les donn\u00E9es, la plupart des applications utilisent des bases de donn\u00E9es relationnelles. Les applications de java EE acc\u00E8dent aux bases de donn\u00E9es relationnelles via l'API JDBC. Pour acc\u00E9der \u00E0 une base de donn\u00E9es, les applications doivent obtenir une connexion.

jdbcConnectionPool.step1PageTitle=Nouveau pool de connexions JDBC (\u00E9tape 1 sur 2)
jdbcConnection.step1PageHelp=Identifiez les param\u00E8tres g\u00E9n\u00E9raux du pool de connexions.
jdbcConnectionPool.Step2PageTitle=Nouveau pool de connexions JDBC (\u00E9tape 2 sur 2)
jdbcConnection.step2PageHelp=Identifiez les param\u00E8tres g\u00E9n\u00E9raux du pool de connexions. Le nom de classe de la source de donn\u00E9es ou le nom de classe du pilote doit \u00EAtre indiqu\u00E9 pour le pool de connexions.


jdbcConnectionPool.editPageTitle=Modifier un pool de connexions JDBC
jdbcConnection.editPageHelp=Modifiez un pool de connexions JDBC. Un pool de connexions JDBC est un groupe de connexions r\u00E9utilisables pour une base de donn\u00E9es particuli\u00E8re.
jdbcPool.general=Param\u00E8tres g\u00E9n\u00E9raux
jdbcPool.poolName=Nom du pool :
jdbcPool.datasource=Nom de classe de la source de donn\u00E9es :
jdbcPool.driver=Nom de classe du pilote :

## do not translate DataSource and XADataSource
jdbcPool.datasourceHelpEnter=S\u00E9lectionnez ou entrez un nom de classe propre au fournisseur qui impl\u00E9mente les API DataSource et/ou XADataSource
## do not translate java.sql.Driver
jdbcPool.driverHelpEnter=S\u00E9lectionnez ou entrez un nom de classe propre au fournisseur qui impl\u00E9mente l'interface java.sql.Driver.
## do not translate DataSource and XADataSource

jdbcPool.datasourceHelp=Nom de classe propre au fournisseur qui impl\u00E9mente les API DataSource et/ou XADataSource

## do not translate java.sql.Driver
jdbcPool.driverHelp=Nom de classe propre au fournisseur qui impl\u00E9mente l'interface java.sql.Driver.

jdbcPool.resTypeHelp=Doit \u00EAtre sp\u00E9cifi\u00E9 si la classe de source de donn\u00E9es impl\u00E9mente plusieurs interfaces.  
jdbcPool.dbVendor=Fournisseur du pilote de base de donn\u00E9es :
jdbcPool.dbVendorHelp=S\u00E9lectionnez ou entrez un fournisseur de pilote de base de donn\u00E9es
jdbcPool.introspect=Introspecter :
jdbcPool.introspectHelp=Si cette option est activ\u00E9e, les noms de classe de la source de donn\u00E9es ou de l'impl\u00E9mentation du pilote permettront l'introspection.
jdbcPool.poolSettings=Param\u00E8tres du pool
jdbcPool.initPoolSize=Taille initiale et minimale du pool :
jdbcPool.initPoolSizeHelp=Nombre minimal et initial de connexions g\u00E9r\u00E9es dans le pool
jdbcPool.maxPoolSize=Taille maximale du pool :
jdbcPool.maxPoolSizeHelp=Nombre maximal de connexions pouvant \u00EAtre cr\u00E9\u00E9es pour r\u00E9pondre aux demandes client
jdbcPool.poolResize=Valeur de redimensionnement du pool :
jdbcPool.poolResizeHelp=Nombre de connexions qui doivent \u00EAtre enlev\u00E9es \u00E0 l'expiration du d\u00E9lai d'inactivit\u00E9 du pool
jdbcPool.idleTimeout=D\u00E9lai d'inactivit\u00E9 :
jdbcPool.idleTimeoutHelp=D\u00E9lai maximal pendant lequel une connexion du pool peut rester inactive
jdbcPool.maxWait=Attente max. :
jdbcPool.maxWaitHelp=Dur\u00E9e pendant laquelle le programme appelant attend avant qu'une notification d'expiration de la connexion soit envoy\u00E9e
jdbcPool.Validation=Validation de la connexion
jdbcPool.conValidation=Validation de la connexion :
jdbcPool.conValidationHelp=Validez les connexions et autorisez le serveur \u00E0 se reconnecter en cas d'\u00E9chec
jdbcPool.valMethod=M\u00E9thode de validation :
jdbcPool.valCN=Nom de classe de validation :
jdbcPool.valCNHelp=Si la validation personnalis\u00E9e est s\u00E9lectionn\u00E9, indiquez le nom de classe de validation.
jdbcPool.tableName=Nom de la table :
jdbcPool.tableNameHelp=Si la validation de table est s\u00E9lectionn\u00E9e, s\u00E9lectionnez ou entrez un nom de table.
jdbcPool.populatetableNames=Renseigner les noms de table
jdbcPool.failOnAny=Echec sur tout :
jdbcPool.failOnAnyHelp=Fermez et r\u00E9tablissez toutes les connexions en cas d'\u00E9chec. Sinon, seules les connexions qui \u00E9taient utilis\u00E9es sont r\u00E9tablies
jdbcPool.closeAll=Fermer toutes les connexions
jdbcPool.allowCaller=Autoriser les programmes appelants autres que des composants :
jdbcPool.allowCallerHelp=Des programmes appelants autres que des composants peuvent utiliser le pool, comme des filtres de servlet
jdbcPool.nonTransConnection=Connexions non transactionnelles :
jdbcPool.nonTransConnectionHelp=Renvoie des connexions non transactionnelles

jdbcPool.transIsolationSection=Transaction
jdbcPool.transIsolation=Isolement de la transaction :
jdbcPool.transIsolationHelp=En l'absence de s\u00E9lection, le niveau par d\u00E9faut du pilote JDBC est utilis\u00E9

#the following is a checkbox labeled  Isolation Label, followed by the word Guaranteed
#   Isolation Level: []  Guaranteed

jdbcPool.isoLevel=Niveau d'isolement :
jdbcPool.Guaranteed=Garanti
jdbcPool.isoLevelHelp=Toutes les connexions utilisent le m\u00EAme niveau d'isolement. L'isolement des transactions est obligatoire.


jdbcPool.Guaranteed=Garanti
jdbcPool.initSqlHelp=Indiquez une cha\u00EEne SQL \u00E0 ex\u00E9cuter lorsqu'une connexion est cr\u00E9\u00E9e \u00E0 partir du pool
jdbcPool.initSql=Init. SQL :
jdbcPool.sqlTL=Processus d'\u00E9coute de trace SQL :
jdbcPool.sqlTLHelp=Liste des classes (s\u00E9par\u00E9es par des virgules) qui impl\u00E9mentent l'interface org.glassfish.api.jdbc.SQLTraceListener
jdbcPool.pooling=Groupement :
jdbcPool.poolingHelp=Lorsqu'il a la valeur False, ce param\u00E8tre d\u00E9sactive le groupement des connexions pour le pool
jdbcPool.duringCreation=Lors de la cr\u00E9ation
jdbcPool.ping=Ping :
jdbcPool.pingHelp=Lorsque cette option est activ\u00E9e, un commande Ping est ex\u00E9cut\u00E9e sur le pool lors de la cr\u00E9ation ou de la reconfiguration afin d'identifier et de signaler les valeurs incorrectes de ses attributs, le cas \u00E9ch\u00E9ant
jdbcConnectionPool.advancePageTitle=Modifier les attributs avanc\u00E9s d'un pool de connexions JDBC
jdbcConnectionPool.advancePageTitleHelp=Modifiez un pool de connexions JDBC. Un pool de connexions JDBC est un groupe de connexions r\u00E9utilisables pour une base de donn\u00E9es particuli\u00E8re. 
jdbcPool.connectionSettings=Param\u00E8tres de connexion
jdbcPool.wrapJdbcObjects=Encapsuler les objets JDBC :

## do not translate the StudlyCaps word: Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData
jdbcPool.wrapJdbcObjectsHelp=Lorsque ce param\u00E8tre a la valeur True, l'application obtient des objets JDBC encapsul\u00E9s pour Statement, PreparedStatement, CallableStatement, ResultSet et DatabaseMetaData

jdbcPool.statementCacheSize=Taille du cache d'instruction :
jdbcPool.statementCacheSizeHelp=La mise en m\u00E9moire cache est activ\u00E9e lorsque la valeur d\u00E9finie est sup\u00E9rieure \u00E0 z\u00E9ro (par exemple, 10)
jdbcPool.statementTimeoutInSeconds=D\u00E9lai d'expiration des instructions :
jdbcPool.statementTimeoutInSecondsHelp=Propri\u00E9t\u00E9 de d\u00E9lai d'expiration d'une connexion qui permet de mettre fin aux requ\u00EAtes dont l'ex\u00E9cution est anormalement longue. -1 implique qu'elle n'est pas activ\u00E9e.
jdbcPool.validateAtmostOnceInSeconds=Valider une fois au plus :
jdbcPool.validateAtmostOnceInSecondsHelp=Indique l'intervalle, exprim\u00E9 en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La valeur par d\u00E9faut est 0, ce qui signifie que l'attribut n'est pas activ\u00E9.
jdbcPool.connectionLeakTimeoutInSeconds=Temporisation de la perte de connexion :
jdbcPool.connectionLeakTimeoutInSecondsHelp=La valeur 0 implique l'absence de d\u00E9tection de perte de connexion
jdbcPool.connectionLeakReclaim=R\u00E9cup\u00E9ration de la perte de connexion :
jdbcPool.connectionLeakReclaimHelp=Si cette option est activ\u00E9e, les connexions pr\u00E9sentant des pertes sont restaur\u00E9es dans le pool une fois atteint le d\u00E9lai d'expiration de perte de connexion
jdbcPool.statementLeakTimeoutInSeconds=D\u00E9lai d'expiration de perte d'instruction :
jdbcPool.statementLeakTimeoutInSecondsHelp=La valeur 0 implique l'absence de d\u00E9tection de perte d'instruction
jdbcPool.statementLeakReclaim=R\u00E9cup\u00E9ration de perte d'instruction :
jdbcPool.statementLeakReclaimHelp=Si cette option est activ\u00E9e, les instructions pr\u00E9sentant des pertes sont restaur\u00E9es dans le pool une fois atteinte le d\u00E9lai d'expiration de perte d'instruction
jdbcPool.connectionCreationRetryAttempts=Tentatives de cr\u00E9ation :
jdbcPool.connectionCreationRetryAttemptsHelp=Nombre de tentatives de cr\u00E9ation d'une connexion. 0 n'implique aucune nouvelle tentative.
jdbcPool.connectionCreationRetryIntervalInSeconds=Intervalle entre les tentatives :
jdbcPool.connectionCreationRetryIntervalInSecondsHelp=Intervalle de temps entre les tentatives de cr\u00E9ation d'une connexion. En vigueur lorsque le param\u00E8tre Tentatives de cr\u00E9ation a une valeur sup\u00E9rieure \u00E0 0.
jdbcPool.lazyConnectionEnlistment=Participation des connexions lazy \u00E0 la transaction :
jdbcPool.lazyConnectionEnlistmentHelp=Faites participer une ressource \u00E0 la transaction uniquement si elle est utilis\u00E9e dans une m\u00E9thode
jdbcPool.lazyConnectionAssociation=Association lazy :
jdbcPool.lazyConnectionAssociationHelp=Les connexions sont associ\u00E9es en mode lazy lorsqu'une op\u00E9ration leur est appliqu\u00E9e
jdbcPool.associationWithThread=Associer \u00E0 un thread :
jdbcPool.associationWithThreadHelp=Lorsque le m\u00EAme thread a besoin d'une connexion, il peut r\u00E9utiliser celle qui lui est d\u00E9j\u00E0 associ\u00E9e
jdbcPool.matchConnections=Faire correspondre les connexions :
jdbcPool.matchConnectionsHelp=Active ou d\u00E9sactive l'association des connexions pour le pool
jdbcPool.maxConnectionUsageCount=Utilisation maximale des connexions :
jdbcPool.maxConnectionUsageCountHelp=Les connexions sont r\u00E9utilis\u00E9es par le pool le nombre de fois sp\u00E9cifi\u00E9 avant d'\u00EAtre ferm\u00E9es. La valeur 0 implique que la fonction n'est pas activ\u00E9e.
jdbcConnectionPool.propertyPageTitle=Modifier les propri\u00E9t\u00E9s d'un pool de connexions JDBC
jdbcConnectionPool.propertyPageTitleHelp=Modifiez les propri\u00E9t\u00E9s d'un pool de connexions JDBC.

resourcesTable.colPoolName=Nom du pool
resourcesTable.colJndiName=Nom JNDI
resourcesTable.colDesc=Description
resourcesTable.colPool=Pool de connexions
resourcesTable.colResType=Type de ressource
resourcesTable.colClassname=Nom de la classe
resourcesTable.colResAdapter=Adaptateur de ressources
resourcesTable.resources=Ressources
resourcesTable.Pools=Pools

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteJR=Les ressources s\u00E9lectionn\u00E9es JDBC vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?
msg.JS.confirmDeleteCP=Les pools de connexions s\u00E9lectionn\u00E9s vont \u00EAtre supprim\u00E9s. Voulez-vous continuer ?

msg.warning.poolCreatedPingFailed=Pool cr\u00E9\u00E9 avec l'avertissement suivant
msg.warning.poolSavedPingFailed=Valeurs enregistr\u00E9es avec l'avertissement suivant
msg.Error.classNameCannotBeEmpty=Vous devez indiquer le nom de classe de la source de donn\u00E9es ou le nom de classe du pilote.
