#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://github.com/payara/Payara/blob/main/LICENSE.txt
# See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at legal/OPEN-SOURCE-LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.jvm.options=cr\u00e9e des options JVM dans la configuration Java ou un \u00e9l\u00e9ment de l'analyseur de performances du fichier domain.xml.
create.jvm.options.jvm_option_name=Le nom de l'option JVM figure \u00e0 gauche du signe \u00e9gal (=). La valeur de l'option JVM figure \u00e0 droite du signe \u00e9gal (=). Le signe deux points (:) d\u00e9limite les diff\u00e9rentes options.
create.jvm.options.usagetext=create-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[--min-jvm=<version>]\n\t[--max-jvm=<version>]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
delete.jvm.options=enl\u00e8ve des options JVM de la configuration Java ou des \u00e9l\u00e9ments de l'analyseur de performances du fichier domain.xml
delete.jvm.options.jvm_option_name=Le nom de l'option JVM figure \u00e0 gauche du signe \u00e9gal (=). La valeur de l'option JVM figure \u00e0 droite du signe \u00e9gal (=). Le signe deux points (:) d\u00e9limite les diff\u00e9rentes options.
delete.jvm.options.usagetext=delete-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
list.jvm.options=cr\u00e9e la liste des options JVM de la configuration Java ou d'un \u00e9l\u00e9ment de l'analyseur de performances du fichier domain.xml.
list.jvm.options.success=La liste des options JVM et des propri\u00e9t\u00e9s Java System configur\u00e9es a \u00e9t\u00e9 cr\u00e9\u00e9e sur la cible indiqu\u00e9e
list.jvm.options.failed=Echec de la cr\u00e9ation de la liste des options JVM sur la cible indiqu\u00e9e pour la raison suivante\u00a0: {0}
create.jvm.options.success=Les options indiqu\u00e9es ont \u00e9t\u00e9 cr\u00e9\u00e9es sur la cible sp\u00e9cifi\u00e9e
delete.jvm.options.success=Les options indiqu\u00e9es ont \u00e9t\u00e9 supprim\u00e9es sur la cible sp\u00e9cifi\u00e9e
delete.jvm.options.failed=Echec de la suppression des options indiqu\u00e9es sur la cible sp\u00e9cifi\u00e9e pour la raison suivante :\nles options en cours de la configuration ont \u00e9t\u00e9 conserv\u00e9es
create.profiler.first=Aucun analyseur de performances n'a \u00e9t\u00e9 configur\u00e9. Cr\u00e9ez-en un d'abord.
created.message={0} options cr\u00e9\u00e9es
no.option.created=Aucune option JVM n'a \u00e9t\u00e9 cr\u00e9\u00e9e (elles \u00e9taient peut-\u00eatre d\u00e9j\u00e0 pr\u00e9sentes)
deleted.message={0} options supprim\u00e9es
no.option.deleted=Aucune option JVM n'a \u00e9t\u00e9 supprim\u00e9e (la configuration n'en contenait peut-\u00eatre aucune)
joe.exists=L''option JVM {0} existe d\u00e9j\u00e0 dans la configuration.
joe.invalid.start=L''option JVM {0} n''est pas valide car elle ne commence pas par "-"
joe.invalid.cmd.syntax=La ligne de commande {0} ne respecte pas la syntaxe.\nEn r\u00e9sum\u00e9, toutes les options doivent \u00eatre pr\u00e9c\u00e9d\u00e9es d''un tiret "-" et \u00eatre s\u00e9par\u00e9es par le signe deux-points ":".\nLe signe deux-points '':'' \u00e0 l''int\u00e9rieur d''une option doit \u00eatre pr\u00e9c\u00e9d\u00e9 du caract\u00e8re d''\u00e9chappement ''\\''.\nPuisque le shell interpr\u00e8te les arguments de commande, n''oubliez pas de les placer entre apostrophes.\n
soft.invalid.xmx=L''option JVM indiqu\u00e9e {0} repr\u00e9sente une portion de m\u00e9moire maximale non valide pour la JVM. V\u00e9rifiez sa validit\u00e9 en ex\u00e9cutant la commande list-jvm-options.
soft.xmx.exists=La taille de portion de m\u00e9moire maximale est d\u00e9j\u00e0 sp\u00e9cifi\u00e9e dans la configuration\u00a0: {0}. Ex\u00e9cutez la commande list-jvm-options pour v\u00e9rifier la configuration Java.
soft.xmx.smaller.than.xms=La taille de portion de m\u00e9moire maximale sp\u00e9cifi\u00e9e ({0}) est inf\u00e9rieure \u00e0 la taille minimale d\u00e9finie dans la configuration ({1}). Il est possible que la Java Virtual Machine (JVM) ne d\u00e9marre pas. V\u00e9rifiez que la taille est valide en ex\u00e9cutant la commande list-jvm-options.
soft.invalid.xms=L''option JVM {0} indiqu\u00e9e repr\u00e9sente une portion de m\u00e9moire initiale non valide pour la Java Virtual Machine (JVM). V\u00e9rifiez sa validit\u00e9 en ex\u00e9cutant la commande list-jvm-options.
soft.xms.exists=La taille de portion de m\u00e9moire initiale est d\u00e9j\u00e0 sp\u00e9cifi\u00e9e dans la configuration\u00a0: {0}. Ex\u00e9cutez la commande list-jvm-options pour v\u00e9rifier la configuration Java.
soft.xms.larger.than.xmx=La taille de portion de m\u00e9moire initiale sp\u00e9cifi\u00e9e ({0}) est sup\u00e9rieure \u00e0 la taille maximale d\u00e9finie dans la configuration ({1}). Il est possible que la Java Virtual Machine (JVM) ne d\u00e9marre pas. V\u00e9rifiez que la taille est valide en ex\u00e9cutant la commande list-jvm-options.
#Generate JVM Report
server.unreachable=Le serveur {0} semble inaccessible. Ceci signifie qu''il est inactif ou qu''une erreur de communication interne est survenue.
td.title=Vidage int\u00e9gral de thread Java {0} {1} {2}
thread.no=Nombre de threads : {0}
daemon.thread.no=Nombre de threads de d\u00e9mon : {0}
peak.thread.no=Valeur de pointe du nombre de threads actifs depuis le d\u00e9marrage de la Java Virtual Machine (JVM) ou la r\u00e9initialisation de la valeur de pointe : {0}
thread.contention.monitoring.supported=Cette Java Virtual Machine (JVM) prend-elle en charge la surveillance des conflits de threads\u00a0? [{0}]
thread.contention.monitoring.enabled=La surveillance des conflits de threads est-elle activ\u00e9e\u00a0? [{0}]. Si la valeur est False, certaines statistiques sur la synchronisation de threads ne sont pas disponibles.
thread.cputime.supported=Cette Java Virtual Machine (JVM) prend-elle en charge la mesure du temps UC des threads\u00a0? [{0}]
thread.cputime.enabled=La mesure du temps UC est-elle activ\u00e9e\u00a0? [{0}]. Si la valeur est False, les temps d''ex\u00e9cution des threads ne sont pas disponibles.
execution.info=Informations sur l'ex\u00e9cution des threads\u00a0:
thread.title=Thread {0} ; ID de thread : {1} ; \u00e9tat du thread : {2}
thread.waiting.on=Attente de verrouillage : {0}
thread.suspended=Suspendu
thread.in.native=Ex\u00e9cution en mode natif
thread.stack.element=\t \u00e0 : {0}
no.deadlock=Aucun interblocage
sync.info=Statistiques de synchronisation des threads\u00a0:
thread.blocked.times=Nombre de fois que ce thread a \u00e9t\u00e9 bloqu\u00e9 (pour acc\u00e9der \u00e0 un moniteur)\u00a0: {0}
thread.blocked.totaltime=Temps total (approximatif) de blocage du thread (\u00e9tat BLOCKED)\u00a0: {0} millisecondes depuis la derni\u00e8re activation de la surveillance des conflits de threads.
thread.total.cpu.time=Temps UC total de ce thread\u00a0: {0} secondes {1} nanosecondes.
thread.cpu.user.time=Temps UC niveau utilisateur de ce thread\u00a0: {0} secondes {1} nanosecondes.
wait.times=Nombre de fois que ce thread a \u00e9t\u00e9 en attente d''une notification (\u00e9tat WAITING ou TIMED_WAITING)\u00a0: {0}
lock.owner.details=Ce thread est bloqu\u00e9 en attente du verrou d\u00e9tenu par le thread nomm\u00e9\u00a0: {0}, ID\u00a0: {1}
monitor.info=Les moniteurs d''objets sont d\u00e9tenus ou demand\u00e9s par ce thread\u00a0: {0}
ownable.sync.info=Des synchroniseurs disponibles (par ex. ReentrantLock et ReentrantReadWriteLock) sont d\u00e9tenus par ce thread\u00a0: {0}
deadlocks.found=Les threads suivants ont \u00e9t\u00e9 interbloqu\u00e9s :
m2hms={0} heures {1} minutes {2} secondes
m2sms={0} secondes {1} millisecondes
uptime=Temps d''activit\u00e9 de la Java Virtual Machine (JVM) : {0}
memory.pool.name=Nom du pool de m\u00e9moire : {0}
memory.usage.init=M\u00e9moire initialement demand\u00e9e par la Java Virtual Machine (JVM) au syst\u00e8me d''exploitation : {0} octets
memory.usage.comm=M\u00e9moire garantie \u00e0 la Java Virtual Machine (JVM) par le syst\u00e8me d''exploitation : {0} octets
memory.usage.max=M\u00e9moire maximale pouvant \u00eatre allou\u00e9e \u00e0 la Java Virtual Machine (JVM) par le syst\u00e8me d''exploitation : {0} octets. Cette quantit\u00e9 n''est pas garantie.
memory.usage.used=M\u00e9moire actuellement utilis\u00e9e par la Java Virtual Machine (JVM) : {0} octets
gc.name=Nom du garbage collector : {0}
gc.numcol=Nombre de collectes lors de l''utilisation de ce garbage collector : {0} octets
gc.coltime=Heure du nettoyage de la m\u00e9moire : {0}
heap.mem.usage=Utilisation de la portion de m\u00e9moire :
nonheap.mem.usage=Utilisation de la m\u00e9moire hors portion de m\u00e9moire :
obj.fin.pending=Nombre approximatif d''objets pour lesquels la finalisation est en attente : {0}
classloading.info=Chargement et d\u00e9chargement de classe dans la Java Virtual Machine (JVM) :
classes.loaded=Nombre de classes actuellement charg\u00e9es dans la Java Virtual Machine (JVM) : {0}
classes.total=Nombre de classes charg\u00e9es dans la Java Virtual Machine (JVM) depuis le d\u00e9marrage : {0}
classes.unloaded=Nombre de classes d\u00e9charg\u00e9es de la Java Virtual Machine (JVM) : {0}
complilation.info=Informations de compilation JIT (juste-\u00e0-temps) dans la Java Virtual Machine (JVM) :
compilation.monitor.status=Surveillance de compilation dans la Java Virtual Machine (JVM) autoris\u00e9 : {0}
jit.compilar.name=Nom du compilateur JIT (juste-\u00e0-temps) : {0}
compilation.time=Dur\u00e9e totale de la compilation : {0}
os.info=Informations du syst\u00e8me d'exploitation :
os.name=Nom du syst\u00e8me d''exploitation : {0}
os.arch=Nom d''architecture binaire du syst\u00e8me d''exploitation : {0}, version : {1}
os.nproc=Nombre de processeurs disponibles sur le syst\u00e8me d''exploitation : {0}
os.load=Charge syst\u00e8me sur les processeurs disponibles au cours de la derni\u00e8re minute\u00a0: {0}. (Somme des entit\u00e9s en cours d''ex\u00e9cution et en file d''attente par minute)
rt.info=Informations g\u00e9n\u00e9rales sur l''environnement JRE (Java Runtime Environment) pour la machine virtuelle\u00a0: {0}
rt.bcp=BootClassPath JRE : {0}
rt.cp=ClassPath JRE : {0}
rt.libpath=Chemin de biblioth\u00e8que native JRE : {0}
rt.nvv=Nom JRE : {0} Fournisseur : {1} Version : {2}
rt.sysprops=Liste des propri\u00e9t\u00e9s syst\u00e8me pour Java Virtual Machine (JVM) :
summary.title=**** R\u00e9capitulatif Java Virtual Machine (JVM) [Nom de l''instance du serveur d''applications : {0}] ****
class.info.title=**** Statistiques de classe pour la Java Virtual Machine (JVM) [Nom de l''instance du serveur d''applications : {0}] ****
thread.dump.title=**** Vidage du thread pour la Java Virtual Machine (JVM) [Nom de l''instance du serveur d''applications : {0}] ****
memory.info.title=**** M\u00e9moire (Perm Gen, Eden Space, etc.) Informations pour la Java Virtual Machine (JVM) [Nom de l''instance du serveur d''applications : {0}] ****
#logging information
logging.config.file=Fichier des propri\u00e9t\u00e9s de journalisation applicable : [{0}]. Si la valeur est NULL : fichier JRE standard.
reg.loggers=Nombre de journaliseurs actuellement inscrits aupr\u00e8s de la Java Virtual Machine (JVM) : [{0}]. D\u00e9tails :
logger.details.1=Si le niveau est vide, il est h\u00e9rit\u00e9 du journaliseur parent
logger.details.2=Le journaliseur parent est le journaliseur parent pr\u00e9sent le plus proche
list.of.loggers=Nom du journaliseur | Niveau de journalisation | Nom du journaliseur parent
create.threadpool.duplicate=Le pool de threads nomm\u00e9 {0} existe d\u00e9j\u00e0.
create.threadpool.failed=Echec lors de la cr\u00e9ation de : {0}. Motif : {1}
create.threadpool.deprecated.workqueues=Syntaxe en phase d'abandon\u00a0: l'option --workqueues est en phase d'abandon pour la commande create-threadpool.
list.thread.pools.failed=Echec de la cr\u00e9ation de la liste de pools de threads. Motif : {0}
delete.threadpool.notexists=Le pool de threads nomm\u00e9 {0} n''existe pas.
delete.threadpool.failed=Echec de la suppression du pool de threads. Motif : {0}
attach.wrong.commandinstance.id=Le travail avec l''ID {0} n''existe pas.
attach.finished=Commande {0} ex\u00e9cut\u00e9e avec le statut {1}.
unable.to.get.ManagedJobConfig=Impossible d'obtenir le bean ManagedJobConfig.
failed.to.configure.ManagedJobConfig=Echec de la configuration du bean ManagedJobConfig

getPayload.wrong.commandinstance.id=Le travail avec l''ID {0} n''existe pas.
getPayload.nopayload=Les donn\u00e9es trait\u00e9es sortantes n'existent pas.
getPayload.unsupported=Le type de donn\u00e9es trait\u00e9es n'est pas pris en charge. Impossible de t\u00e9l\u00e9charger les donn\u00e9es.
