#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.jvm.options=crea opciones de JVM en la configuraci\u00F3n de Java o el elemento del analizador de perfiles del archivo domain.xml.
create.jvm.options.jvm_option_name=La parte izquierda del signo igual (=) es el nombre de la opci\u00F3n de JVM. La parte derecha del signo igual (=) es el valor de la opci\u00F3n de JVM. Los dos puntos (:) son un delimitador para opciones m\u00FAltiples.
create.jvm.options.usagetext=create-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
delete.jvm.options=elimina las opciones de JVM de la configuraci\u00F3n de Java o los elementos del analizador de perfiles del archivo domain.xml
delete.jvm.options.jvm_option_name=La parte izquierda del signo igual (=) es el nombre de la opci\u00F3n de JVM. La parte derecha del signo igual (=) es el valor de la opci\u00F3n de JVM. Los dos puntos (:) son un delimitador para opciones m\u00FAltiples.
delete.jvm.options.usagetext=delete-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
list.jvm.options=enumera las opciones de JVM en la configuraci\u00F3n de Java o el elemento del analizador de perfiles del archivo domain.xml
list.jvm.options.success=Enumeraci\u00F3n correcta de las opciones de JVM configuradas y de las propiedades del sistema Java en el destino determinado
list.jvm.options.failed=Fallo al enumerar las opciones de JVM en el destino determinado por los motivos siguientes: {0}
create.jvm.options.success=Creaci\u00F3n correcta de las opciones determinadas en el destino indicado
delete.jvm.options.success=Supresi\u00F3n correcta de las opciones determinadas en el destino indicado
delete.jvm.options.failed=Fallo al suprimir las opciones especificadas en el destino indicado por el siguiente motivo:\nse han mantenido las opciones actuales en la configuraci\u00F3n
create.profiler.first=No hay ning\u00FAn analizador de perfiles configurado. Debe crear uno para continuar.
created.message=Se han creado {0} opciones
no.option.created=No se han creado opciones de JVM (puede que ya existieran anteriormente)
deleted.message=Se han suprimido {0} opciones
no.option.deleted=No se ha suprimido ninguna opci\u00F3n de JVM (puede que no existiera ninguna en la configuraci\u00F3n)
joe.exists=La opci\u00F3n de JVM {0} ya existe en la configuraci\u00F3n.
joe.invalid.start=La opci\u00F3n de JVM {0} no es v\u00E1lida porque no empieza por ''-''.
joe.invalid.cmd.syntax=La l\u00EDnea de comandos: {0} no presenta una sintaxis correcta.\nEn pocas palabras, todas las opciones deben empezar por ''-'' y las opciones m\u00FAltiples se separan con '':''.\nEl signo '':'' dentro de una opci\u00F3n debe presentar los caracteres de escape ''\\''.\nDado que el shell interpreta los argumentos de los comandos, aseg\u00FArese de ponerlos entre comillas.\n
soft.invalid.xmx=Parece que la opci\u00F3n de JVM {0} indicada representa un valor no v\u00E1lido de pila m\u00E1ximo para JVM. Aseg\u00FArese de que es v\u00E1lido mediante list-jvm-options.
soft.xmx.exists=La configuraci\u00F3n ya tiene el tama\u00F1o m\u00E1ximo de pila especificado: {0}. Verifique la configuraci\u00F3n de java mediante list-jvm-options.
soft.xmx.smaller.than.xms=Parece que el tama\u00F1o m\u00E1ximo de pila especificado: {0} es menor que el tama\u00F1o m\u00EDnimo de pila en la configuraci\u00F3n: {1}. Puede que JVM no se inicie. Aseg\u00FArese de que esto es v\u00E1lido mediante list-jvm-options.
soft.invalid.xms=Parece que la opci\u00F3n de JVM {0} indicada representa un valor no v\u00E1lido de pila para JVM. Aseg\u00FArese de que es v\u00E1lido mediante list-jvm-options.
soft.xms.exists=La configuraci\u00F3n ya tiene el tama\u00F1o inicial de pila especificado: {0}. Verifique la configuraci\u00F3n de java mediante list-jvm-options.
soft.xms.larger.than.xmx=Parece que el tama\u00F1o inicial de pila especificado: {0} es mayor que el tama\u00F1o m\u00E1ximo de pila en la configuraci\u00F3n: {1}. Puede que JVM no se inicie. Aseg\u00FArese de que esto es v\u00E1lido mediante list-jvm-options.
#Generate JVM Report
server.unreachable=Parece que no se puede acceder al servidor {0}. Esto significa que no se est\u00E1 ejecutando o que se ha producido un error interno de comunicaci\u00F3n.
td.title=Volcado de Thread Completo de Java {0} {1} {2}
thread.no=N\u00FAmero de threads: {0}
daemon.thread.no=N\u00FAmero de theads de daemon: {0}
peak.thread.no=Recuento de threads de mantenimiento de n\u00FAmero m\u00E1ximo desde que la Java Virtual Machine se ha iniciado o desde que se ha restablecido el m\u00E1ximo: {0}
thread.contention.monitoring.supported=\u00BFEst\u00E1 disponible el soporte de supervisi\u00F3n de contenci\u00F3n de threads de esta JVM? [{0}]
thread.contention.monitoring.enabled=\u00BFEst\u00E1 activada la supervisi\u00F3n de contenci\u00F3n de threads? [{0}]. Si es false, algunas estad\u00EDsticas de sincronizaci\u00F3n de threads no estar\u00E1n disponibles.
thread.cputime.supported=\u00BFExiste soporte para la medida de tiempo de la CPU para cualquier thread disponible en esta JVM? [{0}]
thread.cputime.enabled=\u00BFEst\u00E1 activada la medida de tiempo de CPU de los threads? [{0}]. Si es false, los tiempos de ejecuci\u00F3n de threads no est\u00E1n disponibles para ning\u00FAn thread.
execution.info=Informaci\u00F3n sobre la Ejecuci\u00F3n de Threads:
thread.title=Thread {0} ID de thread: {1} Estado del thread: {2}
thread.waiting.on=Esperando bloqueo: {0}
thread.suspended=Suspendido
thread.in.native=Ejecut\u00E1ndose en nativo
thread.stack.element=\t en: {0}
no.deadlock=No se ha encontrado ning\u00FAn interbloqueo
sync.info=Estad\u00EDsticas de Sincronizaci\u00F3n de Threads:
thread.blocked.times=N\u00FAmero de veces que este thread se ha bloqueado (para introducir/volver a introducir un monitor): {0}
thread.blocked.totaltime=Tiempo total (aproximado) que el thread se encuentra en estado BLOQUEADO: {0} milisegundos desde que se activ\u00F3 la supervisi\u00F3n de contenci\u00F3n de threads por \u00FAltima vez.
thread.total.cpu.time=Tiempo total de la CPU para este thread: {0} segundos {1} nanosegundos.
thread.cpu.user.time=Tiempo de la CPU a nivel de usuario para este thread: {0} segundos {1} nanosegundos.
wait.times=N\u00FAmero de veces que este thread ha esperado la notificaci\u00F3n (es decir, que se encontraba en estado de ESPERA o de ESPERA_LIMITADA): {0}
lock.owner.details=Este thread est\u00E1 actualmente bloqueado esperando bloqueo por el thread denominado: {0}, id: {1}
monitor.info=Monitores de objetos mantenidos o solicitados actualmente por este thread: {0}
ownable.sync.info=Sincronizadores que permiten propiedad (como ReentrantLock y ReentrantReadWriteLock) que mantiene este thread: {0}
deadlocks.found=Se ha realizado un interbloqueo en los siguientes threads:
m2hms={0} Horas {1} Minutos {2} Segundos
m2sms={0} Segundos {1} Milisegundos
uptime=Tiempo de actividad de Java Virtual Machine: {0}
memory.pool.name=Nombre de Pool de Memoria: {0}
memory.usage.init=Cantidad de memoria que Java Virtual Machine ha solicitado inicialmente al sistema operativo: {0} bytes
memory.usage.comm=Cantidad de memoria que Java Virtual Machine recibir\u00E1 con seguridad del sistema operativo: {0} bytes
memory.usage.max=Cantidad de memoria que Java Virtual Machine es posible que obtenga del sistema operativo: {0} bytes. Tenga en cuenta que no se ha garantizado dicha cantidad.
memory.usage.used=Cantidad de memoria que Java Virtual Machine est\u00E1 utilizando en este momento: {0} bytes
gc.name=Nombre de Recolector de Basura: {0}
gc.numcol=N\u00FAmero de recolecciones realizadas mediante este recolector de basura: {0} Bytes
gc.coltime=Hora de Recolecci\u00F3n de Basura: {0}
heap.mem.usage=Uso de la Memoria de Pila:
nonheap.mem.usage=Uso de Memoria que No Es de Pila:
obj.fin.pending=N\u00FAmero aproximado de objetos para los que est\u00E1 pendiente la finalizaci\u00F3n: {0}
classloading.info=Clase que se est\u00E1 cargando y descargando en Java Virtual Machine:
classes.loaded=N\u00FAmero de clases cargadas actualmente en Java Virtual Machine: {0}
classes.total=N\u00FAmero de clases cargadas en Java Virtual Machine desde el inicio: {0}
classes.unloaded=N\u00FAmero de clases descargadas de Java Virtual Machine: {0}
complilation.info=Informaci\u00F3n de compilaci\u00F3n justo a tiempo (JIT) de Java Virtual Machine:
compilation.monitor.status=Supervisi\u00F3n de la compilaci\u00F3n de Java Virtual Machine permitida: {0}
jit.compilar.name=Nombre del compilador justo a tiempo (JIT): {0}
compilation.time=Tiempo total dedicado a la compilaci\u00F3n: {0}
os.info=Informaci\u00F3n de Sistema Operativo:
os.name=Nombre de Sistema Operativo: {0}
os.arch=Nombre de Arquitectura Binaria del Sistema Operativo: {0}, Versi\u00F3n: {1}
os.nproc=N\u00FAmero de procesadores disponibles en el sistema operativo: {0}
os.load=Carga del sistema en los procesadores disponibles para el \u00FAltimo minuto: {0}. (Suma de las entidades en ejecuci\u00F3n y ejecutables en cola por minuto)
rt.info=Informaci\u00F3n General de Java Runtime Environment para VM: {0}
rt.bcp=BootClassPath de JRE: {0}
rt.cp=ClassPath de JRE: {0}
rt.libpath=Ruta de Acceso de Biblioteca Nativa de JRE: {0}
rt.nvv=Nombre de JRE: {0} Proveedor: {1} Versi\u00F3n: {2}
rt.sysprops=Lista de Propiedades del Sistema de Java Virtual Machine:
summary.title=**** Resumen de Java Virtual Machine [App Server Instance Name: {0}] ****
class.info.title=**** Datos estad\u00EDsticos de clase para Java Virtual Machine [App Server Instance Name: {0}] ****
thread.dump.title=**** Volcado de threads para Java Virtual Machine [App Server Instance Name: {0}] ****
memory.info.title=**** Informaci\u00F3n de memoria (Perm Gen, Eden Space, etc.) para Java Virtual Machine [App Server Instance Name: {0}] ****
#logging information
logging.config.file=Archivo de propiedades de registro efectivo:[{0}]. Si es nulo, indica el archivo est\u00E1ndar JRE.
reg.loggers=N\u00FAmero de registradores registrados actualmente en la JVM: [{0}]. A continuaci\u00F3n se muestran los detalles:
logger.details.1=Si el nivel est\u00E1 en blanco, se hereda de un registrador principal
logger.details.2=El registrador principal es el registrador principal existente m\u00E1s pr\u00F3ximo
list.of.loggers=Nombre de Registrador | Nivel de Registro | Nombre de Registrador Principal
create.threadpool.duplicate=Ya existe el pool de threads denominado {0}.
create.threadpool.failed=Fallo al crear: {0} debido a: {1}
create.threadpool.deprecated.workqueues=Sintaxis anticuada: la opci\u00F3n --workqueues est\u00E1 anticuada para el comando create-threadpool.
list.thread.pools.failed=Fallo al enumerar los pools de threads debido a: {0}
delete.threadpool.notexists=No existe el pool de threads denominado {0}.
delete.threadpool.failed=Fallo al suprimir el pool de threads debido a: {0}
attach.wrong.commandinstance.id=No existe el trabajo con el ID {0}.
attach.finished=El comando {0} se ha ejecutado con el estado {1}.
unable.to.get.ManagedJobConfig=No se ha podido obtener el bean ManagedJobConfig.
failed.to.configure.ManagedJobConfig=Fallo al configurar el bean ManagedJobConfig

getPayload.wrong.commandinstance.id=No existe el trabajo con el ID {0}.
getPayload.nopayload=La carga \u00FAtil saliente no existe.
getPayload.unsupported=No est\u00E1 soportado el tipo de carga \u00FAtil. No se pueden descargar los datos.
