#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

create.jvm.options=crea opzioni JVM nella configurazione Java o nell'elemento profiler del file domain.xml.
create.jvm.options.jvm_option_name=L'elemento a sinistra del segno di uguale (=) \u00E8 il nome dell'opzione JVM. L'elemento a destra del segno di uguale (=) \u00E8 il valore dell'opzione JVM. Il carattere di due punti (:) rappresenta il delimitatore tra pi\u00F9 opzioni.
create.jvm.options.usagetext=create-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
delete.jvm.options=rimuove opzioni JVM dalla configurazione Java o dagli elementi profiler del file domain.xml
delete.jvm.options.jvm_option_name=L'elemento a sinistra del segno di uguale (=) \u00E8 il nome dell'opzione JVM. L'elemento a destra del segno di uguale (=) \u00E8 il valore dell'opzione JVM. Il carattere di due punti (:) rappresenta il delimitatore tra pi\u00F9 opzioni.
delete.jvm.options.usagetext=delete-jvm-options\n\t[--target <target(default:server)>]\n\t[--profiler[=<profiler(default:false)>]]\n\t[-?|--help[=<help(default:false)>]]\n\t(jvm_option_name[=jvm_option_value])[:jvm_option_name[=jvm_option_name]]*
list.jvm.options=elenca opzioni JVM nella configurazione Java o nell'elemento profiler del file domain.xml.
list.jvm.options.success=Creazione della lista delle opzioni JVM e delle propriet\u00E0 di sistema Java nella destinazione specificata riuscita
list.jvm.options.failed=Creazione della lista delle opzioni JVM non riuscita nella destinazione specificata. Motivo: {0}
create.jvm.options.success=Creazione dell'opzione o delle opzioni specificate nella destinazione specificata riuscita
delete.jvm.options.success=Eliminazione dell'opzione o delle opzioni specificate nella destinazione specificata riuscita
delete.jvm.options.failed=Eliminazione dell'opzione o delle opzioni specificate nella destinazione specificata non riuscita per il motivo indicato di seguito.\nLe opzioni correnti nella configurazione sono state mantenute.
create.profiler.first=Nessun profiler configurato. Creare prima un profiler.
created.message=Creata/e {0} opzione/i
no.option.created=Nessuna opzione JVM creata. Potrebbero essere gi\u00E0 presenti.
deleted.message=Eliminata/e {0} opzione/i
no.option.deleted=Nessuna opzione JVM eliminata. Potrebbero non esistere nella configurazione.
joe.exists=Opzione JVM {0} gi\u00E0 esistente nella configurazione.
joe.invalid.start=L''opzione JVM {0} non \u00E8 valida perch\u00E9 non inizia con ''-''
joe.invalid.cmd.syntax=La riga di comando {0} non soddisfa la sintassi.\nTutte le opzioni devono iniziare con ''-'' e pi\u00F9 opzioni devono essere separate da '':''.\nAi caratteri '':'' all''interno delle opzioni deve essere fatto precedere il carattere di escape ''\\''.\nPoich\u00E9 la shell interpreta gli argomenti dei comandi, accertarsi di racchiudere il comando tra apici.\n
soft.invalid.xmx=L''opzione {0} rappresenta un heap massimo non valido per JVM. Verificare la validit\u00E0, eseguendo list-jvm-options.
soft.xmx.exists=Nella configurazione \u00E8 gi\u00E0 specificata la dimensione di heap massima: {0}. Verificare la configurazione Java eseguendo list-jvm-options.
soft.xmx.smaller.than.xms=La dimensione di heap massima {0} specificata \u00E8 inferiore alla dimensione di heap minima nella configurazione: {1} JVM potrebbe non avviarsi. Verificare la validit\u00E0 eseguendo list-jvm-options.
soft.invalid.xms=L''opzione JVM {0} rappresenta un heap iniziale non valido per JVM. Verificare la validit\u00E0, eseguendo list-jvm-options.
soft.xms.exists=Nella configurazione \u00E8 gi\u00E0 specificata la dimensione di heap iniziale: {0}. Verificare la configurazione Java eseguendo list-jvm-options.
soft.xms.larger.than.xmx=La dimensione di heap iniziale {0} specificata \u00E8 maggiore della dimensione di heap massima nella configurazione: {1}. JVM potrebbe non avviarsi. Verificare la validit\u00E0 eseguendo list-jvm-options.
#Generate JVM Report
server.unreachable=Server {0} non raggiungibile. Ci\u00F2 significa che non \u00E8 in esecuzione o che si \u00E8 verificato un errore di comunicazione interno.
td.title=Dump thread Java completo {0} {1} {2}
thread.no=Numero di thread: {0}
daemon.thread.no=Numero di thread daemon: {0}
peak.thread.no=Conteggio di thread attivi di picco dall''avvio della Java Virtual Machine oppure da quando il picco \u00E8 stato reimpostato: {0}
thread.contention.monitoring.supported=Il supporto del monitoraggio dei conflitti di utilizzo dei thread \u00E8 disponibile nella JVM? [{0}]
thread.contention.monitoring.enabled=Il monitoraggio dei conflitti di utilizzo dei thread \u00E8 abilitato? [{0}]. Se false, alcune statistiche di sincronizzazione dei thread non sono disponibili.
thread.cputime.supported=Il supporto per la misurazione del tempo di CPU relativo ai thread \u00E8 disponibile nella JVM? [{0}]
thread.cputime.enabled=La misurazione del tempo di CPU dei thread \u00E8 abilitata? [{0}]. Se false, i tempi di esecuzione dei thread non sono disponibili.
execution.info=Informazioni sull'esecuzione dei thread:
thread.title=Thread: {0}, ID thread: {1}, stato thread: {2}
thread.waiting.on=Attesa lock: {0}
thread.suspended=Sospeso
thread.in.native=Esecuzione in modalit\u00E0 nativa
thread.stack.element=\t in: {0}
no.deadlock=Nessun deadlock trovato
sync.info=Statistiche di sincronizzazione dei thread:
thread.blocked.times=Numero di volte in cui il thread \u00E8 stato bloccato (ingresso/nuovo ingresso in un monitor): {0}
thread.blocked.totaltime=Tempo totale (approssimativo) durante il quale il thread \u00E8 rimasto in stato BLOCKED: {0} millisecondi dall''ultima volta in cui \u00E8 stato abilitato il monitoraggio dei conflitti di utilizzo dei thread.
thread.total.cpu.time=Tempo totale CPU per il thread: {0} secondi e {1} nanosecondi.
thread.cpu.user.time=Tempo CPU a livello utente per il thread: {0} secondi e {1} nanosecondi.
wait.times=Numero di volte in cui il thread \u00E8 stato in attesa di una notifica, ovvero \u00E8 rimasto in stato WAITING o TIMED_WAITING): {0}
lock.owner.details=Thread bloccato in attesa del lock attualmente di propriet\u00E0 del thread: {0}, ID: {1}
monitor.info=Monitor oggetti attualmente mantenuti o richiesti dal thread: {0}
ownable.sync.info=Sincronizzatori che possono essere di propriet\u00E0 (ad esempio ReentrantLock e ReentrantReadWriteLock) mantenuti dal thread: {0}
deadlocks.found=Deadlock nei thread seguenti:
m2hms={0} ore {1} minuti {2} secondi
m2sms={0} secondi {1} millisecondi
uptime=Tempo di attivit\u00E0 della Java Virtual Machine: {0}
memory.pool.name=Nome pool di memoria: {0}
memory.usage.init=Memoria richiesta inizialmente dalla Java Virtual Machine al sistema operativo: {0} byte
memory.usage.comm=Memoria che il sistema operativo garantisce di fornire alla Java Virtual Machine: {0} byte
memory.usage.max=Memoria massima che il sistema operativo potrebbe potenzialmente fornire alla Java Virtual Machine: {0} byte. Si noti che questa non costituisce una garanzia.
memory.usage.used=Memoria utilizzata in questo momento dalla Java Virtual Machine: {0} byte
gc.name=Nome del Garbage Collector: {0}
gc.numcol=Numero di raccolte verificatesi mediante questo Garbage Collector: {0} byte
gc.coltime=Tempo garbage collection: {0}
heap.mem.usage=Uso della memoria heap:
nonheap.mem.usage=Uso della memoria non heap:
obj.fin.pending=Numero approssimativo di oggetti per i quali la finalizzazione \u00E8 in sospeso: {0}
classloading.info=Caricamento e scaricamento classi nella Java Virtual Machine:
classes.loaded=Numero di classi attualmente caricate nella Java Virtual Machine: {0}
classes.total=Numero di classi caricate nella Java Virtual Machine dall''avvio: {0}
classes.unloaded=Numero di classi scaricate dalla Java Virtual Machine: {0}
complilation.info=Informazioni di compilazione JIT (Just-In-Time) nella Java Virtual Machine:
compilation.monitor.status=Monitoraggio compilazione della Java Virtual Machine consentito: {0}
jit.compilar.name=Nome compilatore JIT (Just-In-Time): {0}
compilation.time=Tempo totale impiegato per la compilazione: {0}
os.info=Informazioni sul sistema operativo:
os.name=Nome del sistema operativo: {0}
os.arch=Nome architettura binaria del sistema operativo: {0}, versione {1}
os.nproc=Numero di processori disponibili nel sistema operativo: {0}
os.load=Carico di sistema dei processori disponibili nell''ultimo minuto: {0} (somma delle entit\u00E0 in esecuzione ed eseguibili in coda al minuto).
rt.info=Informazioni generali su Java Runtime Environment per la virtual machine: {0}
rt.bcp=BootClassPath JRE: {0}
rt.cp=ClassPath JRE: {0}
rt.libpath=Percorso libreria nativa JRE: {0}
rt.nvv=Nome JRE: {0}, fornitore: {1}, versione: {2}
rt.sysprops=Lista delle propriet\u00E0 di sistema per la Java Virtual Machine:
summary.title=**** Java Virtual Machine [nome istanza application server: {0}] - Riepilogo****
class.info.title=**** Statistiche di classe per la Java Virtual Machine [nome istanza application server: {0}] ****
thread.dump.title=**** Dump dei thread per la Java Virtual Machine [nome istanza application server: {0}] ****
memory.info.title=**** Informazioni sulla memoria (Perm Gen, Eden Space e cos\u00EC via) per la Java Virtual Machine [nome istanza application server: {0}] ****
#logging information
logging.config.file=File delle propriet\u00E0 di log in effetto: [{0}]. Se null, indica il file standard JRE.
reg.loggers=Numero di logger attualmente registrati nella JVM: [{0}]. Dettagli:
logger.details.1=Se il livello \u00E8 vuoto, viene ereditato dal logger padre
logger.details.2=Il logger padre \u00E8 quello pi\u00F9 vicino
list.of.loggers=Nome logger | Livello di log | Nome logger padre
create.threadpool.duplicate=Il pool di thread denominato {0} esiste gi\u00E0.
create.threadpool.failed=Creazione di {0} non riuscita a causa di {1}
create.threadpool.deprecated.workqueues=Sintassi deprecata: l'opzione --workqueues \u00E8 deprecata per il comando create-threadpool.
list.thread.pools.failed=Lista di pool di thread non riuscita a causa di: {0}
delete.threadpool.notexists=Il pool di thread denominato {0} non esiste.
delete.threadpool.failed=Eliminazione del pool di thread non riuscita a causa di: {0}
attach.wrong.commandinstance.id=Il job con ID {0} non esiste.
attach.finished=Comando {0} eseguito con stato {1}.
unable.to.get.ManagedJobConfig=Impossibile ottenere il bean ManagedJobConfig.
failed.to.configure.ManagedJobConfig=Configurazione del bean ManagedJobConfig non riuscita

getPayload.wrong.commandinstance.id=Il job con ID {0} non esiste.
getPayload.nopayload=Il payload in uscita non esiste.
getPayload.unsupported=Il tipo di payload non \u00E8 supportato. Impossibile scaricare i dati.
