#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

# To change this template, choose Tools | Templates
# and open the template in the editor.


## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmLogout=\u767B\u51FA GlassFish \u7BA1\u7406\u4E3B\u63A7\u53F0\uFF1F

productName=GlassFish Server Open Source Edition
promotionLink=java.sun.com/glassfish/productmsg.html

copyright.fullPage=\u7248\u6B0A\u6240\u6709 (c) 2005\uFF0C2013\uFF0COracle \u548C (\u6216) \u5176\u95DC\u4FC2\u516C\u53F8\u3002\u4FDD\u7559\u4E00\u5207\u6B0A\u5229\u3002<br><br>Oracle \u548C Java \u662F Oracle \u548C (\u6216) \u5176\u95DC\u4FC2\u516C\u53F8\u7684\u8A3B\u518A\u5546\u6A19\u3002\u5176\u4ED6\u540D\u7A31\u70BA\u5404\u5546\u6A19\u6301\u6709\u4EBA\u6240\u64C1\u6709\u4E4B\u5546\u6A19\u3002<br><br>Intel \u548C Intel Xeon \u662F Intel Corporation \u7684\u5546\u6A19\u6216\u8A3B\u518A\u5546\u6A19\u3002\u6240\u6709 SPARC \u5546\u6A19\u7684\u4F7F\u7528\u7686\u7D93\u904E\u6388\u6B0A\uFF0C\u4E14\u662F SPARC International, Inc. \u7684\u5546\u6A19\u6216\u8A3B\u518A\u5546\u6A19\u3002AMD\u3001Opteron\u3001AMD \u6A19\u8A8C\u8207 AMD Opteron \u6A19\u8A8C\u662F Advanced Micro Devices \u7684\u5546\u6A19\u6216\u8A3B\u518A\u5546\u6A19\u3002UNIX \u662F The Open Group \u7684\u8A3B\u518A\u5546\u6A19\u3002<br><br>\u672C\u8EDF\u9AD4\u8207\u76F8\u95DC\u8AAA\u660E\u6587\u4EF6\u662F\u4F9D\u64DA\u542B\u6709\u7528\u9014\u53CA\u4FDD\u5BC6\u9650\u5236\u4E8B\u9805\u7684\u6388\u6B0A\u5408\u7D04\u6240\u63D0\u4F9B\uFF0C\u4E14\u53D7\u667A\u6167\u8CA1\u7522\u6CD5\u7684\u4FDD\u8B77\u3002\u9664\u4E86\u6388\u6B0A\u5408\u7D04\u4E2D\u6216\u6CD5\u5F8B\u660E\u6587\u5141\u8A31\u7684\u90E8\u4EFD\u5916\uFF0C\u4E0D\u5F97\u4EE5\u4EFB\u4F55\u5F62\u5F0F\u6216\u65B9\u6CD5\u4F7F\u7528\u3001\u8907\u88FD\u3001\u91CD\u88FD\u3001\u7FFB\u8B6F\u3001\u5EE3\u64AD\u3001\u4FEE\u6539\u3001\u6388\u6B0A\u3001\u50B3\u9001\u3001\u6563\u4F48\u3001\u5C55\u793A\u3001\u6F14\u51FA\u3001\u51FA\u7248\u6216\u9673\u5217\u672C\u8EDF\u9AD4\u7684\u4EFB\u4F55\u90E8\u4EFD\u3002\u9664\u975E\u4F9D\u6CD5\u9700\u8981\u53D6\u5F97\u4E92\u901A\u6027\u64CD\u4F5C (interoperability)\uFF0C\u5426\u5247\u56B4\u7981\u5C0D\u672C\u8EDF\u9AD4\u9032\u884C\u9084\u539F\u5DE5\u7A0B (reverse engineering)\u3001\u53CD\u5411\u7D44\u8B6F (disassembly) \u6216\u89E3\u7DE8 (decompilation)\u3002<br><br>\u672C\u6587\u4EF6\u4E2D\u7684\u8CC7\u8A0A\u5982\u6709\u8B8A\u66F4\u6055\u4E0D\u53E6\u884C\u901A\u77E5\uFF0C\u4E14\u4E0D\u4FDD\u8B49\u6C92\u6709\u4EFB\u4F55\u932F\u8AA4\u3002\u5982\u679C\u60A8\u767C\u73FE\u4EFB\u4F55\u554F\u984C\uFF0C\u8ACB\u4F86\u51FD\u544A\u77E5\u3002<br><br>\u5982\u679C\u672C\u8EDF\u9AD4\u6216\u76F8\u95DC\u8EDF\u9AD4\u8AAA\u660E\u6587\u4EF6\u662F\u63D0\u4F9B\u7D66\u7F8E\u570B\u653F\u5E9C\u6216\u4EE3\u8868\u7F8E\u570B\u653F\u5E9C\u6388\u6B0A\u4F7F\u7528\u672C\u8EDF\u9AD4\u8005\uFF0C\u9069\u7528\u4E0B\u5217\u689D\u4F8B\uFF1A<br>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are \u201Ccommercial computer software\u201D pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs.  No other rights are granted to the U.S. Government.<br><br>\u672C\u8EDF\u9AD4\u6216\u786C\u9AD4\u662F\u91DD\u5C0D\u5404\u985E\u8CC7\u8A0A\u7BA1\u7406\u61C9\u7528\u7A0B\u5F0F\u7684\u4E00\u822C\u4F7F\u7528\u6240\u958B\u767C\u3002\u4E0D\u9069\u7528\u4EFB\u4F55\u539F\u672C\u5C31\u5177\u5371\u96AA\u6027\u7684\u61C9\u7528\u4E0A\uFF0C\u5305\u542B\u6703\u9020\u6210\u4EBA\u8EAB\u50B7\u5BB3\u98A8\u96AA\u7684\u61C9\u7528\u3002\u5982\u679C\u60A8\u5C07\u672C\u8EDF\u9AD4\u6216\u786C\u9AD4\u61C9\u7528\u65BC\u5371\u96AA\u7528\u9014\uFF0C\u5247\u61C9\u63A1\u53D6\u9069\u7576\u7684\u9632\u7BC4\u63AA\u65BD\uFF0C\u5305\u62EC\u4FDD\u5168\u3001\u5099\u4EFD\u3001\u5132\u5099\u548C\u5176\u4ED6\u63AA\u65BD\u4EE5\u78BA\u4FDD\u4F7F\u7528\u5B89\u5168\u3002Oracle Corporation \
\u548C\u5176\u95DC\u4FC2\u516C\u53F8\u8072\u660E\u5C0D\u5C07\u672C\u8EDF\u9AD4\u6216\u786C\u9AD4\u61C9\u7528\u65BC\u5371\u96AA\u7528\u9014\u6240\u9020\u6210\u4E4B\u640D\u5BB3\u6982\u4E0D\u8CA0\u4EFB\u4F55\u8CAC\u4EFB\u3002<br><br>\u672C\u8EDF\u9AD4\u6216\u786C\u9AD4\u8207\u8AAA\u660E\u6587\u4EF6\u53EF\u80FD\u63D0\u4F9B\u7B2C\u4E09\u65B9\u5167\u5BB9\u3001\u7522\u54C1\u548C\u670D\u52D9\u7684\u5B58\u53D6\u9014\u5F91\u8207\u8CC7\u8A0A\u3002Oracle Corporation \u548C\u5176\u95DC\u4FC2\u516C\u53F8\u660E\u6587\u8072\u660E\u5C0D\u7B2C\u4E09\u65B9\u6240\u63D0\u4F9B\u7684\u5167\u5BB9\u3001\u7522\u54C1\u8207\u670D\u52D9\u4E0D\u505A\u4FDD\u8B49\uFF0C\u4E14\u4E0D\u8CA0\u4EFB\u4F55\u8CAC\u4EFB\u3002Oracle Corporation \u548C\u5176\u95DC\u4FC2\u516C\u53F8\u5C0D\u65BC\u60A8\u5B58\u53D6\u6216\u4F7F\u7528\u7B2C\u4E09\u65B9\u7684\u5167\u5BB9\u3001\u7522\u54C1\u6216\u670D\u52D9\u6240\u5F15\u8D77\u7684\u4EFB\u4F55\u640D\u5931\u3001\u8CBB\u7528\u6216\u640D\u5BB3\u4EA6\u4E0D\u8CA0\u4EFB\u4F55\u8CAC\u4EFB\u3002
