#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

# To change this template, choose Tools | Templates
# and open the template in the editor.


## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmLogout=Se d\u00E9connecter de la console d\u2019administration GlassFish ?

productName=GlassFish Server Open Source Edition
promotionLink=java.sun.com/glassfish/productmsg.html

copyright.fullPage=Copyright \u00A9 2005,2013, Oracle et/ou ses affili\u00E9s. Tous droits r\u00E9serv\u00E9s.  <br><br>Oracle et Java sont des marques d\u00E9pos\u00E9es d'Oracle Corporation et/ou de ses affili\u00E9s. Tout autre nom mentionn\u00E9 peut correspondre \u00E0 des marques appartenant \u00E0 d'autres propri\u00E9taires qu'Oracle.  <br><br>Intel et Intel Xeon sont des marques ou des marques d\u00E9pos\u00E9es d'Intel Corporation. Toutes les marques SPARC sont utilis\u00E9es sous licence et sont des marques ou des marques d\u00E9pos\u00E9es de SPARC International, Inc. AMD, Opteron, le logo AMD et le logo AMD Opteron sont des marques ou des marques d\u00E9pos\u00E9es d'Advanced Micro Devices. UNIX est une marque d\u00E9pos\u00E9e de The Open Group. <br><br>Ce logiciel et la documentation qui l'accompagne sont prot\u00E9g\u00E9s par les lois sur la propri\u00E9t\u00E9 intellectuelle. Ils sont conc\u00E9d\u00E9s sous licence et soumis \u00E0 des restrictions d'utilisation et de divulgation. Sauf disposition expresse de votre contrat de licence ou de la loi, vous ne pouvez pas copier, reproduire, traduire, diffuser, modifier, accorder de licence, transmettre, distribuer, exposer, ex\u00E9cuter, publier ou afficher le logiciel, m\u00EAme partiellement, sous quelque forme et par quelque proc\u00E9d\u00E9 que ce soit. Par ailleurs, il est interdit de proc\u00E9der \u00E0 toute ing\u00E9nierie inverse du logiciel, de le d\u00E9sassembler ou de le d\u00E9compiler, except\u00E9 \u00E0 des fins d'interop\u00E9rabilit\u00E9 avec des logiciels tiers ou tel que prescrit par la loi.<br><br>Les informations fournies dans ce document sont susceptibles de modification sans pr\u00E9avis. Par ailleurs, Oracle Corporation ne garantit pas qu'elles soient exemptes d'erreurs et vous invite, le cas \u00E9ch\u00E9ant, \u00E0 lui en faire part par \u00E9crit.  <br><br>Si ce logiciel, ou la documentation qui l'accompagne, est livr\u00E9 sous licence au Gouvernement des Etats-Unis, ou \u00E0 quiconque qui aurait souscrit la licence de ce logiciel ou l'utilise pour le compte du Gouvernement des Etats-Unis, la notice suivante s'applique :  <br>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation delivered to U.S. Government end users are "commercial computer software" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations.  As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to U.S. Government.<br><br>Ce logiciel ou mat\u00E9riel a \u00E9t\u00E9 d\u00E9velopp\u00E9 pour un usage g\u00E9n\u00E9ral dans le cadre d'applications de gestion des informations. Ce logiciel ou mat\u00E9riel n'est pas con\u00E7u ni n'est destin\u00E9 \u00E0 \u00EAtre utilis\u00E9 dans des applications \u00E0 risque, notamment dans des applications pouvant causer un risque de dommages corporels. Si vous utilisez ce logiciel ou mat\u00E9riel dans le cadre d'applications dangereuses, il est de votre responsabilit\u00E9 de prendre toutes les mesures de secours, de sauvegarde, de redondance et autres mesures n\u00E9cessaires \u00E0 son utilisation dans des conditions optimales de s\u00E9curit\u00E9. Oracle Corporation et ses affili\u00E9s d\u00E9clinent toute responsabilit\u00E9 quant aux dommages caus\u00E9s par l'utilisation de ce logiciel ou mat\u00E9riel pour des applications dangereuses. <br><br>Ce logiciel ou mat\u00E9riel et la documentation qui l'accompagne peuvent fournir des informations ou des liens donnant acc\u00E8s \u00E0 des contenus, des produits et des services \u00E9manant de tiers. Oracle Corporation et ses affili\u00E9s d\u00E9clinent toute \
responsabilit\u00E9 ou garantie expresse quant aux contenus, produits ou services \u00E9manant de tiers. En aucun cas, Oracle Corporation et ses affili\u00E9s ne sauraient \u00EAtre tenus pour responsables des pertes subies, des co\u00FBts occasionn\u00E9s ou des dommages caus\u00E9s par l'acc\u00E8s \u00E0 des contenus, produits ou services tiers, ou \u00E0 leur utilisation.
