#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2012 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


# To change this template, choose Tools | Templates
# and open the template in the editor.


#EN productName=GlassFish Server Open Source Edition
productName=GlassFish Server Open Source Edition
#EN msg.JS.confirmLogout=Log Out of GlassFish Administration Console ?
msg.JS.confirmLogout=GlassFish \uad00\ub9ac \ucf58\uc194\uc5d0\uc11c \ub85c\uadf8\uc544\uc6c3\ud558\uc2dc\uaca0\uc2b5\ub2c8\uae4c?
#EN copyright.shortMessage=Copyright \u00a9 2005, 2011, Oracle and/or its affiliates. All rights reserved. Oracle has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual property rights may include one or more of the U.S. patents and one or more additional patents or pending patent applications in the U.S. and in other countries. U.S. Government Rights - Commercial software. Government users are subject to the Oracle standard license agreement and applicable provisions of the FAR and its supplements. Use is subject to license terms. This distribution may include materials developed by third parties. Portions may be derived from Berkeley BSD systems, licensed from U. of CA. Oracle, Java and GlassFish are registered trademarks of Oracle and/or its affiliates.
copyright.shortMessage=Copyright \u00a9 2005, 2011, Oracle and/or its affiliates. All rights reserved. Oracle\uc740 \uc774 \ubb38\uc11c\uc5d0\uc11c \uc124\uba85\ud558\ub294 \uc81c\ud488\uc5d0 \ud3ec\ud568\ub41c \uae30\uc220 \uad00\ub828 \uc9c0\uc801 \uc7ac\uc0b0\uad8c\uc744 \uc18c\uc720\ud569\ub2c8\ub2e4. \ud2b9\ud788, \uc774 \uc9c0\uc801 \uc7ac\uc0b0\uad8c\uc5d0\ub294 \ud558\ub098 \uc774\uc0c1\uc758 \ubbf8\uad6d \ud2b9\ud5c8\uad8c\uc774 \ud3ec\ud568\ub420 \uc218 \uc788\uc73c\uba70 \ubbf8\uad6d \ubc0f \ub2e4\ub978 \uad6d\uac00\uc5d0\uc11c \ud558\ub098 \uc774\uc0c1\uc758 \ucd94\uac00 \ud2b9\ud5c8\uad8c \ub610\ub294 \ucd9c\uc6d0 \uc911\uc778 \ud2b9\ud5c8\uad8c\uc774 \uc81c\ud55c \uc5c6\uc774 \ud3ec\ud568\ub420 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ubbf8\uad6d \uc815\ubd80\uc758 \uad8c\ub9ac - \uc0c1\uc6a9 \uc18c\ud504\ud2b8\uc6e8\uc5b4. \uc815\ubd80 \uc0ac\uc6a9\uc790\ub294 Oracle \ud45c\uc900 \uc0ac\uc6a9\uad8c \uacc4\uc57d\uacfc \ud574\ub2f9 FAR \uaddc\uc815 \ubc0f \ubcf4\ucda9 \uaddc\uc815\uc744 \uc900\uc218\ud574\uc57c \ud569\ub2c8\ub2e4. \uc0ac\uc6a9\uc790\ub294 \uc0ac\uc6a9\uad8c \uc870\ud56d\uc744 \uc900\uc218\ud574\uc57c \ud569\ub2c8\ub2e4. \uc774 \ubc30\ud3ec\uc5d0\ub294 \ud0c0\uc0ac\uc5d0\uc11c \uac1c\ubc1c\ud55c \uc790\ub8cc\uac00 \ud3ec\ud568\ub418\uc5b4 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uce98\ub9ac\ud3ec\ub2c8\uc544 \uc8fc\ub9bd \ub300\ud559\uc73c\ub85c\ubd80\ud130 \uc0ac\uc6a9\uad8c\uc744 \ubc1b\uc740 Berkeley BSD \uc2dc\uc2a4\ud15c\uc5d0\uc11c \ud30c\uc0dd\ub41c \ubd80\ubd84\uc774 \ud3ec\ud568\ub418\uc5b4 \uc788\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4. Oracle, Java \ubc0f GlassFish\ub294 Oracle \ubc0f/\ub610\ub294 \uadf8 \uc790\ud68c\uc0ac\uc758 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4.
#EN copyright.fullPage=<br>Copyright &#169; 2005, 2011, Oracle and/or its affiliates. All rights reserved. <br><br> This software and related documentation are provided under a license agreement containing restrictions on use and disclosure and are protected by intellectual property laws. Except as expressly permitted in your license agreement or allowed by law, you may not use, copy, reproduce, translate, broadcast, modify, license, transmit, distribute, exhibit, perform, publish, or display any part, in any form, or by any means. Reverse engineering, disassembly, or decompilation of this software, unless required by law for interoperability, is prohibited.  The information contained herein is subject to change without notice and is not warranted to be error-free. If you find any errors, please report them to us in writing. <br><br> If this is software or related software documentation that is delivered to the U.S. Government or anyone licensing it on behalf of the U.S. Government, the following notice is applicable:<br><br> U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are \"commercial computer software\" or \"commercial technical data\" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065. <br><br> This software or hardware is developed for general use in a variety of information management applications. It is not developed or intended for use in any inherently dangerous applications, including applications which may create a risk of personal injury. If you use this software or hardware in dangerous applications, then you shall be responsible to take all appropriate fail-safe, backup, redundancy, and other measures to ensure its safe use. Oracle Corporation and its affiliates disclaim any liability for any damages caused by use of this software or hardware in dangerous applications. <br><br> Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners. <br><br> AMD, Opteron, the AMD logo, and the AMD Opteron logo are trademarks or registered trademarks of Advanced Micro Devices. Intel and Intel Xeon are trademarks or registered trademarks of Intel Corporation. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. UNIX is a registered trademark licensed through X/Open Company, Ltd.<br><br> This software or hardware and documentation may provide access to or information on content, products, and services from third parties. Oracle Corporation and its affiliates are not responsible for and expressly disclaim all warranties of any kind with respect to third-party content, products, and services. Oracle Corporation and its affiliates will not be responsible for any loss, costs, or damages incurred due to your access to or use of third-party content, products, or services.
copyright.fullPage=<br>Copyright &#169; 2005, 2011, Oracle and/or its affiliates. All rights reserved. <br><br> \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4\uc640 \uad00\ub828 \ubb38\uc11c\ub294 \uc0ac\uc6a9 \uc81c\ud55c \ubc0f \uae30\ubc00 \uc720\uc9c0 \uaddc\uc815\uc744 \ud3ec\ud568\ud558\ub294 \ub77c\uc774\uc13c\uc2a4 \uacc4\uc57d\uc11c\uc5d0 \uc758\uac70\ud574 \uc81c\uacf5\ub418\uba70, \uc9c0\uc801 \uc7ac\uc0b0\ubc95\uc5d0 \uc758\ud574 \ubcf4\ud638\ub429\ub2c8\ub2e4. \ub77c\uc774\uc13c\uc2a4 \uacc4\uc57d\uc11c \uc0c1\uc5d0 \uba85\uc2dc\uc801\uc73c\ub85c \ud5c8\uc6a9\ub418\uc5b4 \uc788\ub294 \uacbd\uc6b0\ub098 \ubc95\uaddc\uc5d0 \uc758\ud574 \ud5c8\uc6a9\ub41c \uacbd\uc6b0\ub97c \uc81c\uc678\ud558\uace0, \uc5b4\ub5a0\ud55c \ubd80\ubd84\ub3c4 \ubcf5\uc0ac, \uc7ac\uc0dd, \ubc88\uc5ed, \ubc29\uc1a1, \uc218\uc815, \ub77c\uc774\uc13c\uc2a4, \uc804\uc1a1,  \ubc30\ud3ec, \uc9c4\uc5f4, \uc2e4\ud589, \ubc1c\ud589, \ub610\ub294 \uc804\uc2dc\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4\ub97c \ub9ac\ubc84\uc2a4 \uc5d4\uc9c0\ub2c8\uc5b4\ub9c1, \ub514\uc2a4\uc5b4\uc148\ube14\ub9ac \ub610\ub294 \ub514\ucef4\ud30c\uc77c\ud558\ub294 \uac83\uc740 \uc0c1\ud638 \uc6b4\uc6a9\uc5d0 \ub300\ud55c \ubc95\uaddc\uc5d0 \uc758\ud574 \uba85\uc2dc\ub41c \uacbd\uc6b0\ub97c \uc81c\uc678\ud558\uace0\ub294 \uae08\uc9c0\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.  \uc774 \uc548\uc758 \ub0b4\uc6a9\uc740 \uc0ac\uc804 \uacf5\uc9c0 \uc5c6\uc774 \ubcc0\uacbd\ub420 \uc218 \uc788\uc73c\uba70 \uc624\ub958\uac00 \uc874\uc7ac\ud558\uc9c0 \uc54a\uc74c\uc744 \ubcf4\uc99d\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \ub9cc\uc77c \uc624\ub958\ub97c \ubc1c\uacac\ud558\uba74 \uc11c\uba74\uc73c\ub85c \ud1b5\uc9c0\ud574 \uc8fc\uae30 \ubc14\ub78d\ub2c8\ub2e4. <br><br>\ub9cc\uc77c \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4\ub098 \uad00\ub828 \ubb38\uc11c\ub97c \ubbf8\uad6d \uc815\ubd80 \ub610\ub294 \ubbf8\uad6d \uc815\ubd80\ub97c \ub300\uc2e0\ud558\uc5ec \uc0ac\uc6a9\uad8c\uc744 \ubd80\uc5ec\ud55c \uac1c\uc778\uc774\ub098 \ubc95\uc778\uc5d0\uac8c \ubc30\uc1a1\ud558\ub294 \uacbd\uc6b0, \ub2e4\uc74c \uacf5\uc9c0 \uc0ac\ud56d\uc774 \uc801\uc6a9\ub429\ub2c8\ub2e4. <br><br> \ubbf8\uad6d \uc815\ubd80 \uace0\uac1d\uc5d0\uac8c \uc804\ub2ec\ub41c \ubbf8\uad6d \uc815\ubd80 \uad8c\ud55c \ud504\ub85c\uadf8\ub7a8, \uc18c\ud504\ud2b8\uc6e8\uc5b4, \ub370\uc774\ud130\ubca0\uc774\uc2a4, \uad00\ub828 \ubb38\uc11c \ubc0f \uae30\uc220 \ub370\uc774\ud130\ub294 \ud574\ub2f9 \uc5f0\ubc29 \uc815\ubd80 \ucde8\ub4dd \uaddc\uc815 \ubc0f \uc5d0\uc774\uc804\uc2dc\ubcc4 \ubcf4\ucda9 \uaddc\uc815\uc5d0 \ub530\ub978 \"\uc0c1\uc6a9 \ucef4\ud4e8\ud130 \uc18c\ud504\ud2b8\uc6e8\uc5b4\" \ub610\ub294 \"\uc0c1\uc6a9 \uae30\uc220 \ub370\uc774\ud130\"\uc785\ub2c8\ub2e4. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065. <br><br> \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4 \ub610\ub294 \ud558\ub4dc\uc6e8\uc5b4\ub294 \ub2e4\uc591\ud55c \uc815\ubcf4 \uad00\ub9ac \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc758 \uc77c\ubc18\uc801\uc778 \uc0ac\uc6a9\uc744 \ubaa9\uc801\uc73c\ub85c \uac1c\ubc1c\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4 \ud639\uc740 \ud558\ub4dc\uc6e8\uc5b4\ub294 \uac1c\uc778\uc801\uc778 \uc0c1\ud574\ub97c \ucd08\ub798\ud560 \uc218 \uc788\ub294 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \ud3ec\ud568\ud55c \ubcf8\uc9c8\uc801\uc73c\ub85c \uc704\ud5d8\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ubaa9\uc801\uc73c\ub85c \uac1c\ubc1c\ub418\uac70\ub098 \uadf8 \uc6a9\ub3c4\ub85c \uc0ac\uc6a9\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub9cc\uc77c \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4 \ud639\uc740 \ud558\ub4dc\uc6e8\uc5b4\ub97c \uc704\ud5d8\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c \uc0ac\uc6a9\ud560 \uacbd\uc6b0, \ub77c\uc774\uc13c\uc2a4 \uc0ac\uc6a9\uc790\ub294 \ud574\ub2f9 \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc758 \uc548\uc804\ud55c \uc0ac\uc6a9\uc744 \uc704\ud574 \ubaa8\ub4e0 \uc801\uc808\ud55c \ube44\uc0c1-\uc548\uc804, \ubc31\uc5c5, \ub300\ube44 \ubc0f \uae30\ud0c0 \uc870\uce58\ub97c \ubc18\ub4dc\uc2dc \ucde8\ud574\uc57c \ud569\ub2c8\ub2e4. Oracle Corporation\uacfc \uadf8 \uc790\ud68c\uc0ac\ub294 \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4 \ud639\uc740 \ud558\ub4dc\uc6e8\uc5b4\ub97c \uc704\ud5d8\ud55c \uc560\ud50c\ub9ac\ucf00\uc774\uc158\uc5d0\uc11c\uc758 \uc0ac\uc6a9\uc73c\ub85c \uc778\ud574 \ubc1c\uc0dd\ud558\ub294 \uc5b4\ub5a0\ud55c \uc190\ud574\uc5d0 \ub300\ud574\uc11c\ub3c4 \ucc45\uc784\uc9c0\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. <br><br> Oracle \ubc0f Java\ub294 Oracle \ubc0f/\ub610\ub294 \uadf8 \uc790\ud68c\uc0ac\uc758 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4. \uae30\ud0c0\uc758 \uba85\uce6d\ub4e4\uc740 \uac01 \ud574\ub2f9 \uba85\uce6d\uc744 \uc18c\uc720\ud55c \ud68c\uc0ac\uc758 \uc0c1\ud45c\uc77c \uc218 \uc788\uc2b5\ub2c8\ub2e4. <br><br> AMD, Opteron, AMD \ub85c\uace0 \ubc0f AMD Opteron \ub85c\uace0\ub294 Advanced Micro Devices\uc758 \uc0c1\ud45c \ub610\ub294 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4. Intel \ubc0f Intel Xeon Intel Corporation\uc758 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4. \ubaa8\ub4e0 SPARC \uc0c1\ud45c\ub294 \uc0ac\uc6a9 \ud5c8\uac00\ub97c \ubc1b\uc544 \uc0ac\uc6a9\ub418\uba70 SPARC International, Inc.\uc758 \uc0c1\ud45c \ub610\ub294 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4. UNIX\ub294 X/Open Company, Ltd.\ub97c \ud1b5\ud574 \uc0ac\uc6a9\uad8c\uc774 \ubd80\uc5ec\ub418\ub294 \ub4f1\ub85d \uc0c1\ud45c\uc785\ub2c8\ub2e4.<br><br> \ubcf8 \uc18c\ud504\ud2b8\uc6e8\uc5b4 \ub610\ub294 \ud558\ub4dc\uc6e8\uc5b4\uc640 \uad00\ub828 \ubb38\uc11c\ub97c \ud1b5\ud574 \ud0c0\uc0ac\uac00 \uc81c\uacf5\ud558\ub294 \ucee8\ud150\uce20, \uc81c\ud488 \ubc0f \uc11c\ube44\uc2a4\uc5d0 \uc561\uc138\uc2a4\ud560 \uc218 \uc788\uac8c \ud558\uac70\ub098 \uad00\ub828 \uc815\ubcf4\ub97c \uc81c\uacf5\ud569\ub2c8\ub2e4. Oracle Corporation\uacfc \uadf8 \uc790\ud68c\uc0ac\ub294 \uc81c 3\uc790\uc758 \ucee8\ud150\uce20, \uc81c\ud488 \ubc0f \uc11c\ube44\uc2a4\uc640 \uad00\ub828\ud558\uc5ec  \uc5b4\ub5a0\ud55c \ucc45\uc784\ub3c4 \uc9c0\uc9c0 \uc54a\uc73c\uba70 \uba85\uc2dc\uc801\uc73c\ub85c \ubaa8\ub4e0 \ubcf4\uc99d\uc5d0 \ub300\ud574\uc11c\ub3c4 \ucc45\uc784\uc744 \uc9c0\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. Oracle Corporation\uacfc \uadf8 \uc790\ud68c\uc0ac\ub294 \uc81c 3\uc790\uc758 \ucee8\ud150\uce20, \uc81c\ud488 \ubc0f \uc11c\ube44\uc2a4\uc5d0 \uc811\uc18d\ud558\uac70\ub098 \uc0ac\uc6a9\uc73c\ub85c \uc778\ud574 \ucd08\ub798\ub418\ub294 \uc5b4\ub5a0\ud55c \uc190\uc2e4, \ube44\uc6a9 \ub610\ub294 \uc190\ud574\uc5d0 \ub300\ud574 \uc5b4\ub5a0\ud55c \ucc45\uc784\ub3c4 \uc9c0\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
#EN promotionLink=www.sun.com/software/products/appsrvr/promotions/v3.html
promotionLink=www.sun.com/software/products/appsrvr/promotions/v3.html
