#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2012 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


# To change this template, choose Tools | Templates
# and open the template in the editor.


#EN productName=GlassFish Server Open Source Edition
productName=Servidor GlassFish Open Source Edition
#EN msg.JS.confirmLogout=Log Out of GlassFish Administration Console ?
msg.JS.confirmLogout=Efetuar logoff do console de administra\u00e7\u00e3o do GlassFish?
#EN copyright.shortMessage=Copyright \u00a9 2005, 2011, Oracle and/or its affiliates. All rights reserved. Oracle has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual property rights may include one or more of the U.S. patents and one or more additional patents or pending patent applications in the U.S. and in other countries. U.S. Government Rights - Commercial software. Government users are subject to the Oracle standard license agreement and applicable provisions of the FAR and its supplements. Use is subject to license terms. This distribution may include materials developed by third parties. Portions may be derived from Berkeley BSD systems, licensed from U. of CA. Oracle, Java and GlassFish are registered trademarks of Oracle and/or its affiliates.
copyright.shortMessage=Copyright \u00a9 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu\u00e7\u00e3o total ou parcial. A Oracle possui os direitos de propriedade intelectual relacionados \u00e0 tecnologia incorporada ao produto descrito neste documento.  Em particular, e sem limita\u00e7\u00f5es, esses direitos de propriedade intelectual podem incluir uma ou mais patentes nos EUA e uma ou mais patentes adicionais ou solicita\u00e7\u00f5es pendentes de patentes nos EUA e em outros pa\u00edses. Direitos do governo dos EUA - Software comercial. Os usu\u00e1rios governamentais est\u00e3o sujeitos ao contrato de licen\u00e7a padr\u00e3o da Oracle. e \u00e0s cl\u00e1usulas aplic\u00e1veis do FAR e seus suplementos. A utiliza\u00e7\u00e3o est\u00e1 sujeita aos termos da licen\u00e7a. Esta distribui\u00e7\u00e3o pode incluir materiais desenvolvidos por terceiros. Partes do produto podem ser derivadas de sistemas Berkeley BSD, licenciados pela Universidade da Calif\u00f3rnia. Oracle, Java e GlassFish s\u00e3o marcas comerciais registradas da Oracle Corporation e/ou de suas empresas afiliadas.
#EN copyright.fullPage=<br>Copyright &#169; 2005, 2011, Oracle and/or its affiliates. All rights reserved. <br><br> This software and related documentation are provided under a license agreement containing restrictions on use and disclosure and are protected by intellectual property laws. Except as expressly permitted in your license agreement or allowed by law, you may not use, copy, reproduce, translate, broadcast, modify, license, transmit, distribute, exhibit, perform, publish, or display any part, in any form, or by any means. Reverse engineering, disassembly, or decompilation of this software, unless required by law for interoperability, is prohibited.  The information contained herein is subject to change without notice and is not warranted to be error-free. If you find any errors, please report them to us in writing. <br><br> If this is software or related software documentation that is delivered to the U.S. Government or anyone licensing it on behalf of the U.S. Government, the following notice is applicable:<br><br> U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are \"commercial computer software\" or \"commercial technical data\" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065. <br><br> This software or hardware is developed for general use in a variety of information management applications. It is not developed or intended for use in any inherently dangerous applications, including applications which may create a risk of personal injury. If you use this software or hardware in dangerous applications, then you shall be responsible to take all appropriate fail-safe, backup, redundancy, and other measures to ensure its safe use. Oracle Corporation and its affiliates disclaim any liability for any damages caused by use of this software or hardware in dangerous applications. <br><br> Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners. <br><br> AMD, Opteron, the AMD logo, and the AMD Opteron logo are trademarks or registered trademarks of Advanced Micro Devices. Intel and Intel Xeon are trademarks or registered trademarks of Intel Corporation. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. UNIX is a registered trademark licensed through X/Open Company, Ltd.<br><br> This software or hardware and documentation may provide access to or information on content, products, and services from third parties. Oracle Corporation and its affiliates are not responsible for and expressly disclaim all warranties of any kind with respect to third-party content, products, and services. Oracle Corporation and its affiliates will not be responsible for any loss, costs, or damages incurred due to your access to or use of third-party content, products, or services.
copyright.fullPage=<br>Copyright &#169; 2005, 2011, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados e de titularidade da Oracle Corporation. Proibida a reprodu\u00e7\u00e3o total ou parcial. <br><br> Este programa de computador e sua documenta\u00e7\u00e3o s\u00e3o fornecidos sob um contrato de licen\u00e7a que cont\u00e9m restri\u00e7\u00f5es sobre seu uso e divulga\u00e7\u00e3o, sendo tamb\u00e9m protegidos pela legisla\u00e7\u00e3o de propriedade intelectual. Exceto em situa\u00e7\u00f5es expressamente permitidas no contrato de licen\u00e7a ou por lei, n\u00e3o \u00e9 permitido usar, reproduzir, traduzir, divulgar, modificar, licenciar, transmitir, distribuir, expor, executar, publicar ou exibir qualquer parte deste programa de computador e de sua documenta\u00e7\u00e3o, de qualquer forma ou atrav\u00e9s de qualquer meio. N\u00e3o \u00e9 permitida a engenharia reversa, a desmontagem ou a descompila\u00e7\u00e3o deste programa de computador, exceto se exigido por lei para obter interoperabilidade.  As informa\u00e7\u00f5es contidas neste documento est\u00e3o sujeitas a altera\u00e7\u00e3o sem aviso pr\u00e9vio. A Oracle Corporation n\u00e3o garante que tais informa\u00e7\u00f5es estejam isentas de erros. Se voc\u00ea encontrar algum erro, por favor, nos envie uma descri\u00e7\u00e3o de tal problema por escrito. <br><br> Se este programa de computador, ou sua documenta\u00e7\u00e3o, for entregue / distribu\u00eddo(a) ao Governo dos Estados Unidos ou a qualquer outra parte que licencie os Programas em nome daquele Governo, a seguinte nota ser\u00e1 aplic\u00e1vel:<br><br> U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are \"commercial computer software\" or \"commercial technical data\" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065. <br><br> Este programa de computador foi desenvolvido para uso em diversas aplica\u00e7\u00f5es de gerenciamento de informa\u00e7\u00f5es. Ele n\u00e3o foi desenvolvido nem projetado para uso em aplica\u00e7\u00f5es inerentemente perigosas, incluindo aquelas que possam criar risco de les\u00f5es f\u00edsicas. Se utilizar este programa em aplica\u00e7\u00f5es perigosas, voc\u00ea ser\u00e1 respons\u00e1vel por tomar todas e quaisquer medidas apropriadas em termos de seguran\u00e7a, backup e redund\u00e2ncia para garantir o uso seguro de tais programas de computador. A Oracle Corporation e suas afiliadas se isentam de qualquer responsabilidade por quaisquer danos causados pela utiliza\u00e7\u00e3o deste programa de computador em aplica\u00e7\u00f5es perigosas. <br><br> Oracle e Java s\u00e3o marcas comerciais registradas da Oracle Corporation e/ou de suas empresas afiliadas. Outros nomes podem ser marcas comerciais de seus respectivos propriet\u00e1rios. <br><br> AMD, Opteron, o logotipo da AMD e o logotipo do AMD Opteron s\u00e3o marcas comerciais ou marcas comerciais registradas da Advanced Micro Devices. Intel e Intel Xeon s\u00e3o marcadas comerciais ou marcas comerciais registradas da Intel Corporation. Todas as marcas comerciais SPARC s\u00e3o usadas sob licen\u00e7a e s\u00e3o marcas comerciais ou marcas comerciais registradas da SPARC International, Inc. UNIX \u00e9 uma marca comercial registrada licenciada por meio do cons\u00f3rcio X/Open Company Ltd.<br><br> Este programa e sua documenta\u00e7\u00e3o podem oferecer acesso ou informa\u00e7\u00f5es relativas a conte\u00fados, produtos e servi\u00e7os de terceiros. A Oracle Corporation e suas empresas afiliadas n\u00e3o fornecem quaisquer garantias relacionadas a conte\u00fados, produtos e servi\u00e7os de terceiros e est\u00e3o isentas de quaisquer responsabilidades associadas a eles. A Oracle Corporation e suas empresas afiliadas n\u00e3o s\u00e3o respons\u00e1veis por quaisquer tipos de perdas, despesas ou danos incorridos em conseq\u00fc\u00eancia do acesso ou da utiliza\u00e7\u00e3o de conte\u00fados, produtos ou servi\u00e7os de terceiros.
#EN promotionLink=www.sun.com/software/products/appsrvr/promotions/v3.html
promotionLink=www.sun.com/software/products/appsrvr/promotions/v3.html
