#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

Usage#
deploy.command=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u306B\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059
deploy.command.usagetext=deploy\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--force[=<force(default:false)>]]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] [--name <component_name>]\n\t[--upload[=<upload(default:false)>]] [--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] |\n\t --dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--altdd <alternate_deploymentdescriptor>]\n\t[--runtimealtdd <runtime_alternate_deploymentdescriptor>]\n\t[--deploymentorder <deployment_order>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]]\n\t[--type <pkg-type(war,ejb,rar,car,ear,osgi)>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] file_archive | filepath
deploy.command.path=\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u307E\u305F\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30D1\u30B9
deploy.command.name=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D
deploy.command.contextroot=Web\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30EB\u30FC\u30C8\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u3001\u62E1\u5F35\u5B50\u306A\u3057\u306E\u30D5\u30A1\u30A4\u30EB\u540D\u3067\u3059\u3002
deploy.command.libraries=\u30E9\u30A4\u30D6\u30E9\u30EAJAR\u30D5\u30A1\u30A4\u30EB\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3067\u3059\u3002 
deploy.command.force=true\u306E\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u518D\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ffalse\u3067\u3059\u3002
deploy.command.precompilejsp=true\u306E\u5834\u5408\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u4E2D\u306BJSP\u304C\u30B3\u30F3\u30D1\u30A4\u30EB\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ffalse\u3067\u3059\u3002
deploy.command.verify=true\u306E\u5834\u5408\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u8A18\u8FF0\u5B50\u306E\u69CB\u6587\u3068\u30BB\u30DE\u30F3\u30C6\u30A3\u30AF\u30B9\u304C\u691C\u8A3C\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ffalse\u3067\u3059\u3002
deploy.command.retrieve=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30B9\u30BF\u30D6JAR\u30D5\u30A1\u30A4\u30EB\u3092\u30B5\u30FC\u30D0\u30FC\u30FB\u30DE\u30B7\u30F3\u304B\u3089\u53D6\u5F97\u3057\u3066\u30ED\u30FC\u30AB\u30EB\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u914D\u7F6E\u3057\u307E\u3059\u3002
deploy.command.dbvendorname=\u4F5C\u6210\u3059\u308B\u8868\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30D9\u30F3\u30C0\u30FC\u306E\u540D\u524D\u3002
deploy.command.createtables=CMP Bean\u304C\u30DE\u30C3\u30D7\u3055\u308C\u3066\u3044\u306A\u3044\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3059\u308B\u3068\u304D\u306B\u8868\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
deploy.command.dropandcreatetables=true\u306E\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u518D\u30C7\u30D7\u30ED\u30A4\u6642\u306B\u3001\u4EE5\u524D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u6642\u306B\u4F5C\u6210\u3055\u308C\u305F\u8868\u304C\u3001\u65B0\u3057\u3044\u8868\u3092\u4F5C\u6210\u3059\u308B\u524D\u306B\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u307E\u3059\u3002
deploy.command.uniquetablenames=\u3059\u3079\u3066\u306EBean\u306B\u5BFE\u3057\u3066\u4E00\u610F\u306E\u8868\u540D\u304C\u4ED8\u3051\u3089\u308C\u308B\u3053\u3068\u3092\u4FDD\u8A3C\u3059\u308B\u305F\u3081\u3001\u8868\u540D\u306B\u30CF\u30C3\u30B7\u30E5\u30FB\u30B3\u30FC\u30C9\u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
deploy.command.deploymentplan=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30D7\u30E9\u30F3(Sun\u56FA\u6709\u306E\u8A18\u8FF0\u5B50\u304C\u542B\u307E\u308C\u3066\u3044\u308BJAR)\u3092\u53D6\u5F97\u3057\u3066\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002
deploy.command.enabled=true\u306E\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u304C\u30E6\u30FC\u30B6\u30FC\u306B\u8A31\u53EF\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ftrue\u3067\u3059\u3002
deploy.command.generatermistubs=true\u306E\u5834\u5408\u3001\u9759\u7684RMI-IIOP\u30B9\u30BF\u30D6\u304C\u751F\u6210\u3055\u308C\u3001client.jar\u306B\u914D\u7F6E\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306Ffalse\u3067\u3059\u3002
deploy.command.availabilityenabled=true\u306E\u5834\u5408\u3001SFSB\u30C1\u30A7\u30C3\u30AF\u30DD\u30A4\u30F3\u30C8\u306E\u8A2D\u5B9A\u3084\u30D1\u30C3\u30B7\u30D9\u30FC\u30B7\u30E7\u30F3\u3092\u884C\u3046\u5834\u5408\u306B\u5099\u3048\u3066\u3001\u9AD8\u53EF\u7528\u6027\u304C\u6709\u52B9\u306B\u306A\u308A\u307E\u3059\u3002\u30AF\u30E9\u30B9\u30BF\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u3088\u3046\u306B\u69CB\u6210\u3055\u308C\u3066\u3044\u308B\u30C9\u30E1\u30A4\u30F3\u3067\u306E\u307F\u6709\u52B9\u3067\u3059\u3002
deploy.command.target=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
deploy.command.properties=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5B9F\u884C\u6642\u306B\u6E21\u3055\u308C\u308B\u540D\u524D/\u5024\u30DA\u30A2\u3068\u3057\u3066\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
deploy.dupdeployment=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{1}\u3068\u540C\u3058\u30EA\u30DD\u30B8\u30C8\u30EA\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F7F\u7528\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u5BFE\u8C61\u3068\u3057\u3066\u5225\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540D\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
deploy.nocontainer=\u767B\u9332\u6E08\u307F\u306E\u30B3\u30F3\u30C6\u30CA\u30FB\u30B5\u30FC\u30D3\u30B9\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u7D42\u4E86\u3057\u307E\u3057\u305F...
application.alreadyreg.redeploy={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3059\u3067\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u518D\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u5F37\u5236\u7684\u306B\u884C\u3046\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u6307\u5B9A\u3059\u308B\u304B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u518D\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002\u307E\u305F\u306F\u3001\u65B0\u898F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u5834\u5408\u306F\u3001\u5225\u306E\u540D\u524D\u3092\u9078\u629E\u3057\u307E\u3059\u3002 
deploy.command.success={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3057\u305F\u3002
deploy.command.successwithwarning={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u6B63\u5E38\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u6B21\u306E\u8B66\u544A\u304C\u767A\u751F\u3057\u307E\u3057\u305F:
deploy.unknownarchivetype=\u30A2\u30FC\u30AB\u30A4\u30D6\u30FB\u30BF\u30A4\u30D7{0}\u306F\u8A8D\u8B58\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F
deploy.unknowntype={0}\u306F\u8A8D\u8B58\u3055\u308C\u3066\u3044\u308B\u30A2\u30FC\u30AB\u30A4\u30D6\u30FB\u30BF\u30A4\u30D7\u3067\u306F\u3042\u308A\u307E\u305B\u3093
deploy.unknowncontainer={0}\u306F\u8A8D\u8B58\u3055\u308C\u3066\u3044\u308B\u30B3\u30F3\u30C6\u30CA\u3067\u306F\u3042\u308A\u307E\u305B\u3093 
deploy.unknownarchiveformat=\u8A8D\u8B58\u3055\u308C\u3066\u3044\u306A\u3044\u30A2\u30FC\u30AB\u30A4\u30D6\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
deploy.errorexpandingjar=jar\u30D5\u30A1\u30A4\u30EB\u306E\u5C55\u958B\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
deploy.cannotcreateexpansiondir=jar\u306E\u5C55\u958B{0}\u3067\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u4F5C\u6210\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u304C\u3001\u7D9A\u884C\u3057\u3066\u3044\u307E\u3059
deploy.errorclosingarchive=\u30C7\u30D7\u30ED\u30A4\u53EF\u80FD\u306A\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8{0}\u3092\u9589\u3058\u3066\u3044\u308B\u9593\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
deploy.invalidpropertyformat=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u304Cname=value\u306E\u5F62\u5F0F\u306B\u5F93\u3063\u3066\u3044\u307E\u305B\u3093: {0}
deploy.errOpeningArtifact=\u30C7\u30D7\u30ED\u30A4\u53EF\u80FD\u306A\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8\u3092\u958B\u3044\u3066\u3044\u308B\u9593\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
deploy.errDuringDepl=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F: {0}\u3002\u8A73\u7D30\u306Fserver.log\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
deploy.errClosingArtifact=\u30C7\u30D7\u30ED\u30A4\u53EF\u80FD\u306A\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8{0}\u3092\u9589\u3058\u3066\u3044\u308B\u9593\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
deploy.done={0}\u306F\u3001{1}\u30DF\u30EA\u79D2\u3067\u6B63\u5E38\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3057\u305F\u3002
deploy.failverifier=\u6307\u5B9A\u3057\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u5BFE\u3059\u308B\u4E00\u90E8\u306E\u30D9\u30EA\u30D5\u30A1\u30A4\u30A2\u30FB\u30C6\u30B9\u30C8\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u4E2D\u65AD\u3057\u3066\u3044\u307E\u3059\u3002\u8A73\u7D30\u306Fserver.log\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
deploy.remoteDirDeployChecksumMismatch=\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E{0}\u306B\u3042\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u30FB\u30C7\u30D7\u30ED\u30A4\u30FB\u30D5\u30A1\u30A4\u30EB\u306F\u3001\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u306E\u540C\u3058\u30D1\u30B9\u306B\u3042\u308B\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u30D5\u30A1\u30A4\u30EB\u3068\u306F\u7570\u306A\u308A\u307E\u3059\u3002\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u4E00\u81F4\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u4E00\u81F4\u3057\u3066\u3044\u306A\u3044\u3068\u3001\u305D\u308C\u4EE5\u5916\u306E\u30D5\u30A1\u30A4\u30EB\u304C\u5225\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3059\u3002
deploy.errDelRepos=\u30EA\u30DD\u30B8\u30C8\u30EA\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA{0}\u306E\u524A\u9664\u3067\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
download.errDownloading=\u751F\u6210\u3055\u308C\u305F\u30D5\u30A1\u30A4\u30EB\u306E\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
download.errFileExists=\u30D5\u30A1\u30A4\u30EB\u3092\u751F\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u30D5\u30A1\u30A4\u30EB[{0}]\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
download.errParentFileMissing=\u30D5\u30A1\u30A4\u30EB\u3092\u751F\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA[{0}]\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002 
compat.value.not.supported=\u8B66\u544A: {0}\u306F\u4E92\u63DB\u6027\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u5024\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u73FE\u5728\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u5024\u306Fv2\u3067\u3059\u3002\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
lifecyclemodule_withsamename_exists=\u540C\u3058\u540D\u524D{0}\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u5225\u306E\u540D\u524D\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
application_withsamename_exists=\u540C\u3058\u540D\u524D{0}\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306B\u5225\u306E\u540D\u524D\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
#
undeploy.command=\u4EE5\u524D\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059
undeploy.command.usagetext=undeploy\n\t[--target[=<target(default:server)>]]\n\t[--droptables[=<droptables(default:false)>]]\n\t[--cascade[=<cascade(default:false)>]]\n\t[-?|--help[=<help(default:false)>]] name
undeploy.command.name=\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D
undeploy.command.target=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
undeploy.command.success={0}\u304C\u6B63\u5E38\u306B\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3057\u305F
undeploy.contextcreation.failed =\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u5BFE\u3059\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093: {0}

#
deploydir.command=\u5C55\u958B\u5F62\u5F0F\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30A2\u30FC\u30AB\u30A4\u30D6\u3092\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002\u3053\u306E\u30B3\u30DE\u30F3\u30C9\u306F\u975E\u63A8\u5968\u3067\u3059\u3002deploy\u30B3\u30DE\u30F3\u30C9\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002deploy\u30B3\u30DE\u30F3\u30C9\u306E\u8A73\u7D30\u306A\u8AAC\u660E\u306B\u3064\u3044\u3066\u306F\u3001\u300Cdeploy --help\u300D\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
deploydir.command.usagetext=deploydir\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--force[=<force(default:false)>]]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] [--name <component_name>]\n\t[--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] | \n\t--dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--altdd <alternate_deploymentdescriptor>]\n\t[--runtimealtdd <runtime_alternate_deploymentdescriptor>]\n\t[--deploymentorder <deployment_order>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]]\n\t[--type <pkg-type(war,ejb,rar,car,ear,osgi)>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] dirpath

#
redeploy.command=\u4EE5\u524D\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u518D\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002  
redeploy.command.name=\u518D\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u5FC5\u9808\u3067\u3059\u3002
redeploy.command.path=\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u307E\u305F\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30D1\u30B9\u3002
redeploy.command.invalid.path=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30D1\u30B9\u3092\u7279\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
redeploy.command.cannot.redeploy=\u30D1\u30B9\u30FB\u30AA\u30DA\u30E9\u30F3\u30C9\u3092\u6307\u5B9A\u305B\u305A\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u3092\u518D\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
redeploy.command.success={0}\u304C\u6B63\u5E38\u306B\u518D\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u3057\u305F
redeploy.command.usagetext=redeploy\n\t[--target[=<target(default:server)>]]\n\t[--virtualservers <virtual_servers>] [--contextroot <context_root>]\n\t[--precompilejsp[=<precompilejsp(default:false)>]]\n\t[--verify[=<verify(default:false)>]] --name <component_name>\n\t[--upload[=<upload(default:false)>]] [--retrieve <local_dirpath>]\n\t[--dbvendorname <dbvendorname>]\n\t[--createtables[=createtables(default:false)>] |\n\t --dropandcreatetables[=<dropandcreatetables(default:false)>]]\n\t[--uniquetablenames[=<uniquetablenames(default:false)>]]\n\t[--deploymentplan <deployment_plan>]\n\t[--altdd <alternate_deploymentdescriptor>]\n\t[--runtimealtdd <runtime_alternate_deploymentdescriptor>]\n\t[--deploymentorder <deployment_order>]\n\t[--enabled[=<enabled(default:true)>]]\n\t[--availabilityenabled[=<availabilityenabled(default:false)>]]\n\t[--lbenabled[=<lbenabled(default:true)>]]\n\t[--asyncreplication[=<asyncreplication(default:true)>]]\n\t[--keepstate[=<keepstate(default:false)>]]\n\t[--generatermistubs[=<generatermistubs(default:false)>]]\n\t[--libraries jar_file[,jar_file*]]\n\t[--type <pkg-type(war,ejb,rar,car,ear,osgi)>]\n\t[--properties (name=value)[:name=value]*]\n\t[-?|--help[=<help(default:false)>]] [file_archive | filepath]

#
enable.command=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
enable.command.target=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u306B\u3059\u308B\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
enable.command.component=\u6709\u52B9\u306B\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D\u3002
enable.command.success={0}\u304C\u6B63\u5E38\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3057\u305F

#
disable.command=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u7121\u52B9\u306B\u3057\u307E\u3059
disable.command.usagetext=disable\n\t[--target[=<target(default:server)>]]\n\t[-?|--help[=<help(default:false)>]] component
disable.command.component=\u7121\u52B9\u306B\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D
disable.command.success={0}\u304C\u6B63\u5E38\u306B\u7121\u52B9\u5316\u3055\u308C\u307E\u3057\u305F
disable.command.failed={0}\u306E\u7121\u52B9\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F

#
failToLoadOnInstance=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u6B63\u3057\u304F\u5B9F\u884C\u3055\u308C\u307E\u305B\u3093\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u4FEE\u6B63\u3057\u3066\u304B\u3089\u518D\u30C7\u30D7\u30ED\u30A4\u3057\u3066\u304F\u3060\u3055\u3044\u3002\n{1}\u3002\u8A73\u7D30\u306Fserver.log\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002 

#
list.components=\u30E6\u30FC\u30B6\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u3057\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
list.components.type=\u4E00\u89A7\u8868\u793A\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30D7\u3002\u8A72\u5F53\u3059\u308B\u30BF\u30A4\u30D7\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3001EJB\u3001Web\u3001\u30B3\u30CD\u30AF\u30BF\u3001\u304A\u3088\u3073Web\u30B5\u30FC\u30D3\u30B9\u3067\u3059\u3002\u4F55\u3082\u6307\u5B9A\u3057\u306A\u3044\u3068\u3001\u3059\u3079\u3066\u306E\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u304C\u4E00\u89A7\u8868\u793A\u3055\u308C\u307E\u3059\u3002
list.components.command.invalid.type=\u30AA\u30D7\u30B7\u30E7\u30F3\u5024\u306E\u30BF\u30A4\u30D7\u304C\u7121\u52B9\u3067\u3059\u3002
list.components.no.elements.to.list=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
list.applications=\u30E6\u30FC\u30B6\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u3057\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002\u6709\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30EA\u30B9\u30C8\u306B\u3064\u3044\u3066\u306F\u3001\u300Clist-applications --help\u300D\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
list.applications.warning=\u8B66\u544A: \u3053\u306E\u30B3\u30DE\u30F3\u30C9\u306F\u9664\u53BB\u3055\u308C\u307E\u3059\u3002list-components\u30B3\u30DE\u30F3\u30C9\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
list.applications.verbose.enabled=\u6709\u52B9
list.applications.verbose.disabled=\u7121\u52B9
list.no.applications.deployed=\u3053\u306E\u30BF\u30FC\u30B2\u30C3\u30C8{0}\u306B\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

#
component.status={0}\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u306F{1}\u3067\u3059\u3002

# common strings
application.alreadyreg=[{0}]\u3068\u3044\u3046\u540D\u524D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3059\u3067\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u3059
application.notreg=[{0}]\u3068\u3044\u3046\u540D\u524D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u305B\u3093
lifecycle.alreadyreg=\u3053\u306E\u30BF\u30FC\u30B2\u30C3\u30C8{1}\u306B\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB{0}\u306F\u3059\u3067\u306B\u4F5C\u6210\u3055\u308C\u3066\u3044\u307E\u3059
lifecycle.use.create_app_ref_2=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB{0}\u306F\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306B\u3059\u3067\u306B\u4F5C\u6210\u3055\u308C\u3066\u3044\u307E\u3059\u3002create application ref\u3092\u4F7F\u7528\u3057\u3066\u30BF\u30FC\u30B2\u30C3\u30C8{1}\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u53C2\u7167\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044
use.create_app_ref=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB{0}\u306F\u4ED6\u306E\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u3088\u3063\u3066\u3059\u3067\u306B\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002create application ref\u3092\u4F7F\u7528\u3057\u3066\u30BF\u30FC\u30B2\u30C3\u30C8{1}\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u53C2\u7167\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044
lifecycle.notreg=[{0}]\u3068\u3044\u3046\u540D\u524D\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u5B58\u5728\u3057\u307E\u305B\u3093
ref.not.referenced.target=\u3053\u306E\u30BF\u30FC\u30B2\u30C3\u30C8[{1}]\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u306F\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u305B\u3093
lifecycle.not.referenced.target=\u3053\u306E\u30BF\u30FC\u30B2\u30C3\u30C8[{1}]\u306B\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB{0}\u306F\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u305B\u3093
virtualservers=\u30B3\u30DE\u30F3\u30C9\u3092\u9069\u7528\u3059\u308B\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u30EA\u30B9\u30C8
fnf=\u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093 : {0}
fnr=\u30D5\u30A1\u30A4\u30EB{0}\u306B\u306F\u8AAD\u53D6\u308A\u6A29\u9650\u304C\u3042\u308A\u307E\u305B\u3093
lfnf=\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093: {0} \n
lfnd=\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u9664\u53BB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F: {0}\u3002\u30D5\u30A1\u30A4\u30EB\u304C\u5225\u306E\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\n 
invalidconfig=domain.xml\u30A8\u30F3\u30C8\u30EA\u304C\u7121\u52B9\u3067\u3059\u3002\u30D0\u30B0\u3092\u767B\u9332\u3057\u3066\u304F\u3060\u3055\u3044
nocontainer=\u767B\u9332\u6E08\u307F\u306E\u30B3\u30F3\u30C6\u30CA\u30FB\u30B5\u30FC\u30D3\u30B9\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u7D42\u4E86\u3057\u307E\u3057\u305F...
unknownmoduletpe=\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30BF\u30A4\u30D7\u304C\u8A8D\u8B58\u3067\u304D\u307E\u305B\u3093

appref.already.exists=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u53C2\u7167{0}\u306F\u3001\u3059\u3067\u306B\u30BF\u30FC\u30B2\u30C3\u30C8{1}\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
appref.not.exists=\u30BF\u30FC\u30B2\u30C3\u30C8{1}\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u3078\u306E\u53C2\u7167\u3092\u6301\u3063\u3066\u3044\u307E\u305B\u3093\u3002


wildcard.not.allowed=\u8B66\u544A: \u30D0\u30FC\u30B8\u30E7\u30F3\u5F0F\u3092\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001--enabled=false\u3092\u4F7F\u7528\u3059\u308B\u5834\u5408\u306E\u307F\u3067\u3059

instancedeploy.command.errcredir=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA{0}\u306E\u4F5C\u6210\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u5931\u6557\u306B\u95A2\u3059\u308B\u305D\u308C\u4EE5\u4E0A\u306E\u60C5\u5831\u306F\u3042\u308A\u307E\u305B\u3093
#
get-client-stubs.command=\u751F\u6210\u3055\u308C\u305F\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8\u3092\u4EE5\u524D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304B\u3089\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3057\u307E\u3059
get-client-stubs.command.appname=\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3059\u308B\u751F\u6210\u6E08\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8\u3092\u4F7F\u7528\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u540D\u524D

get-client-stubs.errorPrepDownloadedFiles=\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u306E\u6E96\u5099\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
get-client-stubs.noSuchApp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F
get-client-stubs.noStubApp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u306B\u5BFE\u3057\u3066\u53D6\u5F97\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u304C\u3042\u308A\u307E\u305B\u3093
