#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

## list-domains
## domain1 running
## domain2 not running
list.domains.StatusRunning={0} en ejecuci\u00F3n
list.domains.StatusRestartRequired={0} en ejecuci\u00F3n; es necesario reiniciar para aplicar cambios en la configuraci\u00F3n
list.domains.StatusNotRunning={0} no se est\u00E1 ejecutando
list.domains.StatusUnknown=estado {0} desconocido
NoDomainsToList=CLI141: no hay dominios que enumerar.
###################
## create-service
create.service.BadDomainDir=El directorio de dominio especificado no existe: {0}
create.service.BadDomainDirParent=El directorio principal del directorio de dominio especificado no existe: {0}
create.service.noAsadminScript=No se ha encontrado el script del comando de administraci\u00F3n. Parece que falta: {0}
create.service.noDomainDirs=No existe ning\u00FAn dominio en {0}
create.service.tooManyDomainDirs=Hay m\u00E1s de un dominio en {0}. Vuelva a intentarlo, pero especifique el nombre del dominio como \u00FAltimo argumento.
create.service.runtimeHelp={0}\nPara mayor comodidad, este mensaje tambi\u00E9n se ha guardado en este archivo: {1}
###################
## login
AdminUserPrompt=Introduzca el nombre de usuario administrador [valor por defecto: {0}]>
AdminPasswordPrompt=Introduzca la contrase\u00F1a de administrador>
LoginInfoStored=La informaci\u00F3n de conexi\u00F3n pertinente para el nombre de usuario administrador [{0}]\ndel host [{1}] y el puerto de administraci\u00F3n [{2}] se ha almacenado en\n[{3}] correctamente.\nAseg\u00FArese de que este archivo permanece protegido.\nLos comandos de administraci\u00F3n utilizar\u00E1n la informaci\u00F3n almacenada\nen este archivo para gestionar el dominio asociado.
LoginInfoStoredCreateDomain=La informaci\u00F3n de conexi\u00F3n pertinente para el nombre de usuario administrador [{0}]\nde este dominio [{1}] se ha almacenado\ncorrectamente en [{2}].\nAseg\u00FArese de que este archivo permanece protegido.\nLos comandos de administraci\u00F3n utilizar\u00E1n la informaci\u00F3n\nalmacenada en este archivo para gestionar este dominio.
LoginInfoNotStored=No se ha guardado la informaci\u00F3n de conexi\u00F3n para el nombre de host [{0}] y el puerto [{1}]
InvalidCredentials=Se ha rechazado la autorizaci\u00F3n para las credenciales [usuario: {0}] especificadas en esta solicitud.\n(Normalmente, esto indica una contrase\u00F1a y/o nombre de usuario no v\u00E1lidos.)
ConnectException=El servidor remoto no est\u00E1 recibiendo solicitudes en [{0}:{1}].\nAseg\u00FArese de que el servidor se est\u00E1 ejecutando.
IOException=Error inesperado de E/S durante la comunicaci\u00F3n con el servidor [{0}:{1}].\nAseg\u00FArese de que el servidor se est\u00E1 ejecutando.
UnknownException=Excepci\u00F3n desconocida durante la comunicaci\u00F3n con el servidor [{0}:{1}].\nAseg\u00FArese de que el servidor se est\u00E1 ejecutando.
###################
## delete-domain
DomainDeleted=Se ha suprimido el dominio {0}.
InvalidDomainPath=CLI138: la ruta de acceso del dominio no es v\u00E1lida, {0}
CouldNotDeleteDomain=CLI139: no se ha podido suprimir el dominio {0}.
domain.is.running=El dominio {0} de {1} est\u00E1 en ejecuci\u00F3n. En primer lugar, debe pararlo.
domain.fileinuse=Un archivo o una carpeta del dominio {0} de {1} est\u00E1n en uso. Debe dejar de utilizarlos antes de suprimir el dominio.
###################
## create-domain
InvalidCharInDomain=CLI129: car\u00E1cter no v\u00E1lido en el nombre del dominio {0}
CouldNotCreateDomain=CLI130: no se ha podido crear el dominio {0}
InvalidPortNumber=CLI136. el puerto {0} debe ser un valor num\u00E9rico.
RequireEitherOrOption=Se debe especificar la opci\u00F3n {0} o {1}.
AdminPassword=Introduzca la contrase\u00F1a de administrador
AdminPasswordAgain=Vuelva a introducir la contrase\u00F1a de administrador
MasterPassword=Introduzca la contrase\u00F1a maestra
MasterPasswordAgain=Vuelva a introducir la contrase\u00F1a maestra
DomainCreated=Se ha creado el dominio {0}.
InvalidPortRange=CLI160: puerto {0} no v\u00E1lido; debe estar comprendido entre 1 y 65535.
PortInUseError=El puerto para {0} ({1}) ya est\u00E1 en uso. Pruebe con otro n\u00FAmero de puerto.
PortInUseWarning=Advertencia: el puerto {0} est\u00E1 en uso. Ignorando, ya que la opci\u00F3n checkports se ha definido en false.
NoPermissionForPortError=No dispone de permiso para utilizar el puerto {0} para {1}. Pruebe con otro n\u00FAmero de puerto o con\u00E9ctese a una cuenta con m\u00E1s privilegios.
NoPermissionForPortWarning=Advertencia: no dispone de permiso para utilizar el puerto {0} para {1}. Ignorando, ya que la opci\u00F3n checkports se ha definido en false.
UnknownPortMsg=Error desconocido al probar el puerto {0}. Pruebe con otro n\u00FAmero de puerto.
InvalidPortBaseRange=CLI211: puerto {0} no v\u00E1lido para {1}; debe estar comprendido entre 1 y 65535. Seleccione un valor de base de puerto que produzca un n\u00FAmero de puerto que no exceda de 65535.
UsingPort=Utilizando el puerto {1} para {0}.
DomainExists=El dominio existe: {0}
OverwriteLoginMsgCreateDomain=Se est\u00E1 sobrescribiendo la informaci\u00F3n de conexi\u00F3n de administrador para el host [{0}] y el puerto [{1}]\ncon las credenciales proporcionadas, ya que la opci\u00F3n\n--savelogin se ha utilizado durante la ejecuci\u00F3n del comando create-domain.
LoginInfoNotStoredCreateDomain=No se ha podido almacenar la informaci\u00F3n de conexi\u00F3n pertinente para el nombre de usuario administrador [{0}] para este dominio [{1}].\nPuede que el archivo .gfclient/pass del directorio ra\u00EDz est\u00E9 corrupto.\nCompruebe el formato de este archivo.

DefaultPortInUse=El puerto por defecto {1} para {0} ya est\u00E1 en uso. Utilizando {2}
PortNotSpecified=No se ha especificado ning\u00FAn puerto para {0}. Utilizando {1}
InvalidPortRangeMsg=Puerto no v\u00E1lido para {0}; debe estar comprendido entre 1 y 65535. Utilizando {1}
PortInUse=El puerto {1} para {0} est\u00E1 en uso. Utilizando {2}
UsingDefaultPort=Utilizando el puerto por defecto {1} para {0}.
MutuallyExclusiveOption=CLI169: las opciones {0} y {1} se excluyen mutuamente. Debe especificar una u otra, pero no ambas.
PortPrivilege=En las plataformas Unix, para utilizar los n\u00FAmeros de puerto por debajo de 1024 puede que se necesiten privilegios especiales.
PasswordMissing=El valor de {0} no se ha especificado.
PasswordLimit=CLI128: el valor de {0} debe tener al menos 8 caracteres.
InvalidPropertySyntax=La sintaxis de propiedad no es v\u00E1lida: {0}
PortBasePortInUse=El puerto {0} est\u00E1 en uso.
DeprecatedAdminPassword=La opci\u00F3n AS_ADMIN_ADMINPASSWORD en el archivo de contrase\u00F1a est\u00E1 anticuada.\nEn su lugar, utilice AS_ADMIN_PASSWORD.
AdminUserRequiredPrompt=Introduzca el nombre de usuario administrador [Intro para aceptar el valor por defecto, "{0}", que es que no haya contrase\u00F1a]>
AdminUserRequired=Debe especificar un usuario administrador (p. ej., con la opci\u00F3n --user).
DomainPort=Para el dominio {0}, el puerto de administraci\u00F3n es {1}.
DomainAllowsUnauth=El dominio {0} permite la conexi\u00F3n de administrador como usuario "{1}" sin contrase\u00F1a.
DomainAdminUser=Para el dominio {0}, el usuario administrador es "{1}".
CustomizationFailed=Fallo en la personalizaci\u00F3n de domain.xml: {0}
NoCustomization=No se han encontrado inicializadores de dominios; no se usar\u00E1 el paso de personalizaci\u00F3n
InvokeInitializer=Llamar a DomainInitializer {0}
InvalidUserName=Caracteres no v\u00E1lidos en el nombre {0}
InvalidTemplateValue=Valor de --template no v\u00E1lido {0}. La opci\u00F3n s\u00F3lo acepta ubicaciones de archivos JAR.

###################
## verify-domain-xml
VerifySuccess=Todas las pruebas se han realizado correctamente; domain.xml es v\u00E1lido.
VerifyError=Error: {0}
VerifyDupKey=Clave duplicada: {0} para el tipo = {1}
###################
## change-master-password
current.mp=Introduzca la contrase\u00F1a maestra actual>
incorrect.mp=Contrase\u00F1a maestra actual incorrecta. No podr\u00E1 cambiarla.
new.mp=Introduzca la nueva contrase\u00F1a maestra
new.mp.again=Vuelva a introducir la nueva contrase\u00F1a maestra
both.domaindir.nodedir.not.allowed=No puede especificar domaindir y nodedir juntos. Debe usar uno o el otro.
################################
serviceUser_wrong_os=El par\u00E1metro serviceuser s\u00F3lo est\u00E1 soportado en Linux.
create.service.badServiceName=Windows necesita que el nombre de servicio contenga solamente caracteres de nombre de archivo v\u00E1lidos, sin espacios ni puntos. Seleccione otro nombre. \n\u00C9ste es el nombre que ha especificado: {0}

## LocalDomainsCommand class
Domain.badDomainsDir=CLI300: el directorio de dominio especificado no es un directorio - {0}
Domain.badDomainDir=CLI301: no existe ese directorio de dominio - {0}
Domain.noDomainXml=CLI304: no se ha encontrado domain.xml. Deber\u00EDa estar aqu\u00ED - {0}

## stop-domain command
StopDomain.dasNotRunning=CLI306: advertencia: el servidor situado en {0} no se est\u00E1 ejecutando.
StopDomain.dasNotRunningRemotely=CLI307: advertencia: el servidor remoto no se est\u00E1 ejecutando; no se ha podido forzar la parada.\nPruebe a ejecutar stop-domain en el servidor remoto.
StopDomain.WaitDASDeath=Esperando a que se pare el dominio
StopDomain.DASNotDead=Se ha producido un timeout ({0} segundos) mientras se esperaba a que se parara el dominio.
StopDomain.noDomainNameAllowed=No hay ning\u00FAn nombre de dominio permitido con la opci\u00F3n --host.
StopDomain.nopidprev=No se ha encontrado el ID de proceso del servidor. Se supone que debe estar aqu\u00ED: {0}. No se ha podido matar el proceso.
StopDomain.pidprevreaderror=Error al intentar leer el ID de proceso de {0}: {1}
StopDomain.killerror=Error al intentar matar el servidor con ID de proceso {0} mediante herramientas de plataforma nativa. El mensaje de error ha sido: {1}
StopDomain.killerror2=Error al intentar matar el servidor con herramientas de plataforma nativa. \nL\u00EDnea de comandos: {0}\nMensaje de error de la plataforma: {1}\nValor de retorno: {2}
StopDomain.killsuccess=Se ha matado correctamente el proceso de servidor. Mensaje del sistema operativo: {0}
StopDomain.killsuccess2=Se ha matado correctamente el proceso de servidor por la fuerza.
StopDomain.killedNormally=El servidor ha muerto de forma normal, sin necesidad de forzarlo.
## start-database, stop-database command
DatabaseNotInstalled=La base de datos no est\u00E1 instalada. Descargue e instale la base de datos desde Update Center.
DatabaseStartMsg=Iniciando base de datos en segundo plano.
LogRedirectedTo=Log redireccionado a {0}.
StartDatabaseStatus=La base de datos ya se ha iniciado en el host {0}, puerto {1}.
StopDatabaseStatus=No se ha podido parar la base de datos en el host {0}, puerto {1}.
UnableToStartDatabase=No se ha podido iniciar la base de datos. Consulte el log en {0}.
UnableToAccessDatabaseLog=No se ha podido acceder a derby.log en {0}.
UnableToConnectToDatabase=No se ha podido conectar a la base de datos.
database.info.msg=La base de datos se ha iniciado en el modo de servidor de red en el host {0} y el puerto {1}.
database.driver.name.msg=Los clientes se pueden conectar a la base de datos mediante: [{0}].
database.driver.version.msg=Versi\u00F3n de Controlador de Base de Datos: [{0}]
jdbc.version.msg=Versi\u00F3n de Especificaci\u00F3n de JDBC: [{0}]
CouldNotGetSysInfo=No se ha podido recuperar la informaci\u00F3n del sistema de la base de datos.
noPorts=Error en domain.xml; no se han encontrado puertos de administraci\u00F3n.
WaitServer=Esperando a que se inicie {0}
serverDied=Error al iniciar {0}.\nEl servidor ha finalizado de forma prematura con el c\u00F3digo de salida {1}.
serverDiedOutput=Error al iniciar {0}.\nEl servidor ha finalizado de forma prematura con el c\u00F3digo de salida {1}.\nAntes de terminar, ha generado la siguiente salida:\n\n{2}
remoteError=Error en el servidor remoto: {0}
unknownFormat=Respuesta del servidor desconocida.
cause=Causa: {0}

#start-domain and start-instance
ServerRunning=Ya hay un proceso que est\u00E1 utilizando el puerto de administraci\u00F3n {0}: probablemente sea otra instancia de un servidor de GlassFish.
ServerStart.SuccessMessage=Se ha iniciado correctamente {0}: {1}\n{0} Ubicaci\u00F3n: {2}\nArchivo log: {3}\nPuerto de administraci\u00F3n: {4}
ServerStart.DebuggerMessage=La depuraci\u00F3n est\u00E1 activada. El puerto de depuraci\u00F3n es: {0}
ServerStart.DebuggerSuspendedMessage=La depuraci\u00F3n est\u00E1 activada y el servidor est\u00E1 suspendido. Asocie al puerto de depuraci\u00F3n en: {0}
DomainLocation=Dominio iniciado: {0}\nUbicaci\u00F3n del dominio: {1}\nArchivo log: {2}
DomainAdminPort=Puerto de administraci\u00F3n del dominio: {0}
DomainDebugPort=Puerto de depuraci\u00F3n del dominio: {0}
mp.prompt=Introduzca la contrase\u00F1a maestra (quedan {0} intentos)>
no.console=Se necesita la contrase\u00F1a maestra para iniciar el dominio. No hay ninguna consola; no se pueden pedir datos. Tiene dos opciones: crear el dominio con --savemasterpassword=true o proporcionar un archivo de contrase\u00F1as con la opci\u00F3n --passwordfile.
retry.mp=La contrase\u00F1a maestra es incorrecta; vuelva a intentarlo.
mp.giveup=N\u00FAmero de intentos ({0}) agotado; no se puede continuar.
new.adminpw=Introduzca una contrase\u00F1a de administrador para el usuario "{0}"
new.adminpw.again=Vuelva a introducir una contrase\u00F1a de administrador para el usuario "{0}"
new.adminpw.prompt=Este dominio necesita que se defina una contrase\u00F1a administrativa para que\nse pueda iniciar el dominio. Especifique una contrase\u00F1a administrativa.
upgradeNeeded=El dominio se debe actualizar para poder iniciarse.\nIntentando actualizar ahora...
manualUpgradeNeeded=Los datos de configuraci\u00F3n de este dominio se deben actualizar para poder ejecutarse con esta\nversi\u00F3n del software. Para actualizar los datos, ejecute:\n\tasadmin start-domain --upgrade.\nA continuaci\u00F3n, inicie el dominio normalmente.
upgradeSuccessful=Actualizaci\u00F3n correcta; iniciando dominio...
upgradeFailed=Error al actualizar el dominio: {0}.\nEl servidor ha finalizado de forma prematura con el c\u00F3digo de salida {1}.
upgradeFailedOutput=Error al actualizar el dominio: {0}.\nEl servidor ha finalizado de forma prematura con el c\u00F3digo de salida {1}.\nAntes de morir, ha generado la siguiente salida:\n\n{2}
dry_run_msg=Volcado de la l\u00EDnea de llamada de JVM que se utilizar\u00E1 para iniciar:

## monitor command
monitorCommand.errorRemote=Se ha detectado un error al efectuar una llamada remota: {0}
monitor.jvm.current=actualmente
monitor.jvm.min=m\u00EDn
monitor.jvm.max=m\u00E1x
monitor.jvm.low=bajo
monitor.jvm.high=alto
monitor.jvm.count=recuento
commands.monitor.webmodule_virtual_server_detail=*******************************************************************************\n* ajlc = N\u00FAmero de p\u00E1ginas JSP activas                                           *\n* asc  = N\u00FAmero de sesiones activas actualmente                                  *\n* aslc = N\u00FAmero de servlets activos que se han cargado                            *\n* ast  = N\u00FAmero total de sesiones activadas                              *\n* mjlc = N\u00FAmero m\u00E1ximo de p\u00E1ginas JSP que se han cargado                          *\n* mslc = N\u00FAmero m\u00E1ximo de servlets que se han cargado                           *\n* rst  = N\u00FAmero total de sesiones rechazadas                                    *\n* st   = N\u00FAmero total de sesiones creadas                                     *\n* tjlc = N\u00FAmero total de p\u00E1ginas JSP que se han cargado                            *\n* tslc =N\u00FAmero total de servlets que se han cargado                             *\n*******************************************************************************
commands.monitor.servlet_detail=*******************************************************************************\n* aslc = N\u00FAmero de servlets activos que se han cargado                            *\n* mslc = N\u00FAmero m\u00E1ximo de servlets que se han cargado                           *\n* tslc = N\u00FAmero total de servlets que se han cargado                             *\n*******************************************************************************
commands.monitor.httplistener_detail=*******************************************************************************\n* ec = Valor acumulado del recuento de errores. Un error representa un c\u00F3digo de respuesta    *\n*      mayor o igual a 400.   *\n* mt = Tiempo m\u00E1ximo de respuesta para una solicitud, no un valor acumulado, sino   *\n*      tiempo m\u00E1ximo de respuesta entre los tiempos de respuesta.      *\n* pt = Valor acumulado del tiempo que se tarda en procesar cada solicitud. El       *\n*      tiempo de procesamiento es la media de los tiempos de procesamiento de solicitudes del    *\n*      recuento de solicitudes.                                                       *\n* rc = N\u00FAmero acumulado de solicitudes procesadas hasta el momento.  *\n*******************************************************************************

## restart-domain
restart=Reiniciando dominio...
restart.dasNotRunning=El servidor no se est\u00E1 ejecutando; se intentar\u00E1 iniciarlo...
restart.dasNotRunningNoRestart=El servidor remoto no se est\u00E1 ejecutando; no se puede reiniciar
restartDomain.noGFStart=Se ha producido un timeout al esperar a que el servidor se reinicie
restartDomain.success=Se ha reiniciado correctamente el dominio
restartChangeDebug=Reiniciando dominio y definiendo depuraci\u00F3n expl\u00EDcitamente en {0}...
restartDomain.notRestartable=El dominio informa de que no se puede reiniciar. \nNormalmente esto significa que el archivo de contrase\u00F1as utilizado originalmente para iniciar el servidor se ha suprimido o no se puede leer ahora.\nPare y, a continuaci\u00F3n, reinicie el servidor, o bien corrija el archivo de contrase\u00F1as.

## change-admin-password
AdminUserDefaultPrompt=Introduzca el nombre de usuario administrador [valor por defecto: {0}]>
AdminUserRequired=Debe especificar un usuario administrador (p. ej., con la opci\u00F3n --user).
AdminPwRequired=Debe especificar una contrase\u00F1a de administrador (por ejemplo, utilice la opci\u00F3n --passwordfile).
AdminNewPwRequired=Debe especificar una nueva contrase\u00F1a de administrador (por ejemplo, utilice la opci\u00F3n --passwordfile).
change.admin.password.newpassword=Introduzca la nueva contrase\u00F1a de administrador
change.admin.password.newpassword.again=Vuelva a introducir la nueva contrase\u00F1a de administrador

## LocalServerCommand
NoServerDirs=Error interno: no se ha llamado a setServerDirs(), as\u00ED que el argumento dirs del servidor es nulo.
