#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
cantResolveIpAddress=Adresse IP introuvable pour le nom d''h\u00F4te : {0}
cantdelete=Impossible de supprimer le fichier temporaire {0}.
AgentPortInUse=Le port {0} de l''agent du noeud est en cours d''utilisation.
tooManyNodes=Le r\u00E9pertoire {0} contient plusieurs noeuds. Indiquez --node.
cantCreateNodeDirChild=Erreur lors de la cr\u00E9ation du r\u00E9pertoire du noeud : {0}
cantGetHostName=Une exception a \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9e lors de la tentative d''obtention du nom d''h\u00F4te de cet ordinateur : {0}
noInstallDirPath=Le chemin du r\u00E9pertoire d'installation de GlassFish est introuvable.
Agent.noInstallDir=Le r\u00E9pertoire d''installation de GlassFish est introuvable. Je recherchais ce chemin : {0}
ConfigClusterConflict=Seul --cluster ou --config doit \u00EAtre indiqu\u00E9 (et non les deux)
lbenabledNotForStandaloneInstance=L'option lbenabled n'est pas prise en charge pour les instances autonomes.
Instance.badNodeDir=Le r\u00E9pertoire de noeud {0} n''existe pas ou n''est pas un r\u00E9pertoire
Instance.badInstanceDir=Le r\u00E9pertoire d''instance de serveur {0} n''existe pas ou n''est pas un r\u00E9pertoire
Instance.invalidAgentPort=Port d''agent {0} non valide. Sp\u00E9cifiez un port d''agent valide compris entre 1 et 65535.
Instance.noInstanceDirs=Il n''y a pas d''instance de serveur dans le r\u00E9pertoire {0}
Instance.tooManyInstanceDirs=Il existe plusieurs instances de serveur dans le r\u00E9pertoire {0}
Instance.badInstanceName=Vous devez fournir un nom d'instance
Instance.cantReadDasProperties=Impossible de lire {0}
Instance.cantWriteProperties=Impossible d''\u00E9crire dans {0} : {1}
Instance.dasPropertyComment=Propri\u00E9t\u00E9s de connexion du serveur d'administration de domaine
Instance.nodeagentPropertiesComment=Propri\u00E9t\u00E9s de la connexion de l'agent de noeud
Instance.unknownHost=Impossible de d\u00E9terminer l'h\u00F4te. Cr\u00E9ez le r\u00E9pertoire hostname en tant que nodes/localhost.
Instance.nosync=La synchronisation avec le DAS est ignor\u00E9e.
Instance.nodomainxml=CLI810 La synchronisation avec le DAS a \u00E9chou\u00E9 et aucun fichier domain.xml local\nne peut d\u00E9marrer l'instance.
Instance.syncFailed=Avertissement : la synchronisation avec le DAS a \u00E9chou\u00E9. Poursuite du d\u00E9marrage...
Instance.fullsync=Suppression de tous les \u00E9tats en m\u00E9moire cache pour l''instance {0}.
Instance.rendezvousAttempt=Tentative d''utilisation du protocole Rendez-vous avec le DAS sur {0} : {1}
Instance.rendezvousAlready=L''instance {0} est d\u00E9j\u00E0 inscrite aupr\u00E8s du DAS.
Instance.rendezvousFailed=Echec de l''utilisation du protocole Rendez-vous avec le DAS sur {0} : {1}. V\u00E9rifiez que ce serveur est en cours d''ex\u00E9cution, que l''h\u00F4te et le port sont corrects et que la configuration de ce serveur permet l''acc\u00E8s \u00E0 distance.
#Instance.rendezvousSuccess {0} hostname that the DAS is running on, {1} Admin port of that DAS
Instance.rendezvousSuccess=Protocole Rendez-vous avec le DAS utilis\u00E9 sur {0} : {1}.
#Instance.oldDasProperties {0}=full path filename of das.properties, {1}=the port number in that file {2}=the new admin port number that will replace it
Instance.oldDasProperties=Le fichier das.properties situ\u00E9 \u00E0 l''emplacement {0}\ndate probablement d''une version ant\u00E9rieure, mais il utilise le port standard {1}.\nIl va \u00EAtre mis \u00E0 jour de sorte \u00E0 utiliser le port {2}. V\u00E9rifiez que cette information est correcte
Instance.oldDasPropertiesWrong=Le fichier das.properties situ\u00E9 \u00E0 l''emplacement {0}\ndate probablement d''une version ant\u00E9rieure et utilise le port non standard {1}.\nIl va \u00EAtre mis \u00E0 jour de sorte \u00E0 utiliser le port {2}. Il s''agit probablement d''une erreur
Instance.oldDasPropertiesPrompt=Le fichier das.properties situ\u00E9 \u00E0 l''emplacement {0}\ndate probablement d''une version ant\u00E9rieure et utilise le port non standard {1}.\nSaisissez le num\u00E9ro du port d''administration du DAS [valeur par d\u00E9faut : {2}] >
Instance.dasPropertiesUpdateFailed=Cli811 Avertissement : \u00E9chec de la mise \u00E0 jour du fichier das.properties
Instance.badProtocol=CLI812 Le fichier das.properties situ\u00E9 \u00E0 l''emplacement {0}\nindique un protocole inconnu : {1}
Instance.reenterPort=Num\u00E9ro de port incorrect. Saisissez de nouveau le num\u00E9ro du port d''administration du DAS [valeur par d\u00E9faut : {0}] >
Instance.existingDasPropertiesWarning=Utilisation de l''h\u00F4te DAS {0} et du port {1} \u00E0 partir du fichier das.properties existant pour le noeud\n{2}. Pour utiliser un autre DAS, cr\u00E9ez un noeud \u00E0 l''aide de la commande create-node-ssh ou\ncreate-node-config. Cr\u00E9ez l''instance avec le nouveau noeud, ainsi que l''\nh\u00F4te et le port corrects :\nasadmin --host das_host --port das_port create-local-instance --node node_name instance_name.
Instance.DasHostUnknown=Le nom d''h\u00F4te du DAS, {0}, est inconnu de l''h\u00F4te d''instance {1}. L''h\u00F4te du DAS est peut-\u00EAtre connu sous un nom diff\u00E9rent sur {1}, ou encore le nom d''h\u00F4te du DAS doit \u00EAtre un nom complet qualifi\u00E9 avec un nom de domaine. Afin de corriger le probl\u00E8me, assurez-vous que le syst\u00E8me sur lequel le DAS est ex\u00E9cut\u00E9 peut \u00EAtre identifi\u00E9 par un nom complet qualifi\u00E9 (sur les syst\u00E8mes Unix, il suffit souvent d''ajouter un nom d''h\u00F4te complet qualifi\u00E9 dans /etc/hosts). Si l''h\u00F4te du DAS est connu sous un nom diff\u00E9rent, vous devez modifier l''adresse HTTP du processus d''\u00E9coute d''administration du DAS.
Instance.DasHostUnreachable=Impossible de contacter le DAS ex\u00E9cut\u00E9 sur {0}:{1}. Un pare-feu peut bloquer la connexion au DAS ou l''h\u00F4te du DAS est connu sous un nom diff\u00E9rent sur l''h\u00F4te d''instance {2}. Afin de modifier le nom d''h\u00F4te par lequel DAS s''identifie, mettez \u00E0 jour l''adresse HTTP du processus d''\u00E9coute d''administration du DAS.
Instance.DasHostInvalid=L''h\u00F4te de DAS {0} ne correspond pas \u00E0 l''h\u00F4te de DAS utilis\u00E9 par le noeud {1}.
Instance.DasPortInvalid=Le port de DAS {0} ne correspond pas au port de DAS utilis\u00E9 par le noeud {1}.
Instance.DasIsSecureInvalid=L''indicateur s\u00E9curis\u00E9 du DAS de {0} ne correspond pas \u00E0 l''indicateur s\u00E9curis\u00E9 du DAS utilis\u00E9 par le noeud {1}.
Instance.DasConfig=Le noeud {0} est configur\u00E9 de sorte \u00E0 se connecter au DAS sur {1}:{2} avec la s\u00E9curit\u00E9 = {3}.
create.local.instance.usagetext=create-local-instance\n\t[--config <config> | --cluster <cluster>]\n\t[--lbenabled[=<lbenabled>]]\n\t[--systemproperties <systemproperties>] [--portbase <portbase>]\n\t[--checkports[=<checkports(default:true)>]]\n\t[--savemasterpassword[=<savemasterpassword(default:false)>]]\n\t[--nodedir <nodedir>] [--node <node>]\n\t[-?|--help[=<help(default:false)>]] instance_name
Instance.alreadyExists=Une instance de serveur appel\u00E9e "{0}" existe d\u00E9j\u00E0 dans la configuration
masterPasswordFileNotCreated=Erreur lors de la cr\u00E9ation du fichier de mots de passe ma\u00EEtre {0}
fileNotFound=Fichier {0} introuvable.
MasterPassword=Entrez le mot de passe ma\u00EEtre
MasterPasswordAgain=Entrez \u00E0 nouveau le mot de passe ma\u00EEtre
masterPasswordIncorrect=Le mot de passe ma\u00EEtre est incorrect. Le mot de passe ma\u00EEtre n'est pas enregistr\u00E9.
Keystore.not.encrypted=Erreur lors du cryptage du keystore
Instance.installdir.mismatch=Non-concordance d''attribut pour le noeud {0} : la valeur de l''attribut installdir de la commande ({1}) ne correspond pas \u00E0 la valeur de la configuration du serveur DAS ({2})
Instance.installdir.null=Attribut NULL pour installdir sur le noeud {0} : la valeur de commande est {1}, la valeur de noeud est {2}
###########
StopInstance.noInstanceNameAllowed=Aucun nom d'instance n'est autoris\u00E9 avec l'option --host.
StopInstance.instanceNotRunning=CLI1306 Avertissement : l'instance de serveur n'est pas en cours d'ex\u00E9cution.
Instance.noSuchInstance=CLI1307 Avertissement : aucune instance de serveur portant ce nom n'a \u00E9t\u00E9 trouv\u00E9e.
StopInstance.waitForDeath=Attente de l'arr\u00EAt de l'instance
StopInstance.instanceNotDead=Le d\u00E9lai d''attente ({0} secondes) de l''arr\u00EAt du domaine a expir\u00E9.
## SynchronizeInstanceCommand
Sync.noDASConfigured=CLI800 Le fichier das.properties est manquant. Il devrait se trouver ici : {0}
Sync.alreadySynced=CLI801 L'instance est d\u00E9j\u00E0 synchronis\u00E9e
Sync.dirFailed=CLI802 La synchronisation a \u00E9chou\u00E9 pour le r\u00E9pertoire {0}. Cause :\n  {1}
Sync.failed=CLI803 Echec de synchronisation avec le DAS sur l''h\u00F4te {0}, port {1}
Sync.cantCreateSyncState=Avertissement\u00A0: impossible de cr\u00E9er le fichier d''\u00E9tat de synchronisation : {0}
Sync.cantDeleteSyncState=Avertissement\u00A0: impossible de supprimer le fichier d''\u00E9tat de synchronisation : {0}
Sync.cantCreateDirectory=Avertissement : impossible de cr\u00E9er le r\u00E9pertoire {0}
Sync.cantSetModTime=Avertissement : impossible de d\u00E9finir l''heure de derni\u00E8re modification : {0}
Sync.cantDeleteTempFile=Avertissement : impossible de supprimer le fichier temporaire : {0}
Sync.fullRequired=La pr\u00E9c\u00E9dente synchronisation a \u00E9chou\u00E9 \u00E0 {0}\nUne synchronisation compl\u00E8te sera effectu\u00E9e.
Sync.connectFailed=Echec de connexion au DAS lors de la synchronisation. Cause : {0}
## DeleteLocalInstanceCommand
DeleteInstance.running=L'instance est en cours d'ex\u00E9cution. Arr\u00EAtez-la et r\u00E9-ex\u00E9cutez la commande.
DeleteInstance.noInstanceName=Vous devez indiquer une instance.
DeleteInstance.badWhack=Impossible de supprimer le r\u00E9pertoire de l''instance : {0} Le r\u00E9pertoire existe encore malgr\u00E9 la tentative de suppression.
DeleteInstance.badWhackWithException=Impossible de supprimer le r\u00E9pertoire de l''instance : {0}.  \nIOException : {1) \n** STACK TRACE**\n{2}
DeleteInstance.remoteError=Echec de connexion au DAS sur {0}:{1}.
DeleteInstance.noWhack=Le r\u00E9pertoire de l''instance n''existe pas : {0}
DeleteInstance.noInstance=L'instance n'existe pas sur cet ordinateur.
Config.badConfigNames=Vous devez indiquer une configuration de source et de destination


restart.instanceNotRunning=Le serveur n'est pas en cours d'ex\u00E9cution. Tentative de d\u00E9marrage en cours...
restart=Red\u00E9marrage de l'instance...
restart.notRestartable=Le serveur signale qu'il ne peut pas \u00EAtre red\u00E9marr\u00E9. \nCela signifie g\u00E9n\u00E9ralement que le fichier de mots de passe initialement utilis\u00E9 pour d\u00E9marrer le serveur a \u00E9t\u00E9 supprim\u00E9 ou n'est pas accessible en lecture actuellement. \nArr\u00EAtez et red\u00E9marrez le serveur, ou r\u00E9parez le fichier de mots de passe.
restartChangeDebug=Red\u00E9marrage de l''instance et d\u00E9finition explicite du d\u00E9bogage sur {0}...
#ImportSyncBundleCommand
noFile=Le fichier {0} n''existe pas.
import.sync.bundle.extractBundleFailed=Impossible d''extraire le contenu du lot\n{0}\nvers\n{1}.
import.sync.bundle.inboundPayloadFailed=Impossible de lire le lot\n{0}\n{1}.
import.sync.bundle.completeRegistrationFailed=Le DAS est hors ligne. Impossible de d\u00E9finir la propri\u00E9t\u00E9 rendezvousOccurred. Utilisez la commande set pour d\u00E9finir la propri\u00E9t\u00E9 rendezvousOccurred sur True :\nset {0}.
import.sync.bundle.backupInstanceDirFailed=Impossible de renommer le r\u00E9pertoire existant\n{0}\nen\n{1}.
import.sync.bundle.deletedInstanceDir=Le r\u00E9pertoire existant a \u00E9t\u00E9 supprim\u00E9 :\n{0}
import.sync.bundle.closeStreamFailed=Impossible de fermer le flux sur le fichier\n{0}\n{1}
import.sync.bundle.invalidInstance=L''instance {0} n''existe pas.
import.sync.bundle.domainXmlNotFound=Impossible de trouver le fichier domain.xml dans {0}.
import.sync.bundle.createDirectoryFailed=Impossible de cr\u00E9er le r\u00E9pertoire {0}.
import.sync.bundle.restoreInstanceDirFailed=Impossible de renommer le r\u00E9pertoire existant\n{0}\nen\n{1}.

#SetupSshKey
KeySetupFailed=Le param\u00E9trage de la cl\u00E9 SSH a \u00E9chou\u00E9 : {0}
SSHPasswordPrompt=Saisissez le mot de passe distant pour {0}@{1}>
SSHPasswordNotFound=Le mode non interactif et le mot de passe SSH sont introuvables dans le fichier de mots de passe.
SSHPassphrasePrompt=La cl\u00E9 {0} est crypt\u00E9e.\nSaisissez la phrase secr\u00E8te>
GenerateKeyPairPrompt=La cl\u00E9 SSH est introuvable pour l''utilisateur {0}\nVoulez-vous g\u00E9n\u00E9rer une paire de cl\u00E9s SSH (sans phrase secr\u00E8te) pour que {0} puisse acc\u00E9der \u00E0 {1} ? [o/n] :
SSHAlreadySetup=L''authentification de la cl\u00E9 publique SSH est d\u00E9j\u00E0 configur\u00E9e pour {0}@{1}
ConnFailed=La v\u00E9rification de la connexion a \u00E9chou\u00E9.
#DomainMasterPasswordPrompt {0}=the name of the domain
DomainMasterPasswordPrompt=Le mot de passe poss\u00E8de un alias. Pour obtenir le vrai mot de passe, entrez le mot de passe ma\u00EEtre pour le keystore de {0}>
GetPasswordFailure=Impossible d''obtenir le mot de passe du keystore de {0}.
PasswordAuthFailure=Echec de l''authentification \u00E0 l''aide du mot de passe poss\u00E9dant un alias, stock\u00E9 dans le keystore de {0}.

#installNode
mkdir.failed=Impossible de cr\u00E9er le r\u00E9pertoire {0} sur l''h\u00F4te {1}
cannot.copy.zip.file=Impossible de copier le fichier ZIP {0} vers l''h\u00F4te {1}
jar.failed=La commande jar a \u00E9chou\u00E9 lors l''installation de GlassFish sur l''h\u00F4te {0}. Sortie de commande : {1}
fix.permissions.failed=Impossible de d\u00E9finir les autorisations sur les commandes dans le r\u00E9pertoire bin sur l''h\u00F4te {0} pour l''installation GlassFish {1}
glassfish.install.check.failed=Un probl\u00E8me est survenu durant le processus consistant \u00E0 v\u00E9rifier si l'installation existe d\u00E9j\u00E0 sur l'h\u00F4te distant.

StopInstance.nopidprev=Impossible de trouver l''ID de traitement du serveur. Son emplacement suppos\u00E9 est : {0}. Impossible d''interrompre le processus.
StopInstance.pidprevreaderror=Erreur lors de la tentative de lecture de l''ID de traitement \u00E0 partir de {0} : {1}
CreateLocalInstance.errSetLastMod=Echec de la tentative de d\u00E9finition de la date de derni\u00E8re modification pour {0} ; aucune information suppl\u00E9mentaire n''est disponible

#change-master-password-node
instance.is.running=Le serveur {0} est en cours d''ex\u00E9cution. Vous devez arr\u00EAter l''instance pour pouvoir modifier le mot de passe ma\u00EEtre.
## change-master-password-node
current.mp=Saisissez le mot de passe ma\u00EEtre en cours>
no.console=Non connect\u00E9 \u00E0 la console, abandon.
incorrect.mp=Le mot de passe ma\u00EEtre en cours est incorrect. Vous ne pourrez pas le modifier.
incorrect.old.mp=L'ancien mot de passe ma\u00EEtre est incorrect. Vous ne pourrez plus le modifier.
new.mp=Entrez le nouveau mot de passe ma\u00EEtre
new.mp.again=Entrez \u00E0 nouveau le nouveau mot de passe ma\u00EEtre
old.mp=Saisissez l'ancien mot de passe ma\u00EEtre>
bad.node.dir=Le noeud {0} n''existe pas.
dry_run_msg=Vidage de la ligne d'appel JVM qui serait utilis\u00E9e pour lancer :
dcom.error.unpacking=Echec de la d\u00E9compression de l''installation sur l''ordinateur Windows distant \u00E0 l''aide de DCOM.\nLe script distant est {0}. Il a renvoy\u00E9 : {1}
remote.install.dir.already.gone=Le r\u00E9pertoire distant ({0}) n''existe pas. Rien \u00E0 supprimer.
remote.install.dir.cant.delete=Impossible de supprimer le r\u00E9pertoire distant : {0}. Supprimez-le manuellement.
install.dir.exists=Le r\u00E9pertoire d''installation distant, {0}, existe d\u00E9j\u00E0. Utilisez l''option -force pour le remplacer.
install.node.nolocal=install-node-dcom s''ex\u00E9cute uniquement sur les h\u00F4tes distants. {0} est cet ordinateur.
#####
##### vld
#####
vld.windows.only=Cette commande est r\u00E9serv\u00E9e aux ordinateurs Windows.
vld.missing.dlls=Cette commande ex\u00E9cute un programme Windows natif qui exige l''ex\u00E9cution d''autres fichiers.  \nFichiers manquants : \n{0}
vld.badtempdir=Le r\u00E9pertoire temporaire fourni par Java (java.io.tmpdir), {0}, n''est pas un r\u00E9pertoire.
vld.app.exists=L''outil DCOM existe d\u00E9j\u00E0 ({0}) et ne peut pas \u00EAtre supprim\u00E9.  \nSupprimez-le manuellement et r\u00E9ex\u00E9cutez cette commande.
vld.app.deleted=Ceci est inhabituel. L''application {0} existait d\u00E9j\u00E0. Elle a \u00E9t\u00E9 supprim\u00E9e sans probl\u00E8me.
vld.error.extracting.ex=Erreur lors de la tentative d''extraction de l''outil de configuration DCOM {0}\n{1}
vld.error.extracting=Erreur lors de la tentative d''extraction de l''outil de configuration DCOM {0}
vld.areyousure=Attention : cette commande risque de modifier les droits d'acc\u00E8s de certaines cl\u00E9s dans le registre Windows.\nAvant d'ex\u00E9cuter cette commande, sauvegardez le registre Windows.\nLa modification octroie \u00E0 l'utilisateur Windows le contr\u00F4le total de ces cl\u00E9s.\n\nVoulez-vous modifier le registre Windows ? Si oui, saisissez "oui" en entier
vld.not.interactive=Cette commande peut uniquement \u00EAtre ex\u00E9cut\u00E9e en mode interactif.  \nAssurez-vous que l'indicateur de mode interactif a la valeur True. Pour plus de d\u00E9tails, consultez '--help'.\nL'autre option consiste \u00E0 utiliser l'option --force
vld.noconsole=Cette commande peut uniquement \u00EAtre ex\u00E9cut\u00E9e \u00E0 partir d'une console. R\u00E9essayez avec une console associ\u00E9e.
vld.no=Vous avez choisi de ne pas ex\u00E9cuter la commande.
internal.error=Erreur interne : {0}
