#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
cantResolveIpAddress=N\u00E3o \u00E9 poss\u00EDvel localizar o endere\u00E7o IP para o hostname: {0}
cantdelete=N\u00E3o \u00E9 poss\u00EDvel deletar arquivo tempor\u00E1rio {0}.
AgentPortInUse=A porta do agente do n\u00F3 {0} est\u00E1 em uso.
tooManyNodes=Mais de um n\u00F3 no diret\u00F3rio {0}. Especifique --node.
cantCreateNodeDirChild=Erro ao tentar criar este diret\u00F3rio de n\u00F3: {0}
cantGetHostName=Ocorreu uma exce\u00E7\u00E3o ao tentar obter o nome de host deste computador: {0}
noInstallDirPath=N\u00E3o \u00E9 poss\u00EDvel localizar o caminho do diret\u00F3rio de instala\u00E7\u00E3o do GlassFish.
Agent.noInstallDir=N\u00E3o \u00E9 poss\u00EDvel localizar o diret\u00F3rio de instala\u00E7\u00E3o do GlassFish. Eu estava procurando neste caminho: {0}
ConfigClusterConflict=\u00C9 poss\u00EDvel especificar apenas um destes: --cluster ou --config
lbenabledNotForStandaloneInstance=A op\u00E7\u00E3o lbenabled n\u00E3o \u00E9 suportada em inst\u00E2ncias standalone.
Instance.badNodeDir=O diret\u00F3rio do n\u00F3 {0} n\u00E3o existe ou n\u00E3o \u00E9 um diret\u00F3rio
Instance.badInstanceDir=O diret\u00F3rio da inst\u00E2ncia de servidor {0} n\u00E3o existe ou n\u00E3o \u00E9 um diret\u00F3rio
Instance.invalidAgentPort=Agentport inv\u00E1lido {0}. Especifique um agentport v\u00E1lido entre 1 e 65535.
Instance.noInstanceDirs=Nenhuma inst\u00E2ncia de servidor no diret\u00F3rio {0}
Instance.tooManyInstanceDirs=Mais de uma inst\u00E2ncia de servidor no diret\u00F3rio {0}
Instance.badInstanceName=Voc\u00EA deve fornecer o nome de inst\u00E2ncia
Instance.cantReadDasProperties=N\u00E3o \u00E9 poss\u00EDvel ler {0}
Instance.cantWriteProperties=N\u00E3o \u00E9 poss\u00EDvel gravar {0}: {1}
Instance.dasPropertyComment=Propriedades de Conex\u00E3o do Servidor de Administra\u00E7\u00E3o de Dom\u00EDnios
Instance.nodeagentPropertiesComment=Propriedades de Conex\u00E3o do Agente do N\u00F3
Instance.unknownHost=N\u00E3o foi poss\u00EDvel determinar o host. Crie o diret\u00F3rio do nome de host como n\u00F3s/localhost.
Instance.nosync=Ignorando a sincroniza\u00E7\u00E3o com DAS.
Instance.nodomainxml=CLI810: A sincroniza\u00E7\u00E3o com DAS falhou e nenhum domain.xml local\npode iniciar a inst\u00E2ncia.
Instance.syncFailed=Advert\u00EAncia: a sincroniza\u00E7\u00E3o com DAS falhou, continuando inicializa\u00E7\u00E3o...
Instance.fullsync=Removendo todos os estados no cache da inst\u00E2ncia {0}.
Instance.rendezvousAttempt=Tentando encontrar com o DAS em {0}:{1}
Instance.rendezvousAlready={0} j\u00E1 est\u00E1 registrado no DAS.
Instance.rendezvousFailed=Falhou ao tentar se encontrar com o DAS em {0}:{1}. Verifique se este servidor est\u00E1 em execu\u00E7\u00E3o, se o host e a porta s\u00E3o corretos e se o servidor est\u00E1 configurado para permitir acesso remoto.
#Instance.rendezvousSuccess {0} hostname that the DAS is running on, {1} Admin port of that DAS
Instance.rendezvousSuccess=Encontrou-se com o DAS em {0}:{1}.
#Instance.oldDasProperties {0}=full path filename of das.properties, {1}=the port number in that file {2}=the new admin port number that will replace it
Instance.oldDasProperties=O arquivo das.properties em {0}\n\u00E9 provavelmente de uma vers\u00E3o anterior, mas utiliza a porta padr\u00E3o {1},\nser\u00E1 atualizado para utilizar a porta {2} - comprove se isso \u00E9 correto
Instance.oldDasPropertiesWrong=O arquivo das.properties em {0}\n\u00E9 provavelmente de uma vers\u00E3o anterior e utiliza a porta n\u00E3o padr\u00E3o {1},\nser\u00E1 atualizado para utilizar a porta {2} - isso \u00E9 provavelmente incorreto
Instance.oldDasPropertiesPrompt=O arquivo das.properties em {0}\n\u00E9 provavelmente de uma vers\u00E3o anterior e utiliza a porta n\u00E3o padr\u00E3o {1}\nInsira o n\u00FAmero da porta admin do DAS [default:{2}] >
Instance.dasPropertiesUpdateFailed=CLI811 Advert\u00EAncia: falha ao atualizar o arquivo das.properties
Instance.badProtocol=CLI812 O arquivo das.properties em {0}\nespecifica um protocolo desconhecido: {1}
Instance.reenterPort=N\u00FAmero de porta incorreto, insira novamente o n\u00FAmero de porta admin do DAS [default:{0}] >
Instance.existingDasPropertiesWarning=Utilizando host {0} e porta {1} de DAS do das.properties existente no n\u00F3\n{2}. Para utilizar outro DAS, crie um novo n\u00F3 utilizando create-node-ssh ou\ncreate-node-config. Crie a inst\u00E2ncia com o novo n\u00F3 e corrija o \nhost e a porta:\nasadmin --host das_host --port das_port create-local-instance --node node_name instance_name.
Instance.DasHostUnknown=O nome de host do DAS, {0}, n\u00E3o \u00E9 reconhecido pelo host da inst\u00E2ncia {1}. Isso talvez se deva ao fato de o host do DAS ser conhecido com outro nome no {1} ou pelo nome de host do DAS precisar ser totalmente qualificado com um nome de dom\u00EDnio. Para corrigir isso, certifique-se de que o sistema que o DAS est\u00E1 executando possa identificar-se com um nome totalmente qualificado (em sistemas Unix, isso \u00E9 feito geralmente adicionando-se um nome de host totalmente qualificado em /etc/hosts). Se o host do DAS for conhecido por outro nome, ent\u00E3o \u00E9 necess\u00E1rio alterar o endere\u00E7o do listener HTTP de admin do DAS.
Instance.DasHostUnreachable=N\u00E3o foi poss\u00EDvel contatar o DAS em execu\u00E7\u00E3o em {0}:{1}. Isso talvez se deva ao fato de  que um firewall est\u00E1 bloqueando a conex\u00E3o de volta do DAS ou pelo host do DAS ser conhecido por outro nome no host da inst\u00E2ncia {2}. Para alterar o nome de host que o DAS utiliza para se identificar, atualize o endere\u00E7o do listener HTTP de admin do DAS.
Instance.DasHostInvalid=O host do DAS {0} n\u00E3o corresponde ao host do DAS utilizado pelo n\u00F3 {1}.
Instance.DasPortInvalid=A porta do DAS {0} n\u00E3o corresponde \u00E0 porta do DAS utilizada pelo n\u00F3 {1}.
Instance.DasIsSecureInvalid=O flag seguro do DAS {0} n\u00E3o corresponde ao flag seguro do DAS utilizado pelo n\u00F3 {1}.
Instance.DasConfig=O n\u00F3 {0} est\u00E1 configurado para se conectar ao DAS em {1}:{2} com seguran\u00E7a = {3}.
create.local.instance.usagetext=create-local-instance\n\t[--config <config> | --cluster <cluster>]\n\t[--lbenabled[=<lbenabled>]]\n\t[--systemproperties <systemproperties>] [--portbase <portbase>]\n\t[--checkports[=<checkports(default:true)>]]\n\t[--savemasterpassword[=<savemasterpassword(default:false)>]]\n\t[--nodedir <nodedir>] [--node <node>]\n\t[-?|--help[=<help(default:false)>]] instance_name
Instance.alreadyExists=Uma inst\u00E2ncia do servidor denominada "{0}" j\u00E1 existe na configura\u00E7\u00E3o
masterPasswordFileNotCreated=Erro ao criar o arquivo de senha mestra {0}
fileNotFound=Arquivo {0} n\u00E3o encontrado.
MasterPassword=Insira a senha mestra
MasterPasswordAgain=Digite a senha mestra novamente
masterPasswordIncorrect=Senha mestra incorreta. Senha mestra n\u00E3o salva.
Keystore.not.encrypted=Erro ao criptografar o armazenamento de chaves
Instance.installdir.mismatch=Incompatibilidade de atributo no n\u00F3 {0}: o valor do atributo installdir do comando ({1}) n\u00E3o corresponde ao valor na configura\u00E7\u00E3o do DAS ({2})
Instance.installdir.null=Atributo nulo para installdir no n\u00F3 {0}: o valor do comando \u00E9: {1}, o valor do n\u00F3 \u00E9: {2}
###########
StopInstance.noInstanceNameAllowed=Nenhum nome de inst\u00E2ncia permitido com a op\u00E7\u00E3o de host --.
StopInstance.instanceNotRunning=CLI1306 Advert\u00EAncia - a inst\u00E2ncia de servidor n\u00E3o est\u00E1 em execu\u00E7\u00E3o.
Instance.noSuchInstance=CLI1307 Advert\u00EAncia - nenhuma inst\u00E2ncia de servidor encontrada com este nome.
StopInstance.waitForDeath=Aguardando que a inst\u00E2ncia seja interrompida
StopInstance.instanceNotDead=Time-out ({0} segundos) aguardando interrup\u00E7\u00E3o do dom\u00EDnio.
## SynchronizeInstanceCommand
Sync.noDASConfigured=CLI800 O arquivo das.properties est\u00E1 faltando, esperava-se encontr\u00E1-lo aqui: {0}
Sync.alreadySynced=CLI801 A inst\u00E2ncia j\u00E1 est\u00E1 sincronizada
Sync.dirFailed=CLI802 A sincroniza\u00E7\u00E3o falhou no diret\u00F3rio {0}, causada por:\n  {1}
Sync.failed=CLI803 Falhou ao sincronizar com o DAS no host {0}, porta {1}
Sync.cantCreateSyncState=Advert\u00EAncia: n\u00E3o \u00E9 poss\u00EDvel criar arquivo do estado da sincroniza\u00E7\u00E3o: {0}
Sync.cantDeleteSyncState=Advert\u00EAncia: n\u00E3o \u00E9 poss\u00EDvel deletar arquivo do estado da sincroniza\u00E7\u00E3o: {0}
Sync.cantCreateDirectory=Advert\u00EAncia: n\u00E3o \u00E9 poss\u00EDvel criar diret\u00F3rio: {0}
Sync.cantSetModTime=Advert\u00EAncia: n\u00E3o \u00E9 poss\u00EDvel determinar o \u00FAltimo hor\u00E1rio modificado: {0}
Sync.cantDeleteTempFile=Advert\u00EAncia: n\u00E3o \u00E9 poss\u00EDvel deletar o arquivo tempor\u00E1rio: {0}
Sync.fullRequired=Sincroniza\u00E7\u00E3o anterior falha em {0}\nSer\u00E1 realizada a sincroniza\u00E7\u00E3o completa.
Sync.connectFailed=Falha ao se conectar ao DAS durante a sincroniza\u00E7\u00E3o, causada por: {0}
## DeleteLocalInstanceCommand
DeleteInstance.running=A inst\u00E2ncia est\u00E1 em execu\u00E7\u00E3o. Interrompa-a e execute o comando novamente.
DeleteInstance.noInstanceName=Voc\u00EA deve especificar uma inst\u00E2ncia.
DeleteInstance.badWhack=N\u00E3o \u00E9 poss\u00EDvel deletar o diret\u00F3rio da inst\u00E2ncia: {0}  O diret\u00F3rio ainda existe depois de tentar delet\u00E1-lo.
DeleteInstance.badWhackWithException=N\u00E3o \u00E9 poss\u00EDvel deletar o diret\u00F3rio da inst\u00E2ncia: {0}. \nEsta IOException foi lan\u00E7ada: {1) \n** STACK TRACE **\n{2}
DeleteInstance.remoteError=Falha ao se conectar ao DAS em {0}:{1}.
DeleteInstance.noWhack=O diret\u00F3rio da inst\u00E2ncia n\u00E3o existe: {0}
DeleteInstance.noInstance=A inst\u00E2ncia n\u00E3o existe nesta m\u00E1quina.
Config.badConfigNames=Voc\u00EA deve especificar uma configura\u00E7\u00E3o de origem e de destino


restart.instanceNotRunning=O servidor n\u00E3o est\u00E1 em execu\u00E7\u00E3o, tentando inici\u00E1-lo...
restart=Reiniciando a Inst\u00E2ncia...
restart.notRestartable=O servidor informa que n\u00E3o \u00E9 reinicializ\u00E1vel. \nIsso geralmente significa que o arquivo de senha que foi originalmente usado para iniciar o servidor foi deletado ou n\u00E3o \u00E9 leg\u00EDvel agora. \\ nPare e inicie o servidor ou corrija o arquivo de senhas.
restartChangeDebug=Reiniciando a inst\u00E2ncia e definindo explicitamente a depura\u00E7\u00E3o como {0}...
#ImportSyncBundleCommand
noFile=O arquivo {0} n\u00E3o existe.
import.sync.bundle.extractBundleFailed=N\u00E3o foi poss\u00EDvel extrair conte\u00FAdo do pacote\n{0}\npara\n{1}.
import.sync.bundle.inboundPayloadFailed=N\u00E3o foi poss\u00EDvel ler o pacote\n{0}\n{1}.
import.sync.bundle.completeRegistrationFailed=O DAS est\u00E1 off-line. N\u00E3o foi poss\u00EDvel definir a propriedade rendezvousOccurred. Utilize o comando set para definir a propriedade rendezvousOccurred como verdadeira:\nset {0}.
import.sync.bundle.backupInstanceDirFailed=N\u00E3o foi poss\u00EDvel renomear o diret\u00F3rio existente\n{0}\ncomo\n{1}.
import.sync.bundle.deletedInstanceDir=Diret\u00F3rio existente deletado:\n{0}
import.sync.bundle.closeStreamFailed=N\u00E3o foi poss\u00EDvel fechar o fluxo no arquivo\n{0}\n{1}
import.sync.bundle.invalidInstance=A inst\u00E2ncia {0} n\u00E3o existe.
import.sync.bundle.domainXmlNotFound=N\u00E3o foi poss\u00EDvel localizar domain.xml em {0}.
import.sync.bundle.createDirectoryFailed=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio {0}.
import.sync.bundle.restoreInstanceDirFailed=N\u00E3o foi poss\u00EDvel renomear o diret\u00F3rio\n{0}\nto\n{1}.

#SetupSshKey
KeySetupFailed=Falha na configura\u00E7\u00E3o da chave SSH: {0}
SSHPasswordPrompt=Insira a senha remota para {0}@{1}>
SSHPasswordNotFound=Modo n\u00E3o interativo e senha SSH n\u00E3o encontrados no arquivo de senha.
SSHPassphrasePrompt=A chave {0} est\u00E1 criptografada\nInsira a frase-senha>
GenerateKeyPairPrompt=Chave SSH n\u00E3o encontrada para o usu\u00E1rio {0}\nGostaria de gerar um par de chaves SSH (sem uma frase-senha de chave) para {0} para acessar {1}? [y/n]:
SSHAlreadySetup=A autentica\u00E7\u00E3o com chave p\u00FAblica SSH j\u00E1 est\u00E1 configurada para {0}@{1}
ConnFailed=A verifica\u00E7\u00E3o da conex\u00E3o falhou.
#DomainMasterPasswordPrompt {0}=the name of the domain
DomainMasterPasswordPrompt=A senha tem apelido. Para obter a senha real, insira a senha mestra para o armazenamento de chaves do {0}>
GetPasswordFailure=Falha ao obter a senha do armazenamento de chave do {0}.
PasswordAuthFailure=Falha ao autenticar utilizando a senha com alias armazenada no armazenamento de chave do {0}.

#installNode
mkdir.failed=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio {0} no host {1}
cannot.copy.zip.file=N\u00E3o foi poss\u00EDvel copiar o arquivo zip {0} no host {1}
jar.failed=O comando jar falhou durante a instala\u00E7\u00E3o do glassfish no host {0}. Sa\u00EDda do comando {1}
fix.permissions.failed=N\u00E3o foi poss\u00EDvel definir as permiss\u00F5es nos comandos no diret\u00F3rio bin do host {0} para a instala\u00E7\u00E3o do glassfish {1}
glassfish.install.check.failed=Problema encontrado ao verificar se a instala\u00E7\u00E3o j\u00E1 existia no host remoto.

StopInstance.nopidprev=N\u00E3o \u00E9 poss\u00EDvel localizar o ID do processo do servidor. Deveria estar aqui: {0}. N\u00E3o \u00E9 poss\u00EDvel eliminar o processo.
StopInstance.pidprevreaderror=Erro ao tentar ler o ID do Processo em {0}: {1}
CreateLocalInstance.errSetLastMod=Tentativa de definir a data da \u00FAltima Modifica\u00E7\u00E3o para {0} falhou; nenhuma informa\u00E7\u00E3o adicional est\u00E1 dispon\u00EDvel

#change-master-password-node
instance.is.running=O servidor {0} est\u00E1 em execu\u00E7\u00E3o. \u00C9 necess\u00E1rio interromper a inst\u00E2ncia antes que a senha mestra seja alterada.
## change-master-password-node
current.mp=Insira a senha mestra atual>
no.console=N\u00E3o est\u00E1 conectado com a console, cancelando.
incorrect.mp=Senha mestra atual incorreta. N\u00E3o ser\u00E1 poss\u00EDvel alter\u00E1-la.
incorrect.old.mp=Senha mestra antiga incorreta. N\u00E3o ser\u00E1 poss\u00EDvel alter\u00E1-la.
new.mp=Insira a nova senha mestra
new.mp.again=Insira a nova senha mestra novamente
old.mp=Insira a senha mestra antiga>
bad.node.dir=O n\u00F3 {0} n\u00E3o existe.
dry_run_msg=Dump de linha de Invoca\u00E7\u00E3o JVM que poderia ser usado para acionar:
dcom.error.unpacking=Falha ao descompactar a instala\u00E7\u00E3o na m\u00E1quina remota do Windows usando o DCOM.\nO script remoto \u00E9 {0}. Ele retornou: {1}
remote.install.dir.already.gone=O diret\u00F3rio remoto ({0}) n\u00E3o existe. N\u00E3o h\u00E1 nada para deletar.
remote.install.dir.cant.delete=N\u00E3o \u00E9 poss\u00EDvel deletar o diret\u00F3rio remoto: {0}.  Delete-o manualmente.
install.dir.exists=O diret\u00F3rio de instala\u00E7\u00E3o remota, {0}, j\u00E1 existe. Usar a -- op\u00E7\u00E3o de for\u00E7a para substitu\u00ED-lo.
install.node.nolocal=O install-node-dcom somente funciona em hosts remotos. {0} \u00E9 este computador.
#####
##### vld
#####
vld.windows.only=Este comando destina-se exclusivamente a computadores Windows.
vld.missing.dlls=Este comando executa um programa Windows nativo que requer a execu\u00E7\u00E3o de outros arquivos. \nEstes s\u00E3o os arquivos ausentes:\n {0}
vld.badtempdir=O diret\u00F3rio tempor\u00E1rio fornecido para Java (java.io.tmpdir), {0}, n\u00E3o \u00E9 um diret\u00F3rio.
vld.app.exists=A ferramenta DCOM j\u00E1 existe ({0}) e n\u00E3o pode ser deletada. \nDelete-a manualmente e reexecute este comando.
vld.app.deleted=Isto \u00E9 incomum. A aplica\u00E7\u00E3o {0} j\u00E1 existia. Ela foi deletada sem problemas.
vld.error.extracting.ex=Erro ao tentar extrair a ferramenta de Configura\u00E7\u00E3o DCOM {0}\n{1}
vld.error.extracting=Erro ao tentar extrair a ferramenta de Configura\u00E7\u00E3o DCOM {0}
vld.areyousure=Cuidado: Este comando pode modificar as permiss\u00F5es de algumas chaves no registro do Windows.\nAntes de executar este comando, fa\u00E7a backup do registro do Windows.\nA modifica\u00E7\u00E3o permite que o usu\u00E1rio do Windows tenha controle total dessas chaves.\n\nTem certeza de que deseja editar o registro do Windows? Em caso afirmativo, digite yes
vld.not.interactive=Este comando s\u00F3 pode ser executado no modo interativo.  \nCertifique-se de que o flag interativo tenha sido definindo como true. Consulte '--help' para obter detalhes\nA outra op\u00E7\u00E3o a ser usada \u00E9 --force
vld.noconsole=Este comando s\u00F3 pode ser executado a partir de uma console. Tente novamente utilizando uma console.
vld.no=Voc\u00EA optou por n\u00E3o executar o comando.
internal.error=Erro Interno: {0}
