#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
cantResolveIpAddress=No se ha encontrado la direcci\u00F3n IP para el nombre de host: {0}
cantdelete=No se puede suprimir el archivo temporal {0}.
AgentPortInUse=El puerto del agente de nodo {0} est\u00E1 en uso.
tooManyNodes=M\u00E1s de un nodo en el directorio {0}. Especifique --node.
cantCreateNodeDirChild=Error al intentar crear este directorio de nodo: {0}
cantGetHostName=Se ha detectado una excepci\u00F3n al intentar obtener el nombre de host de la computadora: {0}
noInstallDirPath=No se ha encontrado la ruta de acceso del directorio de instalaci\u00F3n de GlassFish.
Agent.noInstallDir=No se ha encontrado el directorio de instalaci\u00F3n de GlassFish. Se estaba buscando en esta ruta de acceso: {0}
ConfigClusterConflict=Solamente puede especificar un valor --cluster o --config
lbenabledNotForStandaloneInstance=La opci\u00F3n lbenabled no est\u00E1 soportada con instancias independientes.
Instance.badNodeDir=El directorio del nodo {0} no existe o no es un directorio
Instance.badInstanceDir=El directorio de la instancia del servidor {0} no existe o no es un directorio
Instance.invalidAgentPort=Puerto de agente no v\u00E1lido {0}. Especifique un puerto de agente v\u00E1lido entre 1 y 65535.
Instance.noInstanceDirs=No existe ning\u00FAn directorio de instancias en {0}
Instance.tooManyInstanceDirs=Existe m\u00E1s de una instancia del servidor en el directorio {0}
Instance.badInstanceName=Debe proporcionar el nombre de la instancia
Instance.cantReadDasProperties=No se puede leer {0}
Instance.cantWriteProperties=No se puede escribir {0}: {1}
Instance.dasPropertyComment=Propiedades de Conexi\u00F3n del Servidor de Administraci\u00F3n de Dominio
Instance.nodeagentPropertiesComment=Propiedades de Conexi\u00F3n del Agente de Nodos
Instance.unknownHost=No se ha podido determinar el host. Cree el directorio hostname como nodes/localhost.
Instance.nosync=Omitiendo sincronizaci\u00F3n con DAS.
Instance.nodomainxml=CLI810 Fallo en la sincronizaci\u00F3n con DAS y ning\u00FAn domain.xml\nlocal puede iniciar la instancia.
Instance.syncFailed=Advertencia: fallo en la sincronizaci\u00F3n con DAS. Continuando el inicio...
Instance.fullsync=Eliminando todo el estado almacenado en cach\u00E9 para la instancia {0}.
Instance.rendezvousAttempt=Intentando establecer un encuentro con DAS en {0}:{1}
Instance.rendezvousAlready={0} ya est\u00E1 registrado en DAS.
Instance.rendezvousFailed=Fallo al establecer un encuentro con DAS en {0}:{1}. Compruebe que el servidor se est\u00E9 ejecutando, que el host y el puerto sean correctos y que el servidor est\u00E9 configurado para permitir el acceso remoto.
#Instance.rendezvousSuccess {0} hostname that the DAS is running on, {1} Admin port of that DAS
Instance.rendezvousSuccess=Se ha establecido un encuentro con DAS en {0}:{1}.
#Instance.oldDasProperties {0}=full path filename of das.properties, {1}=the port number in that file {2}=the new admin port number that will replace it
Instance.oldDasProperties=El archivo das.properties de {0}\nes probablemente de una versi\u00F3n anterior, pero utiliza el puerto est\u00E1ndar {1};\nse actualizar\u00E1 para utilizar el puerto {2}; compruebe que \u00E9ste sea correcto
Instance.oldDasPropertiesWrong=El archivo das.properties de {0}\nes probablemente de una versi\u00F3n anterior y utiliza el puerto no est\u00E1ndar {1};\nse actualizar\u00E1 para utilizar el puerto {2}; probablemente \u00E9ste es incorrecto
Instance.oldDasPropertiesPrompt=El archivo das.properties de {0}\nes probablemente de una versi\u00F3n anterior y utiliza el puerto no est\u00E1ndar {1}.\nIntroduzca el n\u00FAmero de puerto de administraci\u00F3n de DAS [default:{2}] >
Instance.dasPropertiesUpdateFailed=CLI811 Advertencia: fallo al actualizar el archivo das.properties
Instance.badProtocol=CLI812 El archivo das.properties de {0}\nespecifica un protocolo desconocido: {1}
Instance.reenterPort=N\u00FAmero de puerto err\u00F3neo. Vuelva a introducir el n\u00FAmero de puerto de administraci\u00F3n de DAS [default:{0}] >
Instance.existingDasPropertiesWarning=Utilizando el host de DAS {0} y el puerto {1} del archivo das.properties existente para el nodo\n{2}. Para utilizar otro DAS, cree un nodo nuevo con create-node-ssh o\ncreate-node-config. Cree la instancia con el nodo nuevo y el\nhost y puerto correctos:\nasadmin --host das_host --port das_port create-local-instance --node nombre_nodo nombre_instancia.
Instance.DasHostUnknown=El nombre del host de DAS, {0}, no es conocido para el host de la instancia {1}. Esto se puede deber a que el host de DAS se conoce con otro nombre en {1} o porque el nombre de host de DAS debe estar totalmente cualificado con un nombre de dominio. Para corregirlo, aseg\u00FArese de que el sistema en que se ejecuta DAS se pueda identificar con un nombre totalmente cualificado (en sistemas Unix, se suele realizar agregando un nombre de host totalmente cualificado en /etc/hosts). Si el host de DAS se conoce con otro nombre, deber\u00E1 cambiar la direcci\u00F3n de listener HTTP de administraci\u00F3n de DAS.
Instance.DasHostUnreachable=No se ha podido contactar con el DAS que se est\u00E1 ejecutando en {0}:{1}. Esto se puede deber a que un firewall est\u00E1 bloqueando la reconexi\u00F3n al DAS o porque el host de DAS se identifica con otro nombre en el host de la instancia {2}. Para cambiar el nombre de host que utiliza DAS para identificarse, actualice la direcci\u00F3n de listener HTTP de administraci\u00F3n de DAS.
Instance.DasHostInvalid=El host de DAS {0} no coincide con el host de DAS utilizado por el nodo {1}.
Instance.DasPortInvalid=El puerto de DAS {0} no coincide con el puerto de DAS utilizado por el nodo {1}.
Instance.DasIsSecureInvalid=El indicador seguro de DAS de {0} no coincide con el indicador seguro de DAS utilizado por el nodo {1}.
Instance.DasConfig=El nodo {0} est\u00E1 configurado para conectarse al DAS en {1}:{2} con = {3} seguro.
create.local.instance.usagetext=create-local-instance\n\t[--config <config> | --cluster <cluster>]\n\t[--lbenabled[=<lbenabled>]]\n\t[--systemproperties <systemproperties>] [--portbase <portbase>]\n\t[--checkports[=<checkports(default:true)>]]\n\t[--savemasterpassword[=<savemasterpassword(default:false)>]]\n\t[--nodedir <nodedir>] [--node <node>]\n\t[-?|--help[=<help(default:false)>]] nombre_instancia
Instance.alreadyExists=En la configuraci\u00F3n ya existe una instancia del servidor denominada "{0}"
masterPasswordFileNotCreated=Error al crear el archivo de contrase\u00F1as maestras {0}
fileNotFound=No se ha encontrado el archivo {0}.
MasterPassword=Introduzca la contrase\u00F1a maestra
MasterPasswordAgain=Vuelva a introducir la contrase\u00F1a maestra
masterPasswordIncorrect=Contrase\u00F1a maestra incorrecta. Contrase\u00F1a maestra no guardada.
Keystore.not.encrypted=Error al cifrar el almac\u00E9n de claves
Instance.installdir.mismatch=Falta de coincidencia del atributo para el nodo {0}: el valor para el atributo installdir del comando ({1}) no coincide con el valor en la configuraci\u00F3n de DAS ({2})
Instance.installdir.null=Atributo nulo para installdir en el nodo {0}: el valor del comando es: {1}, el valor del nodo es: {2}
###########
StopInstance.noInstanceNameAllowed=No hay ning\u00FAn nombre de instancia permitido con la opci\u00F3n --host.
StopInstance.instanceNotRunning=CLI1306 Advertencia: la instancia del servidor no se est\u00E1 ejecutando.
Instance.noSuchInstance=CLI1307 Advertencia: no se ha encontrado ninguna instancia del servidor con ese nombre.
StopInstance.waitForDeath=Esperando a que se pare la instancia
StopInstance.instanceNotDead=Se ha producido un timeout ({0} segundos) al esperar a que se parara el dominio.
## SynchronizeInstanceCommand
Sync.noDASConfigured=CLI800 Falta el archivo das.properties; se esperaba que estuviera aqu\u00ED: {0}
Sync.alreadySynced=CLI801 La instancia ya est\u00E1 sincronizada
Sync.dirFailed=CLI802 Fallo de sincronizaci\u00F3n del directorio {0}, causado por:\n  {1}
Sync.failed=CLI803 Fallo al sincronizar con DAS en el puerto {1} del host {0}
Sync.cantCreateSyncState=Advertencia: No se puede crear el archivo de estado de sincronizaci\u00F3n: {0}
Sync.cantDeleteSyncState=Advertencia: No se puede suprimir el archivo de estado de sincronizaci\u00F3n: {0}
Sync.cantCreateDirectory=Advertencia: No se puede crear el directorio: {0}
Sync.cantSetModTime=Advertencia: No se puede definir la hora de la \u00FAltima modificaci\u00F3n: {0}
Sync.cantDeleteTempFile=Advertencia: No se puede suprimir el archivo temporal: {0}
Sync.fullRequired=Fallo en la sincronizaci\u00F3n anterior en {0}\nSe realizar\u00E1 la sincronizaci\u00F3n completa.
Sync.connectFailed=Fallo al conectar con DAS durante la sincronizaci\u00F3n, causado por: {0}
## DeleteLocalInstanceCommand
DeleteInstance.running=La instancia se est\u00E1 ejecutando. P\u00E1rela y vuelva a ejecutar el comando.
DeleteInstance.noInstanceName=Debe especificar una instancia.
DeleteInstance.badWhack=No se ha podido suprimir el directorio de la instancia: {0}. El directorio sigue existiendo despu\u00E9s de intentar suprimirlo.
DeleteInstance.badWhackWithException=No se ha podido suprimir el directorio de la instancia {0}. \nSe ha devuelto esta IOException: {1) \n** RASTREO DE PILA **\n{2}
DeleteInstance.remoteError=Fallo al conectar con DAS en {0}:{1}.
DeleteInstance.noWhack=No existe el directorio de la instancia: {0}
DeleteInstance.noInstance=No existe la instancia en esta m\u00E1quina.
Config.badConfigNames=Debe especificar una configuraci\u00F3n de origen y de destino


restart.instanceNotRunning=El servidor no se est\u00E1 ejecutando; se intentar\u00E1 iniciarlo...
restart=Reiniciando la instancia...
restart.notRestartable=El servidor informa de que no se puede reiniciar. \nNormalmente esto significa que el archivo de contrase\u00F1as que se utilizaba originalmente para iniciar el servidor se ha suprimido o ya no se puede leer.\nPare y, a continuaci\u00F3n, inicie el servidor, o bien corrija el archivo de contrase\u00F1as.
restartChangeDebug=Reiniciando la instancia y definiendo expl\u00EDcitamente la depuraci\u00F3n en {0}...
#ImportSyncBundleCommand
noFile=No existe el archivo {0}.
import.sync.bundle.extractBundleFailed=No se ha podido extraer el contenido del grupo\n{0}\nen\n{1}.
import.sync.bundle.inboundPayloadFailed=No se ha podido leer el grupo\n{0}\n{1}.
import.sync.bundle.completeRegistrationFailed=DAS est\u00E1 fuera de l\u00EDnea. No se ha podido definir la propiedad rendezvousOccurred. Utilice el comando set para definir la propiedad rendezvousOccurred como true:\nset {0}.
import.sync.bundle.backupInstanceDirFailed=No se ha podido cambiar el nombre del directorio existente\n{0}\na\n{1}.
import.sync.bundle.deletedInstanceDir=Se ha suprimido el directorio existente:\n{0}
import.sync.bundle.closeStreamFailed=No se ha podido cerrar el flujo en el archivo\n{0}\n{1}
import.sync.bundle.invalidInstance=La instancia {0} no existe.
import.sync.bundle.domainXmlNotFound=No se ha encontrado domain.xml en {0}.
import.sync.bundle.createDirectoryFailed=No se ha podido crear el directorio {0}.
import.sync.bundle.restoreInstanceDirFailed=No se ha podido cambiar el nombre del directorio\n{0}\na\n{1}.

#SetupSshKey
KeySetupFailed=Fallo en la configuraci\u00F3n de la clave SSH: {0}
SSHPasswordPrompt=Introduzca la contrase\u00F1a remota para {0}@{1}>
SSHPasswordNotFound=No se ha encontrado el modo no interactivo ni la contrase\u00F1a SSH en el archivo de contrase\u00F1as.
SSHPassphrasePrompt=La clave {0} est\u00E1 cifrada\nIntroduzca la contrase\u00F1a de la clave>
GenerateKeyPairPrompt=No se ha encontrado la clave SSH para el usuario {0}\n\u00BFDesea generar un par de claves SSH (sin contrase\u00F1a de clave) para {0} a fin de acceder a {1}? [s/n]:
SSHAlreadySetup=La autenticaci\u00F3n de clave p\u00FAblica SSH ya est\u00E1 configurada para {0}@{1}
ConnFailed=Fallo al verificar la conexi\u00F3n.
#DomainMasterPasswordPrompt {0}=the name of the domain
DomainMasterPasswordPrompt=La contrase\u00F1a tiene un alias. Para obtener la contrase\u00F1a real, introduzca la contrase\u00F1a maestra para el almac\u00E9n de claves de {0}>
GetPasswordFailure=Fallo al obtener la contrase\u00F1a del almac\u00E9n de claves {0}.
PasswordAuthFailure=Fallo al autenticar mediante la contrase\u00F1a con alias almacenada en el almac\u00E9n de claves {0}.

#installNode
mkdir.failed=No se ha podido crear el directorio {0} en el host {1}
cannot.copy.zip.file=No se ha podido copiar el archivo zip {0} en el host {1}
jar.failed=Fallo en el comando jar al instalar GlassFish en el host {0}. Salida del comando {1}
fix.permissions.failed=No se han podido definir permisos en los comandos del directorio bin en el host {0} para la instalaci\u00F3n de GlassFish {1}
glassfish.install.check.failed=Se ha encontrado un problema al comprobar si la instalaci\u00F3n ya existe en el host remoto.

StopInstance.nopidprev=No se ha encontrado el ID de proceso del servidor. Se supone que debe estar aqu\u00ED: {0}. No se ha podido matar el proceso.
StopInstance.pidprevreaderror=Error al intentar leer el ID de proceso de {0}: {1}
CreateLocalInstance.errSetLastMod=Fallo al intentar definir la fecha de lastModified para {0}; no hay m\u00E1s informaci\u00F3n disponible

#change-master-password-node
instance.is.running=El servidor {0} se est\u00E1 ejecutando. Es necesario parar la instancia antes de que la contrase\u00F1a maestra se pueda cambiar.
## change-master-password-node
current.mp=Introduzca la contrase\u00F1a maestra actual>
no.console=No hay conexi\u00F3n con la consola; se cancelar\u00E1 el proceso.
incorrect.mp=Contrase\u00F1a maestra actual incorrecta. No podr\u00E1 cambiarla.
incorrect.old.mp=Contrase\u00F1a maestra anterior incorrecta. No podr\u00E1 cambiarla.
new.mp=Introduzca la nueva contrase\u00F1a maestra
new.mp.again=Vuelva a introducir la nueva contrase\u00F1a maestra
old.mp=Introduzca la contrase\u00F1a maestra anterior>
bad.node.dir=El nodo {0} no existe.
dry_run_msg=Volcado de la l\u00EDnea de llamada de JVM que se utilizar\u00E1 para iniciar:
dcom.error.unpacking=Fallo al desempaquetar la instalaci\u00F3n en la m\u00E1quina remota de Windows con DCOM.\nEl script remoto es {0}. Ha devuelto: {1}
remote.install.dir.already.gone=El directorio remoto ({0}) no existe. Nada que suprimir.
remote.install.dir.cant.delete=No se ha podido suprimir el directorio remoto: {0}. Supr\u00EDmalo manualmente.
install.dir.exists=El directorio de instalaci\u00F3n remota, {0}, ya existe. Utilice la opci\u00F3n --force para sobrescribirlo.
install.node.nolocal=install-node-dcom s\u00F3lo funciona en hosts remotos. {0} es esta computadora.
#####
##### vld
#####
vld.windows.only=Este comando es exclusivo de computadoras Windows.
vld.missing.dlls=Este comando ejecuta un programa de Windows nativo que necesita que se ejecuten otros archivos.  \nA continuaci\u00F3n se indican los archivos que faltan:\n{0}
vld.badtempdir=El directorio temporal proporcionado por Java (java.io.tmpdir), {0}, no es un directorio.
vld.app.exists=La herramienta DCOM ya existe ({0}) y no se puede suprimir.  \nSupr\u00EDmala manualmente y vuelva a ejecutar este comando.
vld.app.deleted=Esto es poco com\u00FAn. La aplicaci\u00F3n, {0}, ya existe. Se ha suprimido sin problema.
vld.error.extracting.ex=Error al intentar extraer la herramienta de configuraci\u00F3n de DCOM {0}\n{1}
vld.error.extracting=Error al intentar extraer la herramienta de configuraci\u00F3n de DCOM {0}
vld.areyousure=Atenci\u00F3n: este comando puede modificar los permisos de algunas claves del registro de Windows.\nAntes de ejecutar este comando, realice una copia de seguridad del registro de Windows.\nLa modificaci\u00F3n permite al usuario de Windows controlar por completo estas claves.\n\n\u00BFSeguro que desea editar el registro de Windows? Si es as\u00ED, introduzca s\u00ED de forma completa
vld.not.interactive=Este comando s\u00F3lo se puede ejecutar en modo interactivo.  \nAseg\u00FArese de que tiene definido en true el indicador interactivo. Consulte '--help' para obtener m\u00E1s informaci\u00F3n\nLa otra opci\u00F3n que puede utilizar es --force
vld.noconsole=Este comando s\u00F3lo se puede ejecutar desde una consola. Vuelva a intentarlo con una consola conectada.
vld.no=Ha decidido no ejecutar el comando.
internal.error=Error interno: {0}.
