#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


msg.JS.edJmsHost.passwordNotMatch=Les valeurs des mots de passe ne correspondent pas. Saisissez \u00E0 nouveau les mots de passe.
msg.jms.cannotDeleteDefault=Impossible de supprimer la ressource {0} car elle doit obligatoirement \u00EAtre configur\u00E9e dans le syst\u00E8me.


resourcesTable.connectionFactories=Fabriques de connexions

resourcesTable.colPoolName=Nom du pool
resourcesTable.colJndiName=Nom JNDI
resourcesTable.colDesc=Description
resourcesTable.colPool=Pool de connexions
resourcesTable.colEnabled=Activ\u00E9
resourcesTable.colResType=Type de ressource
resourcesTable.colDatasource=Nom de classe de la source de donn\u00E9es
resourcesTable.colDefinition=D\u00E9finition de connexion
resourcesTable.colResAdapter=Adaptateur de ressources
resourcesTable.Host=H\u00F4te

resourcesTable.deleteDestMessage=Les destinations JMS s\u00E9lectionn\u00E9es vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?
resourcesTable.deleteConnMessage=Les fabriques de connexion JMS s\u00E9lectionn\u00E9es vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?

resourcesTable.Pools=Pools
resourcesTable.destResources=Ressources de destination

#
# JMS Service
#
jms.ResourcesPageTitle=Ressources JMS
jms.Title=Service JMS
jms.PageHelp=Les propri\u00E9t\u00E9s g\u00E9n\u00E9rales du service JMS (Java Message Service) ne s'appliquent qu'au fournisseur JMS par d\u00E9faut du serveur d'applications, la file d'attente des messages GlassFish. Tous les autres fournisseurs de messagerie connect\u00E9s au serveur d'applications via des adaptateurs de ressources peuvent \u00EAtre configur\u00E9s \u00E0 l'aide des \u00E9crans de gestion des ressources du connecteur.
jms.AvailabilityLink=Cliquez <a href="/jms/jmsAvailabilityService.jsf?configName=#{configName}">ici</a> pour configurer la disponibilit\u00E9 JMS.
jms.Type=Type de service JMS :
jms.TypeHelp=Indique si le service JMS r\u00E9side sur un syst\u00E8me local ou distant. Acc\u00E9dez \u00E0 l'<a href="/jms/jmsAvailabilityService.jsf?configName=#{configName}">onglet Disponibilit\u00E9 JMS</a> pour configurer le cluster et le type de service JMS.
jms.Timeout=D\u00E9lai de d\u00E9marrage :
jms.TimeoutHelp=D\u00E9lai de d\u00E9marrage du service JMS
jms.Arguments=Arguments de d\u00E9marrage :
jms.ArgumentsHelp=Arguments de broker MQ pour le d\u00E9marrage du service JMS
jms.Reconnect=Reconnecter :
jms.ReconnectHelp=Indique si le serveur JMS tente de se reconnecter en cas de perte de la connexion
jms.Interval=Intervalle de reconnexion :
jms.IntervalHelp=Nombre de secondes entre chaque tentative de reconnexion
jms.Attempts=Tentatives de reconnexion :
jms.AttemptsHelp=Nombre de tentatives de reconnexion \u00E0 chaque adresse
jms.MasterBroker=Broker ma\u00EEtre :
jms.MasterBrokerHelp=Broker ma\u00EEtre dans un cluster de file d'attente des messages
jms.Host=H\u00F4te JMS par d\u00E9faut :
jms.HostHelp=Syst\u00E8me sur lequel le service JMS est ex\u00E9cut\u00E9

jms.AddressListBehavior=Comportement de la liste d'adresses :
jms.BehaviorHelp=Indique si les tentatives de connexions aux adresses sont effectu\u00E9es de mani\u00E8re s\u00E9quentielle ou al\u00E9atoire
jms.AddressListIterations=It\u00E9rations de la liste d'adresses :
jms.IterationsHelp=Nombre de fois que le service JMS parcourt la liste d'adresses pour \u00E9tablir (ou r\u00E9tablir) une connexion
jms.Scheme=Sch\u00E9ma MQ :
jms.SchemeHelp=Nom du sch\u00E9ma d'adresses de file d'attente des messages
jms.Service=Service MQ :
jms.ServiceHelp=Nom du service de connexion de file d'attente des messages
jms.Ping=Ping

## JMS Host
edJmsHost.EditJmsHost=Modifier un h\u00F4te JMS
edJmsHost.edJmsHostInfo=L'h\u00F4te JMS (Java Message Service) indique le syst\u00E8me sur lequel le service JMS est ex\u00E9cut\u00E9.
edJmsHost.jmsHostNameLabel=Nom :
edJmsHost.hostLabel=H\u00F4te :
edJmsHost.hostHelp=Nom ou adresse IP. Le nom ne doit contenir que des caract\u00E8res alphanum\u00E9riques, des traits de soulignement, des tirets ou des points
edJmsHost.portLabel=Port :
edJmsHost.portHelp=Port du processus d'\u00E9coute traitant les demandes JMS
edJmsHost.adminUserLabel=Nom utilisateur de l'administrateur :
edJmsHost.adminUserHelp=Nom utilisateur pour la maintenance du service JMS. Le nom peut comporter jusqu'\u00E0 255 caract\u00E8res et ne doit contenir que des caract\u00E8res alphanum\u00E9riques, des traits de soulignement, des tirets ou des points
edJmsHost.adminPwdLabel=Mot de passe de l'administrateur :
edJmsHost.adminPwdHelp=Mot de passe de l'administrateur JMS
edJmsHost.ConfirmNewPassword=Confirmer le nouveau mot de passe :
edJmsHost.colPort=Port
jmsHosts.TableTitle=H\u00F4tes
jmsHosts.colPort=Port
jmsHosts.ListPageTitle=H\u00F4tes JMS
jmsHosts.ListPageHelp=L'h\u00F4te JMS (Java Message Service) indique le syst\u00E8me sur lequel le service JMS est ex\u00E9cut\u00E9. Cliquez sur Nouveau pour cr\u00E9er un h\u00F4te JMS. Cliquez sur le nom d'un h\u00F4te JMS pour modifier ses propri\u00E9t\u00E9s.
newJmsHost.NewJmsHost=Nouvel h\u00F4te JMS
newJmsHost.NewPageHelp=L'h\u00F4te JMS (Java Message Service) indique le syst\u00E8me sur lequel le service JMS est ex\u00E9cut\u00E9.

## JMS Resources
jmsResources.pageTitle=Ressources JMS
jmsResources.pageTitleHelp=
jmsDestination.editPageTitle=Modifier une ressource de destination JMS
jmsDestination.editPageTitleHelp=La modification d'une ressource de destination JMS (Java Message Service) modifie \u00E9galement la ressource d'objet d'administration associ\u00E9e.
jmsDestination.newPageTitle=Nouvelle ressource de destination JMS
jmsDestination.newPageTitleHelp=La cr\u00E9ation d'une ressource de destination JMS (Java Message Service) entra\u00EEne \u00E9galement celle d'une ressource d'objet d'administration.
jmsDestination.targetPageTitle=Cibles de ressources de la destination JMS
jmsDestination.destName=Nom de la destination physique
jmsDestination.destNameHelp=Nom de destination du broker de file d'attente des messages. Si la destination n'existe pas, elle sera cr\u00E9\u00E9e automatiquement en cas de besoin.

destinationResources.pageTitle=Ressources de destination JMS
destinationResources.pageTitleHelp=Les destinations JMS servent \u00E0 stocker des messages. Cliquez sur Nouveau pour cr\u00E9er une ressource de destination. Cliquez sur le nom d'une ressource de destination pour modifier ses propri\u00E9t\u00E9s.
jmsResources.jmsConFact=Fabrique de connexions JMS
jmsResources.jmsDestRes=Ressource de destination JMS

#JMS Connection Factories
connectionFactories.pageTitle=Fabriques de connexions JMS
connectionFactories.pageTitleHelp=Les fabriques de connexions JMS (Java Message Service) sont des objets permettant \u00E0 une application de cr\u00E9er automatiquement d'autres objets JMS. Cliquez sur Nouveau pour cr\u00E9er une fabrique de connexions. Cliquez sur le nom d'une fabrique de connexions existante pour modifier ses propri\u00E9t\u00E9s.
connectionFactory.editPageTitle=Modifier une fabrique de connexions JMS
connectionFactory.editPageTitleHelp=La modification d'une fabrique de connexions JMS (Java Message Service) modifie \u00E9galement le pool de connexions et la ressource du connecteur associ\u00E9s.
connectionFactory.newPageTitle=Nouvelle fabrique de connexions JMS
connectionFactory.newPageTitleHelp=La cr\u00E9ation d'une fabrique de connexions JMS (Java Message Service) entra\u00EEne \u00E9galement celle d'un pool de connexions de connecteur pour la fabrique et d'une ressource de connecteur.
connectionFactory.targetPageTitle=Cibles de ressources des fabriques de connexions JMS

connectionFactory.poolSettings=Param\u00E8tres du pool
connectionFactory.closeAll=Fermer toutes les connexions
connectionFactory.onFail=Echec sur tout :
connectionFactory.onFailHelp=Fermez et r\u00E9tablissez toutes les connexions en cas d'\u00E9chec. Sinon, seules les connexions qui \u00E9taient utilis\u00E9es sont r\u00E9tablies
connectionFactory.conValidation=Validation de la connexion :
connectionFactory.conValidationHelp=Validez les connexions et autorisez le serveur \u00E0 se reconnecter en cas d'\u00E9chec
connectionFactory.transSupport=Prise en charge des transactions :
connectionFactory.transSupportHelp=Niveau de prise en charge des transactions. Remplacez l'attribut de prise en charge des transactions dans l'adaptateur de ressources en pr\u00E9servant une compatibilit\u00E9 descendante.
connectionFactory.initPoolSize=Taille initiale et minimale du pool :
connectionFactory.initPoolSizeHelp=Nombre minimal et initial de connexions g\u00E9r\u00E9es dans le pool
connectionFactory.maxPoolSize=Taille maximale du pool :
connectionFactory.maxPoolSizeHelp=Nombre maximal de connexions pouvant \u00EAtre cr\u00E9\u00E9es pour r\u00E9pondre aux demandes client
connectionFactory.poolResize=Valeur de redimensionnement du pool :
connectionFactory.poolResizeHelp=Nombre de connexions qui doivent \u00EAtre enlev\u00E9es \u00E0 l'expiration du d\u00E9lai d'inactivit\u00E9 du pool
connectionFactory.idleTimeout=D\u00E9lai d'inactivit\u00E9 :
connectionFactory.idleTimeoutHelp=D\u00E9lai maximal pendant lequel une connexion du pool peut rester inactive
connectionFactory.maxWait=Attente max. :
connectionFactory.maxWaitHelp=Dur\u00E9e pendant laquelle le programme appelant attend avant qu'une notification d'expiration de la connexion soit envoy\u00E9e

## Physical Destinations
jmsPhysDestinations.tableTitle=Destinations
jmsPhysDestinations.pageTitle=Destinations physiques JMS
jmsPhysDestinations.pageHelp=Les objets de destination physique JMS (Java Message Service) sont g\u00E9r\u00E9s par les brokers de file d'attente des messages. La file d'attente nomm\u00E9e mq.sys.dmq est la destination syst\u00E8me, vers laquelle les messages parvenus \u00E0 expiration et non remis sont redirig\u00E9s. Cliquez sur Nouveau pour cr\u00E9er une destination physique.
jmsPhysDestinations.newPageTitle=Nouvelle destination physique JMS
jmsPhysDestinations.newPageHelp=Les objets de destination physique JMS (Java Message Service) sont g\u00E9r\u00E9s par les brokers de file d'attente des messages.
jmsPhysDestinations.editPageTitle=Modifier la destination physique JMS
jmsPhysDestinations.editPageHelp=Les objets de destination physique JMS (Java Message Service) sont g\u00E9r\u00E9s par les brokers de file d'attente des messages.
jmsPhysDestinations.statsPageTitle=Afficher les statistiques de la destination physique JMS
jmsPhysDestinations.name=Nom :
jmsPhysDestinations.type=Type :

#this is a link, click on this will see more statistics for this JMS Physical Destination
jmsPhysDestinations.view=Afficher

jmsPhysDestinations.stats=Statistiques
jmsPhysDestinations.purge=Supprimer tous les messages
jmsPhysDestinations.purged=Supprimer tous les messages des destinations physiques


## Config attributes
jmsPhysDestinations.MaxNumMsgs=Nombre maximal de messages non distribu\u00E9s \u00E0 un destinataire :
jmsPhysDestinations.MaxNumMsgsHelp=Une valeur de -1 indique un nombre de messages illimit\u00E9

jmsPhysDestinations.MaxBytesPerMsg=Taille maximale d'un message :
jmsPhysDestinations.MaxBytesPerMsgHelp=Taille maximale d'un message quelconque, en octets. Une valeur de -1 indique une taille de message illimit\u00E9e.

jmsPhysDestinations.MaxTotalMsgBytes=M\u00E9moire totale maximale :
jmsPhysDestinations.MaxTotalMsgBytesHelp=M\u00E9moire totale maximale pour des messages non distribu\u00E9s \u00E0 un destinataire, en octets

jmsPhysDestinations.LimitBehavior=Comportement aux limites de seuil :
jmsPhysDestinations.LimitBehaviorHelp=Comportement du broker lorsque le seuil limite de la m\u00E9moire est atteint. Si la valeur est Rejeter les \u00E9l\u00E9ments les plus anciens ou Rejeter les messages dont la priorit\u00E9 est la plus basse, et que le param\u00E8tre Utiliser la file d'attente des messages bloqu\u00E9s est d\u00E9fini sur la valeur True, les messages en trop sont transf\u00E9r\u00E9s vers la file d'attente des messages bloqu\u00E9s.

jmsPhysDestinations.MaxNumProducers=Nombre maximal d'\u00E9metteurs :
jmsPhysDestinations.MaxNumProducersHelp=Nombre maximal d'\u00E9metteurs de messages associ\u00E9s. Lorsque cette limite est atteinte, aucun nouvel \u00E9metteur ne peut \u00EAtre cr\u00E9\u00E9. Une valeur de -1 indique un nombre d'\u00E9metteurs illimit\u00E9.

jmsPhysDestinations.MaxNumActiveConsumers= Nombre maximal de destinataires actifs :
jmsPhysDestinations.MaxNumActiveConsumersHelp= [Destinations de la file d'attente uniquement] Nombre maximal de destinataires actifs de messages associ\u00E9s dans la distribution \u00E0 charge \u00E9quilibr\u00E9e. Une valeur de -1 indique un nombre de destinataires illimit\u00E9.

jmsPhysDestinations.MaxNumBackupConsumers=Nombre maximal de destinataires de secours :
jmsPhysDestinations.MaxNumBackupConsumersHelp=Nombre maximal de destinataires de secours associ\u00E9s dans la distribution \u00E0 charge \u00E9quilibr\u00E9e. Une valeur de -1 indique un nombre de destinataires illimit\u00E9.

jmsPhysDestinations.ConsumerFlowLimit=Nombre maximal de messages lors de la distribution par batch :
jmsPhysDestinations.ConsumerFlowLimitHelp=Nombre maximal de messages distribu\u00E9s au destinataires dans un seul batch. Une valeur de -1 indique un nombre de messages illimit\u00E9.

jmsPhysDestinations.LocalDeliveryPreferred=Distribution locale pr\u00E9f\u00E9rable
jmsPhysDestinations.LocalDeliveryPreferredHelp=Cette propri\u00E9t\u00E9 s'applique uniquement \u00E0 la distribution \u00E0 charge \u00E9quilibr\u00E9e dans les clusters du broker. Si cette propri\u00E9t\u00E9 a la valeur True, les messages ne seront distribu\u00E9s aux destinataires distants que si aucun destinataire associ\u00E9 n'existe sur le broker local. La destination ne doit pas \u00EAtre limit\u00E9e \u00E0 la distribution locale (la valeur de LocalOnly doit \u00EAtre False).

jmsPhysDestinations.UseDMQ=Utiliser la file d'attente des messages bloqu\u00E9s :
jmsPhysDestinations.UseDMQHelp=Envoyer les messages bloqu\u00E9s vers la file d'attente des messages bloqu\u00E9s ? Si la valeur est False, les messages bloqu\u00E9s seront simplement rejet\u00E9s.

jmsPhysDestinations.ValidateXMLSchemaEnabled=Valider le sch\u00E9ma XML :
jmsPhysDestinations.ValidateXMLSchemaEnabledHelp=Si le param\u00E8tre a la valeur False ou n'est pas d\u00E9fini, la validation du sch\u00E9ma XML n'est pas activ\u00E9e pour la destination.

jmsPhysDestinations.XMLSchemaURIList=Liste des URI du sch\u00E9ma XML :
jmsPhysDestinations.XMLSchemaURIListHelp=Liste des cha\u00EEnes d'URI du document XSD (s\u00E9par\u00E9es par des espaces). Si cette option est activ\u00E9e, les URI pointent vers l'emplacement des XSD \u00E0 utiliser pour la validation du sch\u00E9ma XML.

// Monitoring attributes
jmsPhysDestinations.CreatedByAdmin=Cr\u00E9\u00E9 par l'administrateur
jmsPhysDestinations.CreatedByAdminHelp=Destination cr\u00E9\u00E9e par l'administrateur ?

jmsPhysDestinations.Temporary=Temporaire
jmsPhysDestinations.TemporaryHelp=Destination temporaire ?

jmsPhysDestinations.ConnectionID=Identifiant de connexion
jmsPhysDestinations.ConnectionIDHelp=Identifiant de connexion [Destinations temporaires uniquement]

jmsPhysDestinations.State=Etat
jmsPhysDestinations.StateHelp=Etat en cours

jmsPhysDestinations.StateLabel=Libell\u00E9 de l'\u00E9tat
jmsPhysDestinations.StateLabelHelp=Repr\u00E9sentation de cha\u00EEne de l'\u00E9tat en cours

jmsPhysDestinations.NumProducers=Nombre d'\u00E9metteurs
jmsPhysDestinations.NumProducersHelp=Nombre en cours d'\u00E9metteurs de messages associ\u00E9s

jmsPhysDestinations.NumConsumers=Nombre de destinataires
jmsPhysDestinations.NumConsumersHelp=Nombre en cours de destinataires de messages associ\u00E9s

jmsPhysDestinations.NumWildcardProducers=Nombre d'\u00E9metteurs avec caract\u00E8res g\u00E9n\u00E9riques
jmsPhysDestinations.NumWildcardProducersHelp=Nombre en cours d'\u00E9metteurs de messages avec caract\u00E8res g\u00E9n\u00E9riques associ\u00E9s \u00E0 la destination

jmsPhysDestinations.NumWildcardConsumers=Nombre de destinataires avec caract\u00E8res g\u00E9n\u00E9riques
jmsPhysDestinations.NumWildcardConsumersHelp=Nombre en cours de destinataires de messages avec caract\u00E8res g\u00E9n\u00E9riques associ\u00E9s \u00E0 la destination

jmsPhysDestinations.NumWildcards=Nombre d'\u00E9l\u00E9ments avec caract\u00E8res g\u00E9n\u00E9riques
jmsPhysDestinations.NumWildcardsHelp=Nombre en cours d'\u00E9metteurs et de destinataires de messages avec caract\u00E8res g\u00E9n\u00E9riques associ\u00E9s \u00E0 la destination

jmsPhysDestinations.PeakNumConsumers=Nombre maximal de destinataires
jmsPhysDestinations.PeakNumConsumersHelp=Nombre maximal de destinataires de messages associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.AvgNumConsumers=Nombre moyen de destinataires
jmsPhysDestinations.AvgNumConsumersHelp=Nombre moyen de destinataires de messages associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.NumActiveConsumers=Nombre de destinataires actifs
jmsPhysDestinations.NumActiveConsumersHelp=Nombre en cours de destinataires actifs de messages associ\u00E9s

jmsPhysDestinations.PeakNumActiveConsumers=Nombre maximal de destinataires actifs
jmsPhysDestinations.PeakNumActiveConsumersHelp=Nombre maximal de destinataires actifs de messages associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.AvgNumActiveConsumers=Nombre moyen de destinataires actifs
jmsPhysDestinations.AvgNumActiveConsumersHelp=Nombre moyen de destinataires actifs de messages associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.NumBackupConsumers=Nombre de destinataires de secours
jmsPhysDestinations.NumBackupConsumersHelp=Nombre en cours de destinataires de secours associ\u00E9s

jmsPhysDestinations.PeakNumBackupConsumers=Nombre maximal de destinataires de secours
jmsPhysDestinations.PeakNumBackupConsumersHelp=Nombre maximal de destinataires de secours associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.AvgNumBackupConsumers=Nombre moyen de destinataires de secours
jmsPhysDestinations.AvgNumBackupConsumersHelp=Nombre moyen de destinataires de secours associ\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.NumMsgs=Nombre de messages
jmsPhysDestinations.NumMsgsHelp=Nombre en cours de messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant. Cette valeur n'inclut pas les messages contenus dans les transactions.

jmsPhysDestinations.NumMsgsRemote=Nombre de messages distants
jmsPhysDestinations.NumMsgsRemoteHelp=Nombre en cours de messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant, qui ont \u00E9t\u00E9 \u00E9mis vers un broker distant dans un cluster. Cette valeur n'inclut pas les messages joints aux transactions.

jmsPhysDestinations.NumMsgsPendingAcks=Nombre de messages en attente de l'accus\u00E9 de r\u00E9ception
jmsPhysDestinations.NumMsgsPendingAcksHelp=Nombre en cours de messages conserv\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant en attente de l'accus\u00E9 de r\u00E9ception

jmsPhysDestinations.NumMsgsHeldInTransaction=Nombre de messages conserv\u00E9s dans la transaction
jmsPhysDestinations.NumMsgsHeldInTransactionHelp=Nombre en cours de messages contenus dans les transactions non valid\u00E9es, conserv\u00E9s en m\u00E9moire et dans l'emplacement persistant

jmsPhysDestinations.NextMessageID=ID de message suivant
jmsPhysDestinations.NextMessageIDHelp=ID de message JMS du prochain message \u00E0 distribuer \u00E0 un destinataire

jmsPhysDestinations.PeakNumMsgs=Nombre maximal de messages
jmsPhysDestinations.PeakNumMsgsHelp=Nombre maximal de messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant depuis le d\u00E9marrage du broker

jmsPhysDestinations.AvgNumMsgs=Nombre moyen de messages
jmsPhysDestinations.AvgNumMsgsHelp=Nombre moyen de messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant depuis le d\u00E9marrage du broker

jmsPhysDestinations.NumMsgsIn=Nombre de messages re\u00E7us
jmsPhysDestinations.NumMsgsInHelp=Nombre total de messages re\u00E7us depuis le d\u00E9marrage du broker

jmsPhysDestinations.NumMsgsOut=Nombre de messages envoy\u00E9s
jmsPhysDestinations.NumMsgsOutHelp=Nombre total de messages envoy\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.MsgBytesIn=Nombre d'octets re\u00E7us
jmsPhysDestinations.MsgBytesInHelp=Taille totale en octets des messages re\u00E7us depuis le d\u00E9marrage du broker

jmsPhysDestinations.MsgBytesOut=Nombre d'octets envoy\u00E9s
jmsPhysDestinations.MsgBytesOutHelp=Taille totale en octets des messages envoy\u00E9s depuis le d\u00E9marrage du broker

jmsPhysDestinations.PeakMsgBytes=Taille maximale de message
jmsPhysDestinations.PeakMsgBytesHelp=Taille en octets du message le plus lourd re\u00E7u depuis le d\u00E9marrage du broker

jmsPhysDestinations.TotalMsgBytes=Taille totale des messages en octets
jmsPhysDestinations.TotalMsgBytesHelp=Taille totale en octets des messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant. Cette valeur n'inclut pas les messages contenus dans les transactions.

jmsPhysDestinations.TotalMsgBytesRemote=Taille totale en octets des messages distants
jmsPhysDestinations.TotalMsgBytesRemoteHelp=Taille totale en octets des messages stock\u00E9s en m\u00E9moire et dans l'emplacement de stockage persistant, qui ont \u00E9t\u00E9 \u00E9mis vers un broker distant dans un cluster. Cette valeur n'inclut pas les messages joints aux transactions.

jmsPhysDestinations.TotalMsgBytesHeldInTransaction=Taille totale en octets des messages conserv\u00E9s dans la transaction
jmsPhysDestinations.TotalMsgBytesHeldInTransactionHelp=Taille totale en octets des messages contenus dans les transactions non valid\u00E9es, conserv\u00E9s en m\u00E9moire et dans l'emplacement persistant

## the following wasn't used in current implementation.
#jmsPhysDestinations.PeakTotalMsgBytes=Peak Total Message Size in Bytes
#jmsPhysDestinations.PeakTotalMsgBytesHelp=Peak total size in bytes of messages stored in memory and persistent store since broker started
#jmsPhysDestinations.AvgTotalMsgBytes=Average Total Message Size in Bytes
#jmsPhysDestinations.AvgTotalMsgBytesHelp=Average total size in bytes of messages stored in memory and persistent store since broker started
#jmsPhysDestinations.DiskReserved=Disk Reserved
#jmsPhysDestinations.DiskReservedHelp=Amount of disk space, in bytes, reserved for destination

jmsPhysDestinations.DiskUsed=Espace disque utilis\u00E9
jmsPhysDestinations.DiskUsedHelp=Quantit\u00E9 d'espace disque, en octets, actuellement utilis\u00E9e par la destination

jmsPhysDestinations.DiskUtilizationRatio=Taux d'utilisation de l'espace disque
jmsPhysDestinations.DiskUtilizationRatioHelp=Portion de l'espace disque actuellement utilis\u00E9e comme espace disque r\u00E9serv\u00E9 pour la destination

jmsPhysDestinations.REJECT_NEWEST=Rejeter les derniers messages en date
jmsPhysDestinations.FLOW_CONTROL=Ralentir les \u00E9metteurs
jmsPhysDestinations.REMOVE_OLDEST=Rejeter les \u00E9l\u00E9ments les plus anciens
jmsPhysDestinations.REMOVE_LOW_PRIORITY=Rejeter les messages dont la priorit\u00E9 est la plus basse

# JMS Availability Service
availability.jmsAvailability=Disponibilit\u00E9 JMS
availability.jmsAvailabilityInfo=Configurez la disponibilit\u00E9 du cluster JMS. Cliquez <a href="#{request.contextPath}/jms/jmsService.jsf?configName=#{configName}">ici</a> pour configurer le service JMS.
availability.jmsAvailabilityInfoHelp=<p><b>Attention :</b> avant d'utiliser cette page pour reconfigurer un cluster existant, suivez les proc\u00E9dures sp\u00E9ciales de migration vers un autre type de cluster du broker, d\u00E9crites dans <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">cette section</a> du manuel <i>High Availability Administration Guide</i>. Le non-respect de ces proc\u00E9dures sp\u00E9ciales peut entra\u00EEner la perte ou l'alt\u00E9ration des donn\u00E9es, voire rendre votre configuration inutilisable, selon les op\u00E9rations JMS ex\u00E9cut\u00E9es sur le cluster existant.
availability.configStoreType=Type d'emplacement de stockage de la configuration :
availability.configStoreTypeHelp=Type d'emplacement de stockage des donn\u00E9es de configuration dans un cluster conventionnel. La valeur masterbroker indique l'utilisation d'un broker ma\u00EEtre pour stocker et g\u00E9rer les donn\u00E9es de configuration. La valeur shareddb indique l'utilisation d'une base de donn\u00E9es partag\u00E9e pour stocker les donn\u00E9es de configuration. Cette option n'est pas prise en compte si la disponibilit\u00E9 activ\u00E9e est d\u00E9finie sur True.
availability.messageStoreType=Type d'emplacement de stockage des messages :
availability.messageStoreTypeHelp=Type d'emplacement de stockage des donn\u00E9es de messages des brokers dans un cluster conventionnel. La valeur file indique un emplacement de stockage sur fichier. La valeur jdbc indique un emplacement de stockage JDBC. Cette option n'est pas prise en compte si la disponibilit\u00E9 activ\u00E9e est d\u00E9finie sur True.
availability.dbVendor=Fournisseur de base de donn\u00E9es :
availability.dbVendorHelp=Fournisseur de la base de donn\u00E9es JDBC \u00E0 utiliser lorsque le service de disponibilit\u00E9 est activ\u00E9, que le type d'emplacement de stockage de la configuration est d\u00E9fini sur 'shareddb' ou que le type d'emplacement de stockage des messages est d\u00E9fini sur 'jdbc'.
availability.dbUserName=Nom utilisateur de la base de donn\u00E9es :
availability.dbUserNameHelp=Nom utilisateur de la base de donn\u00E9es JDBC \u00E0 employer lorsque le service de disponibilit\u00E9 est activ\u00E9, que le type d'emplacement de stockage de la configuration est d\u00E9fini sur 'shareddb' ou que le type d'emplacement de stockage des messages est d\u00E9fini sur 'jdbc'.
availability.dbPassword=Mot de passe de la base de donn\u00E9es :
availability.dbPasswordHelp=Mot de passe de la base donn\u00E9es JDBC \u00E0 utiliser lorsque le service de disponibilit\u00E9 est activ\u00E9, que le type d'emplacement de stockage de la configuration est d\u00E9fini sur 'shareddb' ou que le type d'emplacement de stockage des messages est d\u00E9fini sur 'jdbc'.
availability.dbUrl=URL d'acc\u00E8s \u00E0 la base de donn\u00E9es :
availability.dbUrlHelp=URL d'acc\u00E8s \u00E0 la base de donn\u00E9es JDBC \u00E0 utiliser lorsque le service de disponibilit\u00E9 est activ\u00E9, que le type d'emplacement de stockage de la configuration est d\u00E9fini sur 'shareddb' ou que le type d'emplacement de stockage des messages est d\u00E9fini sur 'jdbc'.
availability.instancesRunning=Toutes les instances utilisant cette configuration doivent \u00EAtre arr\u00EAt\u00E9es lors de la modification de ces param\u00E8tres.
