#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


msg.JS.edJmsHost.passwordNotMatch=Los valores de contrase\u00F1a no coinciden. Vuelva a introducir las contrase\u00F1as.
msg.jms.cannotDeleteDefault=El recurso {0} no se puede suprimir porque es necesario que est\u00E9 configurarlo en el sistema.


resourcesTable.connectionFactories=F\u00E1bricas de Conexiones

resourcesTable.colPoolName=Nombre de Pool
resourcesTable.colJndiName=Nombre JNDI
resourcesTable.colDesc=Descripci\u00F3n
resourcesTable.colPool=Pool de Conexiones
resourcesTable.colEnabled=Activado
resourcesTable.colResType=Tipo de Recurso
resourcesTable.colDatasource=Nombre de Clase de Origen de Datos
resourcesTable.colDefinition=Definici\u00F3n de Conexi\u00F3n
resourcesTable.colResAdapter=Adaptador de Recursos
resourcesTable.Host=Host

resourcesTable.deleteDestMessage=Se suprimir\u00E1n los destinos JMS seleccionados. \u00BFDesea continuar?
resourcesTable.deleteConnMessage=Se suprimir\u00E1n las f\u00E1bricas de conexiones JMS seleccionadas. \u00BFDesea continuar?

resourcesTable.Pools=Pools
resourcesTable.destResources=Recursos de Destino

#
# JMS Service
#
jms.ResourcesPageTitle=Recursos JMS
jms.Title=Java Message Service
jms.PageHelp=Las propiedades generales del servicio Java Message Service (JMS) se aplican s\u00F3lo al proveedor JMS por defecto del servidor de aplicaciones, GlassFish Message Queue. Los restantes proveedores de mensajer\u00EDa conectados al servidor de aplicaciones mediante adaptadores de recursos se pueden configurar con las pantallas de los recursos del conector.
jms.AvailabilityLink=Haga clic <a href="/jms/jmsAvailabilityService.jsf?configName=#{configName}">aqu\u00ED</a> para configurar Disponibilidad de JMS.
jms.Type=Tipo de Servicio JMS:
jms.TypeHelp=Especifica si el servicio JMS est\u00E1 en un sistema local o remoto. Vaya a la ficha <a href="/jms/jmsAvailabilityService.jsf?configName=#{configName}">Disponibilidad JMS</a> para configurar el tipo y cluster de servicio JMS.
jms.Timeout=Timeout de Inicio:
jms.TimeoutHelp=Tiempo de espera para que se inicie el servicio JMS
jms.Arguments=Argumentos de Inicio:
jms.ArgumentsHelp=Argumentos del broker de MQ para iniciar el servicio JMS
jms.Reconnect=Volver a Conectar:
jms.ReconnectHelp=Especifica si el servicio JMS intenta volver establecer la conexi\u00F3n cuando se ha perdido
jms.Interval=Intervalo de Reconexi\u00F3n:
jms.IntervalHelp=N\u00FAmero de segundos entre intentos de reconexi\u00F3n
jms.Attempts=Intentos de Reconexi\u00F3n:
jms.AttemptsHelp=N\u00FAmero de intentos de reconexi\u00F3n para cada direcci\u00F3n
jms.MasterBroker=Broker Maestro:
jms.MasterBrokerHelp=Broker maestro en un cluster de cola de mensajes
jms.Host=Host JMS por Defecto:
jms.HostHelp=Sistema en el que se est\u00E1 ejecutando el servicio JMS

jms.AddressListBehavior=Comportamiento de Lista de Direcciones:
jms.BehaviorHelp=Especifica si se intentar\u00E1 establecer conexi\u00F3n con las direcciones de forma aleatoria u ordenada
jms.AddressListIterations=Iteraciones de Lista de Direcciones:
jms.IterationsHelp=N\u00FAmero de veces que el servicio de JMS se repite en la lista de direcciones al intentar establecer (o restablecer) una conexi\u00F3n
jms.Scheme=Esquema MQ:
jms.SchemeHelp=Nombre de esquema de la direcci\u00F3n de Message Queue
jms.Service=Servicio MQ:
jms.ServiceHelp=Nombre del servicio de la conexi\u00F3n a Message Queue
jms.Ping=Ping

## JMS Host
edJmsHost.EditJmsHost=Editar Host JMS
edJmsHost.edJmsHostInfo=El host JMS (Java Message Service) especifica el sistema en el que se est\u00E1 ejecutando el servicio JMS.
edJmsHost.jmsHostNameLabel=Nombre:
edJmsHost.hostLabel=Host:
edJmsHost.hostHelp=Nombre o direcci\u00F3n IP; si se especifica el nombre, \u00E9ste s\u00F3lo debe contener caracteres alfanum\u00E9ricos, de subrayado, guiones o puntos
edJmsHost.portLabel=Puerto:
edJmsHost.portHelp=Puerto de listener para servicio de solicitudes JMS
edJmsHost.adminUserLabel=Nombre de Usuario Administrador:
edJmsHost.adminUserHelp=Nombre de usuario para mantener el servicio JMS; puede incluir hasta 255 caracteres y s\u00F3lo debe contener caracteres alfanum\u00E9ricos, de subrayado, guiones o puntos
edJmsHost.adminPwdLabel=Contrase\u00F1a de Administrador:
edJmsHost.adminPwdHelp=Contrase\u00F1a de administrador JMS
edJmsHost.ConfirmNewPassword=Confirmar Contrase\u00F1a Nueva:
edJmsHost.colPort=Puerto
jmsHosts.TableTitle=Hosts
jmsHosts.colPort=Puerto
jmsHosts.ListPageTitle=Hosts JMS
jmsHosts.ListPageHelp=El host JMS (Java Message Service) especifica el sistema en el que se est\u00E1 ejecutando el servicio JMS. Haga clic en Nuevo para crear un nuevo host JMS. Haga clic en el nombre de un host JMS para modificar sus propiedades.
newJmsHost.NewJmsHost=Nuevo Host JMS
newJmsHost.NewPageHelp=El host JMS (Java Message Service) especifica el sistema en el que se est\u00E1 ejecutando el servicio JMS.

## JMS Resources
jmsResources.pageTitle=Recursos JMS
jmsResources.pageTitleHelp=
jmsDestination.editPageTitle=Editar Recurso de Destino JMS
jmsDestination.editPageTitleHelp=Al editar un recurso de destino JMS (Java Message Service), tambi\u00E9n se modifica el recurso de objeto de administraci\u00F3n asociado.
jmsDestination.newPageTitle=Nuevo Recurso de Destino JMS
jmsDestination.newPageTitleHelp=Al crear un nuevo recurso de destino JMS (Java Message Service), tambi\u00E9n se crea un recurso de objeto de administraci\u00F3n.
jmsDestination.targetPageTitle=Destinos de Recurso de Destino JMS
jmsDestination.destName=Nombre de Destino F\u00EDsico
jmsDestination.destNameHelp=Nombre de destino en el broker de Message Queue. Si el destino no existe, se crear\u00E1 autom\u00E1ticamente cuando sea necesario.

destinationResources.pageTitle=Recursos de Destino JMS
destinationResources.pageTitleHelp=Los destinos JMS act\u00FAan como repositorios para los mensajes. Haga clic en Nuevo para crear un nuevo recurso de destino. Haga clic en el nombre de un recurso de destino para modificar sus propiedades.
jmsResources.jmsConFact=F\u00E1brica de Conexiones JMS
jmsResources.jmsDestRes=Recurso de Destino JMS

#JMS Connection Factories
connectionFactories.pageTitle=F\u00E1bricas de Conexiones JMS
connectionFactories.pageTitleHelp=Las f\u00E1bricas de conexiones JMS (Java Message Service) son objetos que permiten que una aplicaci\u00F3n cree otros objetos JMS mediante programaci\u00F3n. Haga clic en Nuevo para crear una nueva f\u00E1brica de conexiones. Haga clic en el nombre de una f\u00E1brica de conexiones para modificar sus propiedades.
connectionFactory.editPageTitle=Editar F\u00E1brica de Conexiones JMS
connectionFactory.editPageTitleHelp=Al editar una f\u00E1brica de conexiones JMS (Java Message Service), tambi\u00E9n se modifican el pool de conexiones y el recurso del conector asociado.
connectionFactory.newPageTitle=Nueva F\u00E1brica de Conexiones JMS
connectionFactory.newPageTitleHelp=Al crear una nueva f\u00E1brica de conexiones JMS (Java Message Service), tambi\u00E9n se crean un pool de conexiones del conector para la f\u00E1brica y un recurso del conector.
connectionFactory.targetPageTitle=Destinos de Recurso de F\u00E1bricas de Conexiones JMS

connectionFactory.poolSettings=Configuraci\u00F3n de Pool
connectionFactory.closeAll=Cerrar Todas las Conexiones
connectionFactory.onFail=Ante Cualquier Fallo:
connectionFactory.onFailHelp=Cierra todas las conexiones y vuelve a conectar en caso de fallo; en caso contrario, vuelve a conectar s\u00F3lo cuando se utilicen
connectionFactory.conValidation=Validaci\u00F3n de Conexi\u00F3n:
connectionFactory.conValidationHelp=Valida las conexiones y permite al servidor volver a conectar en caso de fallo
connectionFactory.transSupport=Soporte de Transacci\u00F3n:
connectionFactory.transSupportHelp=Nivel de soporte de transacci\u00F3n. Sobrescribe el atributo de soporte de la transacci\u00F3n en el adaptador de recursos de forma descendente compatible.
connectionFactory.initPoolSize=Tama\u00F1o de Pool Inicial y M\u00EDnimo:
connectionFactory.initPoolSizeHelp=N\u00FAmero m\u00EDnimo e inicial de conexiones mantenidas en el pool
connectionFactory.maxPoolSize=Tama\u00F1o de Pool M\u00E1ximo:
connectionFactory.maxPoolSizeHelp=N\u00FAmero m\u00E1ximo de conexiones que se pueden crear para responder a las solicitudes del cliente
connectionFactory.poolResize=Cantidad de Cambio de Tama\u00F1o del Pool:
connectionFactory.poolResizeHelp=N\u00FAmero de conexiones que se van a eliminar cuando caduque el timeout de inactividad del pool
connectionFactory.idleTimeout=Timeout de Inactividad:
connectionFactory.idleTimeoutHelp=Tiempo m\u00E1ximo que una conexi\u00F3n puede permanecer inactiva en el pool
connectionFactory.maxWait=Tiempo de Espera M\u00E1ximo:
connectionFactory.maxWaitHelp=Tiempo que espera el emisor de la llamada antes de que se env\u00EDe un mensaje de timeout de conexi\u00F3n

## Physical Destinations
jmsPhysDestinations.tableTitle=Destinos
jmsPhysDestinations.pageTitle=Destinos F\u00EDsicos JMS
jmsPhysDestinations.pageHelp=Los brokers de Message Queue conservan los objetos de destino f\u00EDsico de JMS (Java Message Service). La cola con el nombre mq.sys.dmq es el destino del sistema al que se redireccionan los mensajes caducados y no enviados. Haga clic en Nuevo para crear un nuevo destino f\u00EDsico.
jmsPhysDestinations.newPageTitle=Nuevo Destino F\u00EDsico JMS
jmsPhysDestinations.newPageHelp=Los brokers de Message Queue conservan los objetos de destino f\u00EDsico de JMS (Java Message Service).
jmsPhysDestinations.editPageTitle=Editar Destino F\u00EDsico JMS
jmsPhysDestinations.editPageHelp=Los brokers de Message Queue conservan los objetos de destino f\u00EDsico de JMS (Java Message Service).
jmsPhysDestinations.statsPageTitle=Ver Estad\u00EDsticas de Destino F\u00EDsico JMS
jmsPhysDestinations.name=Nombre:
jmsPhysDestinations.type=Tipo:

#this is a link, click on this will see more statistics for this JMS Physical Destination
jmsPhysDestinations.view=Ver

jmsPhysDestinations.stats=Estad\u00EDsticas
jmsPhysDestinations.purge=Suprimir todos los mensajes
jmsPhysDestinations.purged=Suprimir todos los mensajes correctos para los destinos f\u00EDsicos


## Config attributes
jmsPhysDestinations.MaxNumMsgs=N\u00FAmero M\u00E1ximo de Mensajes No Consumidos:
jmsPhysDestinations.MaxNumMsgsHelp=El valor -1 indica un n\u00FAmero ilimitado de mensajes

jmsPhysDestinations.MaxBytesPerMsg=Tama\u00F1o M\u00E1ximo de Mensaje:
jmsPhysDestinations.MaxBytesPerMsgHelp=Tama\u00F1o m\u00E1ximo, en bytes, de cualquier mensaje \u00FAnico. Un valor de -1 indica un tama\u00F1o de mensaje ilimitado.

jmsPhysDestinations.MaxTotalMsgBytes=Memoria M\u00E1xima Total:
jmsPhysDestinations.MaxTotalMsgBytesHelp=Memoria m\u00E1xima total, en bytes, para los mensajes no consumidos

jmsPhysDestinations.LimitBehavior=Comportamiento L\u00EDmite de Umbral:
jmsPhysDestinations.LimitBehaviorHelp=Comportamiento del broker cuando se ha alcanzado el umbral de memoria l\u00EDmite. Si el valor es "Rechazar los m\u00E1s antiguos" o "Rechazar los mensajes con prioridad m\u00E1s baja" y el valor Usar Cola de Mensajes Inoperativos se define en true, los mensajes sobrantes se pasar\u00E1n a la cola de mensajes inoperativos.

jmsPhysDestinations.MaxNumProducers=N\u00FAmero M\u00E1ximo de Productores:
jmsPhysDestinations.MaxNumProducersHelp=N\u00FAmero m\u00E1ximo de productores de mensajes asociados. Cuando se alcanza este l\u00EDmite, no se pueden crear productores nuevos. Un valor de -1 indica un n\u00FAmero de productores ilimitado.

jmsPhysDestinations.MaxNumActiveConsumers= Consumidores Activos M\u00E1ximos:
jmsPhysDestinations.MaxNumActiveConsumersHelp= [S\u00F3lo destinos de cola] N\u00FAmero m\u00E1ximo de consumidores de mensajes activos asociados en entrega con carga equilibrada. Un valor de -1 indica un n\u00FAmero de consumidores ilimitado.

jmsPhysDestinations.MaxNumBackupConsumers=N\u00FAmero M\u00E1ximo de Consumidores de Copia de Seguridad:
jmsPhysDestinations.MaxNumBackupConsumersHelp=N\u00FAmero m\u00E1ximo de consumidores de mensajes de copia de seguridad asociados en entrega con carga equilibrada. Un valor de -1 indica un n\u00FAmero de consumidores ilimitado.

jmsPhysDestinations.ConsumerFlowLimit=Recuento M\u00E1ximo de Mensajes de Entrega de Lotes:
jmsPhysDestinations.ConsumerFlowLimitHelp=N\u00FAmero m\u00E1ximo de mensajes entregados al consumidor en un \u00FAnico lote. Un valor de -1 indica un n\u00FAmero de mensajes ilimitado.

jmsPhysDestinations.LocalDeliveryPreferred=Es Preferible una Entrega Local
jmsPhysDestinations.LocalDeliveryPreferredHelp=Esta propiedad s\u00F3lo es aplicable a la entrega con equilibrio de carga en clusters de broker. Si se define en true, los mensajes se entregar\u00E1n a los consumidores remotos s\u00F3lo si no hay consumidores asociados en el broker local. El destino no se debe restringir s\u00F3lo a entrega local (LocalOnly debe ser false).

jmsPhysDestinations.UseDMQ=Usar Cola de Mensajes Inoperativos:
jmsPhysDestinations.UseDMQHelp=\u00BFEnviar mensajes inoperativos a cola de mensajes inoperativos? Si es false, los mensajes inoperativos simplemente se descartar\u00E1n.

jmsPhysDestinations.ValidateXMLSchemaEnabled=Validar Esquema XML:
jmsPhysDestinations.ValidateXMLSchemaEnabledHelp=Si se define en false o no se define ning\u00FAn valor, la validaci\u00F3n de esquema XML no se activa para el destino.

jmsPhysDestinations.XMLSchemaURIList=Lista de URI de Esquema XML:
jmsPhysDestinations.XMLSchemaURIListHelp=Lista separada por espacios de cadenas URI de documento de esquema XML (XSD). Los URI apuntan a la ubicaci\u00F3n de uno o varios XSD para su uso con la validaci\u00F3n de esquema XML, si est\u00E1 activada.

// Monitoring attributes
jmsPhysDestinations.CreatedByAdmin=Creado por Administrador
jmsPhysDestinations.CreatedByAdminHelp=\u00BFDestino creado por el administrador?

jmsPhysDestinations.Temporary=Temporal
jmsPhysDestinations.TemporaryHelp=\u00BFDestino temporal?

jmsPhysDestinations.ConnectionID=Identificador de Conexi\u00F3n
jmsPhysDestinations.ConnectionIDHelp=Identificador de conexi\u00F3n [s\u00F3lo destinos temporales]

jmsPhysDestinations.State=Estado
jmsPhysDestinations.StateHelp=Estado actual

jmsPhysDestinations.StateLabel=Etiqueta de Estado
jmsPhysDestinations.StateLabelHelp=Representaci\u00F3n de cadenas del estado actual

jmsPhysDestinations.NumProducers=N\u00FAmero de Productores
jmsPhysDestinations.NumProducersHelp=N\u00FAmero actual de productores de mensajes asociados

jmsPhysDestinations.NumConsumers=N\u00FAmero de Consumidores
jmsPhysDestinations.NumConsumersHelp=N\u00FAmero actual de consumidores de mensajes asociados

jmsPhysDestinations.NumWildcardProducers=N\u00FAmero de Productores de Comodines
jmsPhysDestinations.NumWildcardProducersHelp=N\u00FAmero actual de productores de mensajes comodines asociados al destino

jmsPhysDestinations.NumWildcardConsumers=N\u00FAmero de Consumidores de Comodines
jmsPhysDestinations.NumWildcardConsumersHelp=N\u00FAmero actual de consumidores de mensajes comodines asociados al destino

jmsPhysDestinations.NumWildcards=N\u00FAmero de Comodines
jmsPhysDestinations.NumWildcardsHelp=N\u00FAmero actual de productores de mensajes comodines y consumidores de mensajes comodines asociados al destino

jmsPhysDestinations.PeakNumConsumers=N\u00FAmero M\u00E1ximo de Consumidores
jmsPhysDestinations.PeakNumConsumersHelp=N\u00FAmero m\u00E1ximo de consumidores de mensajes asociados desde que se ha iniciado el broker

jmsPhysDestinations.AvgNumConsumers=N\u00FAmero Medio de Consumidores
jmsPhysDestinations.AvgNumConsumersHelp=N\u00FAmero medio de consumidores de mensajes asociados desde que se ha iniciado el broker

jmsPhysDestinations.NumActiveConsumers=N\u00FAmero de Consumidores Activos
jmsPhysDestinations.NumActiveConsumersHelp=N\u00FAmero actual de consumidores de mensajes activos asociado

jmsPhysDestinations.PeakNumActiveConsumers=N\u00FAmero M\u00E1ximo de Consumidores Activos
jmsPhysDestinations.PeakNumActiveConsumersHelp=N\u00FAmero m\u00E1ximo de consumidores de mensajes activos asociados desde que se ha iniciado el broker

jmsPhysDestinations.AvgNumActiveConsumers=N\u00FAmero Medio de Consumidores Activos
jmsPhysDestinations.AvgNumActiveConsumersHelp=N\u00FAmero medio de consumidores de mensajes activos asociados desde que se ha iniciado el broker

jmsPhysDestinations.NumBackupConsumers=N\u00FAmero de Consumidores de Copia de Seguridad
jmsPhysDestinations.NumBackupConsumersHelp=N\u00FAmero actual de consumidores de mensajes de copia de seguridad asociados

jmsPhysDestinations.PeakNumBackupConsumers=N\u00FAmero M\u00E1ximo de Consumidores de Copia de Seguridad
jmsPhysDestinations.PeakNumBackupConsumersHelp=N\u00FAmero m\u00E1ximo de consumidores de mensajes de copia de seguridad asociados desde que se ha iniciado el broker

jmsPhysDestinations.AvgNumBackupConsumers=N\u00FAmero Medio de Consumidores de Copia de Seguridad
jmsPhysDestinations.AvgNumBackupConsumersHelp=N\u00FAmero medio de consumidores de mensajes de copia de seguridad asociados desde que se ha iniciado el broker

jmsPhysDestinations.NumMsgs=N\u00FAmero de Mensajes
jmsPhysDestinations.NumMsgsHelp=N\u00FAmero actual de mensajes almacenados en memoria y en el almac\u00E9n persistente. Este valor no incluye los mensajes mantenidos en transacciones.

jmsPhysDestinations.NumMsgsRemote=N\u00FAmero de Mensajes Remotos
jmsPhysDestinations.NumMsgsRemoteHelp=N\u00FAmero actual de mensajes almacenados en memoria y en el almac\u00E9n persistente producidos para un broker remoto en un cluster. Este valor no incluye mensajes incluidos en transacciones.

jmsPhysDestinations.NumMsgsPendingAcks=N\u00FAmero de Mensajes Pendientes de Confirmaci\u00F3n
jmsPhysDestinations.NumMsgsPendingAcksHelp=N\u00FAmero actual de mensajes mantenidos en memoria y en el almac\u00E9n persistente pendientes de confirmaci\u00F3n

jmsPhysDestinations.NumMsgsHeldInTransaction=N\u00FAmero de Mensajes Mantenidos en Transacci\u00F3n
jmsPhysDestinations.NumMsgsHeldInTransactionHelp=N\u00FAmero actual de mensajes mantenidos en memoria y en el almac\u00E9n persistente en transacciones no confirmadas

jmsPhysDestinations.NextMessageID=ID de Mensaje Siguiente
jmsPhysDestinations.NextMessageIDHelp=ID de mensaje JMS del mensaje siguiente que se va a entregar a cualquier consumidor

jmsPhysDestinations.PeakNumMsgs=N\u00FAmero M\u00E1ximo de Mensajes
jmsPhysDestinations.PeakNumMsgsHelp=N\u00FAmero m\u00E1ximo de mensajes almacenados en memoria y en el almac\u00E9n persistente desde que se ha iniciado el broker

jmsPhysDestinations.AvgNumMsgs=N\u00FAmero Medio de Mensajes
jmsPhysDestinations.AvgNumMsgsHelp=N\u00FAmero medio de mensajes almacenados en memoria y en el almac\u00E9n persistente desde que se ha iniciado el broker

jmsPhysDestinations.NumMsgsIn=N\u00FAmero de Mensajes Recibidos
jmsPhysDestinations.NumMsgsInHelp=N\u00FAmero acumulado de mensajes recibidos desde que se ha iniciado el broker

jmsPhysDestinations.NumMsgsOut=N\u00FAmero de Mensajes Enviados
jmsPhysDestinations.NumMsgsOutHelp=N\u00FAmero acumulado de mensajes enviados desde que se ha iniciado el broker

jmsPhysDestinations.MsgBytesIn=N\u00FAmero de Bytes Recibidos
jmsPhysDestinations.MsgBytesInHelp=Tama\u00F1o en bytes acumulado de mensajes recibidos desde que se ha iniciado el broker

jmsPhysDestinations.MsgBytesOut=N\u00FAmero de Bytes Enviados
jmsPhysDestinations.MsgBytesOutHelp=Tama\u00F1o en bytes acumulado de mensajes enviados desde que se ha iniciado el broker

jmsPhysDestinations.PeakMsgBytes=Tama\u00F1o M\u00E1ximo de Mensaje
jmsPhysDestinations.PeakMsgBytesHelp=Tama\u00F1o en bytes del mayor mensaje \u00FAnico recibido desde que se ha iniciado el broker

jmsPhysDestinations.TotalMsgBytes=Tama\u00F1o Total de Mensaje en Bytes
jmsPhysDestinations.TotalMsgBytesHelp=Tama\u00F1o total actual en bytes de los mensajes almacenados en memoria y en el almac\u00E9n persistente. Este valor no incluye los mensajes mantenidos en transacciones.

jmsPhysDestinations.TotalMsgBytesRemote=Tama\u00F1o Total de Mensajes Remotos en Bytes
jmsPhysDestinations.TotalMsgBytesRemoteHelp=Tama\u00F1o total actual en bytes de los mensajes almacenados en memoria y en el almac\u00E9n persistente que se han producido para un broker remoto en un cluster. Este valor no incluye mensajes incluidos en transacciones.

jmsPhysDestinations.TotalMsgBytesHeldInTransaction=Tama\u00F1o Total de Mensaje en Bytes Mantenido en la Transacci\u00F3n
jmsPhysDestinations.TotalMsgBytesHeldInTransactionHelp=Tama\u00F1o total actual en bytes de mensajes mantenidos en memoria y en el almac\u00E9n persistente en transacciones no confirmadas

## the following wasn't used in current implementation.
#jmsPhysDestinations.PeakTotalMsgBytes=Peak Total Message Size in Bytes
#jmsPhysDestinations.PeakTotalMsgBytesHelp=Peak total size in bytes of messages stored in memory and persistent store since broker started
#jmsPhysDestinations.AvgTotalMsgBytes=Average Total Message Size in Bytes
#jmsPhysDestinations.AvgTotalMsgBytesHelp=Average total size in bytes of messages stored in memory and persistent store since broker started
#jmsPhysDestinations.DiskReserved=Disk Reserved
#jmsPhysDestinations.DiskReservedHelp=Amount of disk space, in bytes, reserved for destination

jmsPhysDestinations.DiskUsed=Disco Usado
jmsPhysDestinations.DiskUsedHelp=Cantidad de espacio en disco, en bytes, que utiliza actualmente el destino

jmsPhysDestinations.DiskUtilizationRatio=Ratio de Utilizaci\u00F3n de Disco
jmsPhysDestinations.DiskUtilizationRatioHelp=Ratio entre el espacio en disco actualmente en uso y el espacio en disco reservado para destino

jmsPhysDestinations.REJECT_NEWEST=Rechazar los mensajes m\u00E1s recientes
jmsPhysDestinations.FLOW_CONTROL=Ralentizar productores
jmsPhysDestinations.REMOVE_OLDEST=Rechazar los m\u00E1s antiguos
jmsPhysDestinations.REMOVE_LOW_PRIORITY=Rechazar los mensajes con prioridad m\u00E1s baja

# JMS Availability Service
availability.jmsAvailability=Disponibilidad de JMS
availability.jmsAvailabilityInfo=Configure la disponibilidad del cluster JMS. Haga clic <a href="#{request.contextPath}/jms/jmsService.jsf?configName=#{configName}">aqu\u00ED</a> para configurar el servicio JMS.
availability.jmsAvailabilityInfoHelp=<p><b>Precauci\u00F3n:</b> antes de utilizar esta p\u00E1gina para volver a configurar un cluster existente, siga los procedimientos especiales para migrar a otro tipo de cluster broker, como se describe <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">aqu\u00ED</a> en la <i>High Availability Administration Guide</i> (Gu\u00EDa de Administraci\u00F3n de Alta Disponibilidad). Si no se realizan estos procedimientos especiales, se puede producir una p\u00E9rdida y corrupci\u00F3n de datos e incluso invalidar la configuraci\u00F3n, en funci\u00F3n de las operaciones de JMS realizadas en el cluster existente.
availability.configStoreType=Tipo de Almac\u00E9n de Configuraci\u00F3n:
availability.configStoreTypeHelp=Tipo de almac\u00E9n de datos para los datos de configuraci\u00F3n en un cluster convencional. El valor masterbroker especifica el uso de un broker maestro para almacenar y gestionar los datos de configuraci\u00F3n. El valor shareddb especifica el uso de una base de datos compartida para almacenar los datos de configuraci\u00F3n. Esta opci\u00F3n se ignora si la disponibilidad activada se define en true.
availability.messageStoreType=Tipo de Almac\u00E9n de Mensajes:
availability.messageStoreTypeHelp=Tipo de almac\u00E9n de datos para los datos de mensaje en brokers de un cluster convencional. El valor file especifica un almac\u00E9n de archivos. El valor jdbc especifica un almac\u00E9n de JDBC. Esta opci\u00F3n se ignora si la disponibilidad activada se define en true.
availability.dbVendor=Proveedor de Base de Datos:
availability.dbVendorHelp=Proveedor de la base de datos de JDBC que se utilizar\u00E1 cuando el servicio de disponibilidad est\u00E9 activado, Tipo de Almac\u00E9n de Configuraci\u00F3n est\u00E9 definido en 'shareddb' o Tipo de Almac\u00E9n de Mensajes est\u00E9 definido en 'jdbc'.
availability.dbUserName=Nombre de Usuario de Base de Datos:
availability.dbUserNameHelp=Nombre de usuario de la base de datos de JDBC que se utilizar\u00E1 cuando el servicio de disponibilidad est\u00E9 activado, Tipo de Almac\u00E9n de Configuraci\u00F3n est\u00E9 definido en 'shareddb' o Tipo de Almac\u00E9n de Mensajes est\u00E9 definido en 'jdbc'.
availability.dbPassword=Contrase\u00F1a de Base de Datos:
availability.dbPasswordHelp=Contrase\u00F1a de base de datos de la base de datos de JDBC que se utilizar\u00E1 cuando el servicio de disponibilidad est\u00E9 activado, Tipo de Almac\u00E9n de Configuraci\u00F3n est\u00E9 definido en 'shareddb' o Tipo de Almac\u00E9n de Mensajes est\u00E9 definido en 'jdbc'.
availability.dbUrl=URL de Acceso a Base de Datos:
availability.dbUrlHelp=URL de acceso a base de datos de la base de datos de JDBC que se utilizar\u00E1 cuando el servicio de disponibilidad est\u00E9 activado, Tipo de Almac\u00E9n de Configuraci\u00F3n est\u00E9 definido en 'shareddb' o Tipo de Almac\u00E9n de Mensajes est\u00E9 definido en 'jdbc'.
availability.instancesRunning=Todas las instancias que utilizan esta configuraci\u00F3n se deben parar al cambiar esta configuraci\u00F3n.
