#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


# To change this template, choose Tools | Templates
# and open the template in the editor.

internalError=Erreur interne :
noInstallDir=Erreur interne : le r\u00E9pertoire d''installation est introuvable. Recherche de : [{0}]
noDomainParentDir=Le r\u00E9pertoire parent du domaine ne pointe pas vers un r\u00E9pertoire. Recherche de : [{0}]
noDomainRootDir=Le r\u00E9pertoire racine du domaine ne pointe pas vers un r\u00E9pertoire. Recherche de : [{0}]
noDomainDirs=Aucun domaine disponible dans {0}
tooManyDomainDirs={0} contient plusieurs domaines. R\u00E9essayez et sp\u00E9cifiez le nom du domaine en tant que dernier argument.
unknownError=Une erreur fatale est survenue lors du lancement : {0}
noConfigDir=Domaine endommag\u00E9. Le r\u00E9pertoire de configuration n''existe pas. Recherche dans : {0}
noConfigFile=Le fichier de configuration GlassFish principal est manquant. Emplacement attendu : {0}
BadArgs=Liste d'arguments incorrects
nojvm=JVM introuvable. Assurez-vous que JAVA_HOME est correctement d\u00E9fini dans votre environnement, que AS_JAVA est correctement d\u00E9fini dans le fichier config/asenv ou que java-home est correctement d\u00E9fini dans la configuration domain.xml.
jvmfailure=Echec du d\u00E9marrage de la JVM : {0}
verboseInterruption=L''exception InterruptedException a \u00E9t\u00E9 renvoy\u00E9e lors de l''attente de l''arr\u00EAt du domaine en mode verbose ou en mode watchdog : {0}
nobootjar=Fichier JAR d''initialisation introuvable. Recherche effectu\u00E9e dans : {0}
launchTime=Lancement termin\u00E9 en {0} ms.
serverStopped={0} a \u00E9t\u00E9 arr\u00EAt\u00E9.
UnknownJvmOptionFormat=Le format de l''\u00E9l\u00E9ment jvm-option est incorrect : {0}
no_gfe_jar=Vous devez indiquer l'emplacement du fichier JAR GlassFish imbriqu\u00E9 \u00E0 l'aide d'une variable d'environnement : d\u00E9finissez GFE_JAR=xxxx.jar
no_quotes_allowed=Les apostrophes simples et doubles ne sont pas autoris\u00E9es dans la variable d''environnement CLASSPATH. Elles ont \u00E9t\u00E9 supprim\u00E9es.\nAvant : {0}\nApr\u00E8s : {1}
respawninfo.empty=Les informations sur la commande Asadmin Respawn sont incorrectes. L''\u00E9l\u00E9ment {0} est NULL ou vide.
respawninfo.illegalToken=Il est interdit d''utiliser le jeton sp\u00E9cial [{1}] dans un argument de ligne de commande. Il a \u00E9t\u00E9 d\u00E9tect\u00E9 dans l''argument suivant : {0}
invalid_psd=Appel de la m\u00E9thode getProcessStreamDrainer non valide. Vous devez d'abord la lancer.
invalid_process=Appel de la m\u00E9thode getProcess non valide avant la cr\u00E9ation du processus. Patientez encore un instant. Lancez toujours la m\u00E9thode avant de l'appeler.
server_process_died=Le serveur a quitt\u00E9 le processus pr\u00E9matur\u00E9ment avec le code de sortie {0}.\nAvant son arr\u00EAt, il a g\u00E9n\u00E9r\u00E9 la sortie suivante :\n\n{1}
badOsgiPort=Le port OSGi Telnet configur\u00E9 ({0}) est d\u00E9j\u00E0 en cours d''utilisation par un autre processus. Le service OSGi Telnet n''est pas disponible mais cela n''aura aucune incidence sur GlassFish.
#
#'ssh' message from Sathyan Catari see IT 13862  October 19, 2010
ssh=Tentative de d\u00E9marrage de {0}... Consultez le journal du serveur pour plus de d\u00E9tails...

# issue 11665
copy_server_policy_error=Impossible de copier server.policy vers le domaine. Vous devrez peut-\u00EAtre d\u00E9sactiver le gestionnaire de s\u00E9curit\u00E9 avant la mise \u00E0 niveau.\nCause : {0}

#issue 15772
rename_osgi_cache_failed=Impossible de modifier le nom de l''emplacement de stockage persistant OSGi {0} en {1}
rename_osgi_cache_succeeded=Le nom de l''emplacement de stockage persistant OSGi {0} a \u00E9t\u00E9 modifi\u00E9 en {1}

no_flashlight_agent=Impossible de localiser Flashlight Agent dans : {0}
