#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


# To change this template, choose Tools | Templates
# and open the template in the editor.

internalError=Error interno:
noInstallDir=Error interno: no se ha encontrado el directorio de instalaci\u00F3n. Esto es lo que se estaba buscando: [{0}]
noDomainParentDir=El directorio principal del dominio no apunta a un directorio. Esto es lo que se estaba buscando: [{0}]
noDomainRootDir=El directorio ra\u00EDz del dominio no apunta a ning\u00FAn directorio. Esto es lo que se estaba buscando: [{0}]
noDomainDirs=No existe ning\u00FAn dominio en {0}
tooManyDomainDirs=Hay m\u00E1s de un dominio en {0}. Vuelva a intentarlo, pero especifique el nombre del dominio como \u00FAltimo argumento.
unknownError=Se ha detectado un error fatal durante el inicio: {0}
noConfigDir=Dominio corrupto. El directorio de configuraci\u00F3n no existe. Se estaba buscando aqu\u00ED: {0}
noConfigFile=Falta el archivo de configuraci\u00F3n principal de GlassFish. Aqu\u00ED es donde deber\u00EDa estar: {0}
BadArgs=Lista err\u00F3nea de argumentos
nojvm=No se ha encontrado una JVM. Aseg\u00FArese de que JAVA_HOME est\u00E9 definido correctamente en su entorno, que AS_JAVA est\u00E9 definido correctamente en el archivo config/asenv o que java-home est\u00E9 definido correctamente en la configuraci\u00F3n de domain.xml.
jvmfailure=Fallo de JVM al iniciar: {0}
verboseInterruption=Se ha obtenido InterruptedException mientras se esperaba a que el dominio se parase en modo watchdog o detallado: {0}
nobootjar=No se ha encontrado el archivo jar de inicializaci\u00F3n de datos. Se ha buscado aqu\u00ED: {0}
launchTime=Se ha iniciado correctamente en {0} mseg.
serverStopped=Se ha parado el {0}.
UnknownJvmOptionFormat=No se entiende el formato de esta opci\u00F3n de jvm: {0}
no_gfe_jar=Debe especificar la ubicaci\u00F3n del archivo jar de GlassFish embebido con una variable de entorno: set GFE_JAR=xxxx.jar
no_quotes_allowed=Los caracteres de comillas simples o dobles no se permiten en la variable de entorno CLASSPATH. Se han eliminado autom\u00E1ticamente.\nAntes: {0}\nDespu\u00E9s: {1}
respawninfo.empty=La informaci\u00F3n de reinicio de Asadmin es err\u00F3nea. El {0} es nulo o est\u00E1 vac\u00EDo.
respawninfo.illegalToken=No se permite utilizar este token especial [{1}] en ning\u00FAn argumento de la l\u00EDnea de comandos. Se ha encontrado en este argumento: {0}
invalid_psd=Llamada no v\u00E1lida a getProcessStreamDrainer. Debe iniciarlo primero.
invalid_process=Llamada no v\u00E1lida a getProcess antes de que el proceso se haya creado. Espere un poco m\u00E1s. Inicie siempre la llamada antes de llamar a este m\u00E9todo.
server_process_died=El servidor ha finalizado de forma prematura con el c\u00F3digo de salida {0}.\nAntes de morir, ha generado la siguiente salida:\n\n{1}
badOsgiPort=Otro proceso ya utiliza el puerto OSGi Telnet ({0}). El servicio OSGi Telnet no estar\u00E1 disponible, pero GlassFish no se ver\u00E1 afectado.
#
#'ssh' message from Sathyan Catari see IT 13862  October 19, 2010
ssh=Intentando iniciar {0}... Consulte el log del servidor para obtener m\u00E1s informaci\u00F3n...

# issue 11665
copy_server_policy_error=No se ha podido copiar server.policy en el dominio. Es posible que deba desactivar el gestor de seguridad antes de realizar la actualizaci\u00F3n.\nCausa: {0}

#issue 15772
rename_osgi_cache_failed=Fallo al cambiar el nombre del almac\u00E9n de persistencia de OSGi de {0} a {1}
rename_osgi_cache_succeeded=Se ha cambiado el nombre del almac\u00E9n de persistencia de OSGi de {0} a {1}

no_flashlight_agent=No se ha encontrado el agente de linterna aqu\u00ED: {0}
