#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

## Concurrent


## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteContextService=\u9078\u629E\u3057\u305F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteManagedThreadFactory=\u9078\u629E\u3057\u305F\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteManagedExecutorService=\u9078\u629E\u3057\u305F\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteManagedScheduledExecutorService=\u9078\u629E\u3057\u305F\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002

tree.concurrentResources=\u4E26\u884C\u51E6\u7406\u30EA\u30BD\u30FC\u30B9
tree.concurrentResources.tooltip=\u4E26\u884C\u51E6\u7406\u30EA\u30BD\u30FC\u30B9

tree.ContextServices=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9
tree.ContextServices.tooltip=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9

tree.ManagedThreadFactories=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA
tree.ManagedThreadFactories.tooltip=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA

tree.ManagedExecutorServices=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
tree.ManagedExecutorServices.tooltip=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9

tree.ManagedScheduledExecutorServices=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
tree.ManagedScheduledExecutorServices.tooltip=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9

conResources.pageTitle=\u4E26\u884C\u51E6\u7406\u30EA\u30BD\u30FC\u30B9
conResources.pageTitleHelp=\u4E26\u884C\u51E6\u7406\u30EA\u30BD\u30FC\u30B9\u306F\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3067\u3042\u308A\u3001Java EE\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u4E26\u884C\u51E6\u7406\u6A5F\u80FD\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002\u4E26\u884C\u51E6\u7406\u30EA\u30BD\u30FC\u30B9\u3092\u69CB\u6210\u3057\u3001\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3084EJB\u306A\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u304C\u4F7F\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002



resourcesTable.contextServices=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9
resourcesTable.managedThreadFactories=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA
resourcesTable.managedExecutorServices=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
resourcesTable.managedScheduledExecutorServices=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9

resourcesTable.colContextInfo=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u60C5\u5831
resourcesTable.colJndiName=JNDI\u540D
resourcesTable.colThreadPriority=\u30B9\u30EC\u30C3\u30C9\u512A\u5148\u5EA6
resourcesTable.colDesc=\u8AAC\u660E

contextServices.pageTitle=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9
contextServices.pageTitleHelp=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u3001\u30B3\u30F3\u30C6\u30CA\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u53D6\u5F97\u3057\u3001\u5F8C\u304B\u3089\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u305D\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5185\u3067\u5B9F\u884C\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u52D5\u7684\u30D7\u30ED\u30AD\u30B7\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
contextService.newPageTitle=\u65B0\u898F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9
contextService.newPageTitleHelp=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3084EJB\u306A\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u65B0\u3057\u3044\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
contextService.editPageTitle=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u7DE8\u96C6
contextService.editPageTitleHelp=\u65E2\u5B58\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002

managedThreadFactories.pageTitle=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA
managedThreadFactories.pageTitleHelp=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u306F\u3001\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
managedThreadFactory.newPageTitle=\u65B0\u898F\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA
managedThreadFactory.newPageTitleHelp=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3084EJB\u306A\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u65B0\u3057\u3044\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
managedThreadFactory.editPageTitle=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u7DE8\u96C6
managedThreadFactory.editPageTitleHelp=\u65E2\u5B58\u306E\u7BA1\u7406\u5BFE\u8C61\u30B9\u30EC\u30C3\u30C9\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002

managedExecutorServices.pageTitle=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
managedExecutorServices.pageTitleHelp=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u3001\u9001\u4FE1\u6E08\u30BF\u30B9\u30AF\u3092\u975E\u540C\u671F\u3067\u5B9F\u884C\u3059\u308B\u305F\u3081\u306B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
managedExecutorService.newPageTitle=\u65B0\u898F\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
managedExecutorService.newPageTitleHelp=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3084EJB\u306A\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u65B0\u3057\u3044\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
managedExecutorService.editPageTitle=\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u7DE8\u96C6
managedExecutorService.editPageTitleHelp=\u65E2\u5B58\u306E\u7BA1\u7406\u5BFE\u8C61\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002

managedScheduledExecutorServices.pageTitle=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
managedScheduledExecutorServices.pageTitleHelp=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u3001\u6307\u5B9A\u3055\u308C\u305F\u6642\u9593\u306B\u9001\u4FE1\u6E08\u30BF\u30B9\u30AF\u3092\u975E\u540C\u671F\u3067\u5B9F\u884C\u3059\u308B\u305F\u3081\u306B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
managedScheduledExecutorService.newPageTitle=\u65B0\u898F\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
managedScheduledExecutorService.newPageTitleHelp=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3084EJB\u306A\u3069\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u65B0\u3057\u3044\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
managedScheduledExecutorService.editPageTitle=\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u7DE8\u96C6
managedScheduledExecutorService.editPageTitleHelp=\u65E2\u5B58\u306E\u7BA1\u7406\u5BFE\u8C61\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u6E08\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002

contextInfoLabel=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u60C5\u5831:
contextInfoSelection=\u8907\u6570\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u5834\u5408\u306F\u3001[Shift]\u307E\u305F\u306F[Ctrl]\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF
contextInfoLabelHelp=\u4ED6\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u4F1D\u64AD\u3059\u308B\u305F\u3081\u306E\u30B3\u30F3\u30C6\u30CA\u30FB\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3002\u7121\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u9078\u629E\u3055\u308C\u305F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
threadPriorityLabel=\u30B9\u30EC\u30C3\u30C9\u512A\u5148\u5EA6:
threadPriorityLabelHelp=\u4F5C\u6210\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u3078\u306E\u5272\u5F53\u3066\u512A\u5148\u5EA6
longRunningTasks=\u9577\u6642\u9593\u5B9F\u884C\u4E2D\u306E\u30BF\u30B9\u30AF:
longRunningTasksHelp=\u9577\u6642\u9593\u5B9F\u884C\u4E2D\u306E\u30BF\u30B9\u30AF\u306B\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u9577\u6642\u9593\u5B9F\u884C\u4E2D\u306E\u30BF\u30B9\u30AF\u306F\u30B9\u30BF\u30C3\u30AF\u3068\u3057\u3066\u30EC\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002
hungAfterSeconds=\u30CF\u30F3\u30B0\u307E\u3067\u306E\u6642\u9593:
hungAfterSecondsHelp=\u30BF\u30B9\u30AF\u304C\u5FDC\u7B54\u3057\u3066\u3044\u306A\u3044\u3068\u307F\u306A\u3055\u308C\u308B\u307E\u3067\u306B\u5B9F\u884C\u53EF\u80FD\u306A\u79D2\u6570
corePoolSize=\u30B3\u30A2\u30FB\u30B5\u30A4\u30BA:
corePoolSizeHelp=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u306B\u4FDD\u6301\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u6570
maximumPoolSize=\u6700\u5927\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA:
maximumPoolSizeHelp=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u306B\u542B\u3081\u308B\u3053\u3068\u304C\u3067\u304D\u308B\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u6570
keepAliveSeconds=\u30AD\u30FC\u30D7\u30FB\u30A2\u30E9\u30A4\u30D6:
keepAliveSecondsHelp=\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u30B3\u30A2\u30FB\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5927\u304D\u304F\u306A\u3063\u305F\u5834\u5408\u306B\u30B9\u30EC\u30C3\u30C9\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u79D2\u6570
threadLifetimeSeconds=\u30B9\u30EC\u30C3\u30C9\u5B58\u7D9A\u6642\u9593:
threadLifetimeSecondsHelp=\u30B9\u30EC\u30C3\u30C9\u304C\u30D1\u30FC\u30B8\u3055\u308C\u308B\u307E\u3067\u306B\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u5185\u306B\u5B58\u7D9A\u3067\u304D\u308B\u79D2\u6570
taskQueueCapacity=\u30BF\u30B9\u30AF\u30FB\u30AD\u30E5\u30FC\u30FB\u30AD\u30E3\u30D1\u30B7\u30C6\u30A3
taskQueueCapacityHelp=\u5B9F\u884C\u3092\u5F85\u6A5F\u3059\u308B\u30BF\u30B9\u30AF\u30FB\u30AD\u30E5\u30FC\u306B\u683C\u7D0D\u3067\u304D\u308B\u9001\u4FE1\u6E08\u30BF\u30B9\u30AF\u306E\u6570
propertySheetSection.poolSettings=\u30D7\u30FC\u30EB\u8A2D\u5B9A

