#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

internal.error=Erreur interne : {0}
validator.invalid_value=Valeur non valide pour {0} : {1}
validator.invalid_type=Type non valide pour {0}. Type attendu : {1} ou un sous-type, type obtenu : {2}
fileValidator.no_read=Aucun droit de lecture : {0}
fileValidator.no_write=Aucun droit d''\u00E9criture : {0}
fileValidator.not_a_dir={0} n''est pas un r\u00E9pertoire
portValidator.in_use=Le port {0} est en cours d''utilisation
domainConfig=configuration du domaine
keyFileNotCreated=Erreur lors de la cr\u00E9ation du fichier de cl\u00E9s
adminUserComment=# Utilisateur et mot de passe du domaine - Ne pas supprimer l'entr\u00E9e ci-dessus
serverPolicyNotCreated=Erreur lors de la cr\u00E9ation de server.policy
keyStoreNotCreated=Erreur lors de la cr\u00E9ation du keystore {0}
trustStoreNotCreated=Erreur lors de la cr\u00E9ation du truststore {0}
masterPasswordFileNotCreated=Erreur lors de la cr\u00E9ation du fichier de mots de passe ma\u00EEtre {0}
timerDbnNotCreated=Erreur lors de la cr\u00E9ation du fichier DBN de la base de donn\u00E9es d'horloge
timerWalNotCreated=Erreur lors de la cr\u00E9ation du fichier WAL de la base de donn\u00E9es d'horloge
jbiRegistryTemplateNotCopied=Erreur lors de la copie du fichier de mod\u00E8le de registre JBI
installRoot=racine d'installation
cannotDeleteJmsProviderInstance=Erreur lors de la suppression de l'instance de broker MQ
masterPasswordFileNotRead=Erreur lors de la lecture du fichier de mots de passe ma\u00EEtre {0}

keyStorePasswordNotChanged=Erreur lors de la modification du mot de passe du keystore pour l''emplacement de stockage {0}

s1asKeyPasswordNotChanged=Erreur lors de la modification du mot de passe pour la cl\u00E9 par d\u00E9faut avec l''alias s1as pour l''emplacement de stockage {0}

passwordAliasPasswordNotChanged=Erreur lors de la modification du mot de passe pour l''emplacement de stockage d''alias de mot de passe {0}

passwordAliasKeystoreNotCreated=Impossible de cr\u00E9er le keystore d''alias de mot de passe {0}

couldNotValidateMasterPassword=Exception lors de la validation du mot de passe ma\u00EEtre aupr\u00E8s de l''emplacement de stockage {0}

masterPasswordInvalid=Le mot de passe indiqu\u00E9 n'est pas valide
derbyEjbTimerDBNotCreated=Impossible de cr\u00E9er la base de donn\u00E9es d''horloge EJB int\u00E9gr\u00E9e, message d\u00E9taill\u00E9 : {0}
noDerbyLog=Impossible de lire le fichier derby.log. Aucune information d\u00E9taill\u00E9e disponible.
nullArg=Un argument NULL a \u00E9t\u00E9 indiqu\u00E9.
smfTokenNeeded=Le jeton obligatoire [{0}] a \u00E9t\u00E9 initialis\u00E9 avec une valeur non valide [{1}]. D\u00E9finissez la valeur correcte \u00E0 l''aide de l''interface du gestionnaire de services.
invalidTO=La valeur d''expiration indiqu\u00E9e [{0}] n''est pas valide. Seuls les nombres entiers non n\u00E9gatifs sont autoris\u00E9s.
serviceNameInvalid=Nom incorrect [{0}] pour le service.
smfLeftoverFiles=Une tentative de cr\u00E9ation d''un service portant le m\u00EAme nom a d\u00E9j\u00E0 eu lieu. Attribuez un autre nom au service, ou supprimez le service et le r\u00E9pertoire correspondant [{0}], puis r\u00E9essayez.
doesNotExist=L''objet [{0}] est introuvable.
serviceTypeNotSet=Le type de service n'est pas configur\u00E9 correctement.
serviceTemplateNotFound=Le mod\u00E8le de service [{0}] n''existe pas. Probl\u00E8me avec le param\u00E9trage d''environnement, tel que INSTALL_ROOT, etc.
notSolaris10=La plate-forme actuellement utilis\u00E9e, avec le syst\u00E8me d''exploitation {0} et la version {1}, n''est pas Solaris 10. Cette fonction n''est prise en charge que sur les plates-formes Solaris 10.
noPermissionToCreateManifest=L''utilisateur [{0}] ne dispose pas des droits n\u00E9cessaires pour cr\u00E9er les fichiers et r\u00E9pertoires associ\u00E9s au fichier manifest du service \u00E0 l''emplacement [{1}]. Cette structure est requise par les directives SMF. Pour effectuer cette op\u00E9ration, vous devez \u00EAtre un superutilisateur ou contacter l''administrateur syst\u00E8me afin d''obtenir explicitement les droits appropri\u00E9s, puis r\u00E9essayer.
noSmfAuth=L''utilisateur [{0}] ne semble pas disposer des autorisations ad\u00E9quates [solaris.smf.*] sur ce syst\u00E8me pour cr\u00E9er et configurer un service SMF. Les autorisations disponibles sont [{1}].\nReportez-vous \u00E0 smf_security(5), rbac(5).\n
missingParamsInFile=Le fichier de mots de passe d\u00E9fini comme [{0}] ne contient pas la propri\u00E9t\u00E9 [{1}] au format requis. R\u00E9ex\u00E9cutez la commande apr\u00E8s avoir ajout\u00E9 l''entr\u00E9e [{1}=value] \u00E0 ce fichier sur une ligne distincte.
serviceNameExists=Un service SMF portant le nom [{0}] semble d\u00E9j\u00E0 exister sur cet ordinateur, comme indiqu\u00E9 par la commande [svcs -a]. R\u00E9essayez de cr\u00E9er le service sous un autre nom.
runtimeStatusToString={0} est {1}
fileNotFound=Fichier {0} introuvable.
error=erreur
runtimeStatusToStringStopCluster.alreadyStopped=L''instance incluse dans un cluster {0} est d\u00E9j\u00E0 arr\u00EAt\u00E9e.
runtimeStatusToStringStopCluster.success=L''instance incluse dans un cluster {0} a \u00E9t\u00E9 arr\u00EAt\u00E9e.
runtimeStatusToStringStopCluster.stoppedToRunning=Cette op\u00E9ration est impossible. L''instance incluse dans un cluster {0} a \u00E9t\u00E9 arr\u00EAt\u00E9e et est maintenant {1}
runtimeStatusToStringStopCluster.error=L''instance incluse dans un cluster {0} n''a pas pu \u00EAtre arr\u00EAt\u00E9e. Etat initial : [{1}], \u00E9tat actuel : [{2}].
runtimeStatusToStringStartCluster.alreadyStarted=L''instance incluse dans un cluster {0} est d\u00E9j\u00E0 en cours d''ex\u00E9cution.
runtimeStatusToStringStartCluster.success=L''instance incluse dans un cluster {0} a \u00E9t\u00E9 d\u00E9marr\u00E9e.
runtimeStatusToStringStartCluster.startedToStopped=Cette op\u00E9ration est impossible. L''instance incluse dans un cluster {0} \u00E9tait en cours d''ex\u00E9cution et est maintenant {1}
runtimeStatusToStringStartCluster.error=L''instance incluse dans un cluster {0} n''a pas pu \u00EAtre d\u00E9marr\u00E9e. Etat initial : [{1}], \u00E9tat actuel : [{2}].

CertificateDN=Nom distinctif du certificat X.509 auto-sign\u00E9 du serveur : \n[{0}]
SomeProblemWithKeytool= Le processus de cr\u00E9ation de domaine implique une \u00E9tape de cr\u00E9ation de cl\u00E9 primaire et\nde certificat de serveur auto-sign\u00E9. Cette \u00E9tape a \u00E9chou\u00E9 pour la raison suivante.\n Cette erreur peut \u00EAtre due au fait que le programme keytool fourni par le Java Development Kit (JDK) est introuvable (par exemple\n, vous ex\u00E9cutez JRE) ou \u00E0 une autre raison. Vous pouvez\n utiliser le programme keytool livr\u00E9 avec le Java Development Kit (JDK) pour effectuer cette op\u00E9ration. Un keystore JKS temporaire\n sera cr\u00E9\u00E9. Vous devez le remplacer par le keystore appropri\u00E9 avant de l''employer pour SSL.\n Pour plus d''informations, consultez la documentation. Erreur :\n{0}

windows.services.passwordFileNotA=Le fichier de mots de passe que vous avez sp\u00E9cifi\u00E9 n''est pas un fichier : {0}
windows.services.passwordFileNotReadable=Le fichier de mots de passe que vous avez sp\u00E9cifi\u00E9 est illisible : {0}
windows.services.noTargetDir=Impossible de cr\u00E9er un r\u00E9pertoire pour les services dans le domaine : {0}
services.alreadyCreated=\n\nDes services ont d\u00E9j\u00E0 \u00E9t\u00E9 cr\u00E9\u00E9s pour ce serveur.\nEssayez d''abord de supprimer les fichiers comme :\n         {1} {0}\nou -- utilisez l''option --force pour les supprimer automatiquement.\n
windows.services.install.bad=Erreur lors de la tentative d''installation de GlassFish en tant que service Windows. \nValeur renvoy\u00E9e : {0}.\nSTDERR : {1}\nSTDOUT : {2}
SMFServiceCreated=Le service a \u00E9t\u00E9 cr\u00E9\u00E9. D\u00E9tails :\nNom du service : {0}\nType du service : {1}\nEmplacement de configuration du service : {2}\nEmplacement du fichier manifest sur le syst\u00E8me : {3}.\nVous avez cr\u00E9\u00E9 le service mais vous devez le lancer vous-m\u00EAme. Les commandes Solaris les plus utiles sont les suivantes :\n\n* /usr/bin/svcs  -a | grep {4}  // status\n* /usr/sbin/svcadm enable {4} // start\n* /usr/sbin/svcadm disable {4} // stop\n* /usr/sbin/svccfg delete {4} // uninstall
dryrun=\n********  Test ********\nLe service n'a pas \u00E9t\u00E9 r\u00E9ellement cr\u00E9\u00E9, mais sa cr\u00E9ation aurait abouti.\nEx\u00E9cutez \u00E0 nouveau la commande sans l'option --dry-run afin de l'ex\u00E9cuter r\u00E9ellement.
WindowsServiceCreated=Le service Windows a \u00E9t\u00E9 cr\u00E9\u00E9. Il est pr\u00EAt \u00E0 \u00EAtre d\u00E9marr\u00E9. D\u00E9tails :\nID du service : {0}\nNom d''affichage du service :{1}\nR\u00E9pertoire du serveur : {2}\nFichier de configuration pour le Wrapper des services Windows : {3}\nLe service peut \u00EAtre contr\u00F4l\u00E9 \u00E0 l''aide du gestionnaire de services Windows ou vous pouvez utiliser le \nWrapper des services Windows :\nCommande D\u00E9marrer :  {4}  start\nCommande Arr\u00EAter :   {4}  stop\nCommande Red\u00E9marrer :  {4}  restart\nCommande D\u00E9sinstaller :  {4}  uninstall\nCommande Installer :  {4}  install\nCommande Etat : {4} status\nVous pouvez \u00E9galement v\u00E9rifier que le service a bien \u00E9t\u00E9 install\u00E9 avec ''sc query state= all''\nwindows.services.uninstall.good=Le service Windows a \u00E9t\u00E9 trouv\u00E9 et install\u00E9.
noSuitableServiceImplementation=Votre syst\u00E8me d'exploitation n'est pas encore pris en charge. Les plates-formes actuellement prises en charge sont Linux, Windows et SMF sur Solaris.
bad.server.dirs=Erreur interne : argument de r\u00E9pertoires de serveur incorrect.
noAsadminScript=L''emplacement du script de client d''administration est introuvable. Emplacement attendu : {0}
xmlfiledump=\nLe fichier de configuration g\u00E9n\u00E9r\u00E9 qui aurait \u00E9t\u00E9 utilis\u00E9 est le suivant (utile \u00E0 des fins de d\u00E9bogage) :\n
no_initd=Aucun dossier syst\u00E8me pour les services. Recherche de : {0}
no_write_dir=Vous ne disposez pas des droits n\u00E9cessaires pour \u00E9crire dans {0}. R\u00E9ex\u00E9cutez la commande avec les privil\u00E8ges root.
no_rc=Impossible de d\u00E9terminer la configuration de vos services. Elle ne doit pas \u00EAtre standard car le r\u00E9pertoire {0} n''existe pas.\nNous ne pouvons pas cr\u00E9er de services pour ce syst\u00E8me.
no_rc2=Impossible de d\u00E9terminer la configuration de vos services. Elle ne doit pas \u00EAtre standard car il n'existe aucun r\u00E9pertoire rc?.d dans\nles r\u00E9pertoires /etc ou /etc/init.d. Nous ne pouvons pas cr\u00E9er de services pour ce syst\u00E8me.
linux.services.uninstall.good=Le service Linux a \u00E9t\u00E9 trouv\u00E9 et install\u00E9.
LinuxServiceCreated=Le service a \u00E9t\u00E9 cr\u00E9\u00E9. D\u00E9tails :\nNom du service : {0}\nType du service : {1}\nEmplacement de configuration du service : {2}\nCompte utilisateur ex\u00E9cutant le service : {3}\nVous avez cr\u00E9\u00E9 le service, mais vous devez le d\u00E9marrer vous-m\u00EAme. Les commandes Linux les plus utiles sont les suivantes :\n\n* /etc/init.d/{4} start\n* /etc/init.d/{4} stop\n* /etc/init.d/{4} restart\n
# Do not translate PATH as it is a reserved operating system variable name
no_updater=Le programme de mise \u00E0 jour des services Ubuntu est introuvable dans votre chemin. Le programme se nomme {0}. \nLocalisez-le et ajoutez-le \u00E0 l''\u00E9l\u00E9ment PATH.
cant_delete=Impossible de supprimer ce fichier : {0}. Supprimez-le manuellement ou connectez-vous avec des privil\u00E8ges plus \u00E9lev\u00E9s et r\u00E9ex\u00E9cutez la commande.
too_many_links=Un trop grand nombre de fichiers li\u00E9s correspondants existent. Pour plus de s\u00E9curit\u00E9, nous ne les avons PAS supprim\u00E9s. Supprimez-les manuellement et/ou \nchangez \u00E9ventuellement le nom du service pour qu''il n''y ait pas de conflit. Les noms des fichiers li\u00E9s sont les suivants : \n{0}
ln_error=Erreur lors de la tentative de cr\u00E9ation d''un lien symbolique avec cette commande : {0}\nException : {1}
no_delete_yet=L'\u00E9l\u00E9ment delete-service n'est pas encore impl\u00E9ment\u00E9 pour cette plate-forme.
not_installed=Le service n'est pas install\u00E9.
cant_exec=Impossible d''ex\u00E9cuter {0}. Essayez d''obtenir des privil\u00E8ges d''acc\u00E8s sup\u00E9rieurs ou de vous connecter en tant qu''utilisateur root.
