#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

internal.error=Erro Interno: {0}
validator.invalid_value=Valor inv\u00E1lido para {0}: {1}
validator.invalid_type=Tipo inv\u00E1lido para {0}. Esperado {1} ou subtipo, mas obtido {2}
fileValidator.no_read=Sem permiss\u00E3o para leitura: {0}
fileValidator.no_write=Sem permiss\u00E3o para grava\u00E7\u00E3o: {0}
fileValidator.not_a_dir={0} n\u00E3o \u00E9 um diret\u00F3rio
portValidator.in_use=Porta {0} em uso
domainConfig=configura\u00E7\u00E3o do dom\u00EDnio
keyFileNotCreated=Erro ao criar arquivo de chaves
adminUserComment=# Usu\u00E1rio e Senha do Dom\u00EDnio \u2013 N\u00E3o deletar entrada acima
serverPolicyNotCreated=Erro ao criar server.policy
keyStoreNotCreated=Erro ao criar armazenamento de chaves {0}
trustStoreNotCreated=Erro ao criar o armazenamento confi\u00E1vel {0}
masterPasswordFileNotCreated=Erro ao criar o arquivo de senha mestra {0}
timerDbnNotCreated=Erro ao criar o arquivo dbn de banco de dados do timer
timerWalNotCreated=Erro ao criar o arquivo wal de banco de dados do timer
jbiRegistryTemplateNotCopied=Erro ao copiar o arquivo de modelo de registro JBI
installRoot=raiz de instala\u00E7\u00E3o
cannotDeleteJmsProviderInstance=Erro ao deletar a inst\u00E2ncia de broker mq
masterPasswordFileNotRead=Erro ao ler o arquivo de senha mestra {0}

keyStorePasswordNotChanged=Erro ao alterar a senha de armazenamento de chave para armazenamento {0}

s1asKeyPasswordNotChanged=Erro ao alterar a senha de chave default com o alias s1as para armazenamento {0}

passwordAliasPasswordNotChanged=Erro ao alterar a senha de armazenamento de alias de senha {0}

passwordAliasKeystoreNotCreated=N\u00E3o foi poss\u00EDvel criar \u00E1rea de armazenamento de alias de senha {0}

couldNotValidateMasterPassword=Exce\u00E7\u00E3o validando senha mestra em armazenamento {0}

masterPasswordInvalid=Senha inserida inv\u00E1lida
derbyEjbTimerDBNotCreated=N\u00E3o foi poss\u00EDvel criar banco de dados do timer EJB incorporado, mensagem detalhada: {0}
noDerbyLog=N\u00E3o foi poss\u00EDvel ler o arquivo de log derby. N\u00E3o h\u00E1 informa\u00E7\u00F5es detalhadas dispon\u00EDveis.
nullArg=Fornecido argumento nulo.
smfTokenNeeded=Token obrigat\u00F3rio [{0}] inicializado com valor inv\u00E1lido [{1}]. Defina o valor corretamente usando a interface ServiceHandler.
invalidTO=Valor inv\u00E1lido [{0}] especificado como time-out. Permitidos apenas inteiros n\u00E3o negativos.
serviceNameInvalid=Nome inv\u00E1lido [{0}] para o servi\u00E7o.
smfLeftoverFiles=Houve uma tentativa anterior de criar o servi\u00E7o com o mesmo nome. Escolha outro nome para o servi\u00E7o ou delete o servi\u00E7o e o diret\u00F3rio correspondente [{0}] e tente novamente.
doesNotExist=N\u00E3o foi poss\u00EDvel encontrar o objeto [{0}].
serviceTypeNotSet=Tipo de servi\u00E7o configurado incorretamente.
serviceTemplateNotFound=o modelo de servi\u00E7o [{0}] n\u00E3o existe, h\u00E1 algo incorreto no ambiente de defini\u00E7\u00E3o, como INSTALL_ROOT etc.
notSolaris10=Plataforma atual, SO: {0} vers\u00E3o: {1} n\u00E3o \u00E9 Solaris 10. Esta instala\u00E7\u00E3o n\u00E3o oferece suporte a plataformas que n\u00E3o sejam Solaris 10.
noPermissionToCreateManifest=O usu\u00E1rio [{0}] n\u00E3o tem permiss\u00E3o para criar arquivos e diret\u00F3rios relacionados ao manifesto de servi\u00E7o em [{1}]. Essa estrutura \u00E9 obrigat\u00F3ria por diretrizes de SMF. Torne-se superusu\u00E1rio para realizar essa opera\u00E7\u00E3o ou entre em contato com o administrador do sistema para obter explicitamente as permiss\u00F5es relevantes e tente novamente.
noSmfAuth=Parece que o usu\u00E1rio [{0}] n\u00E3o tem autoriza\u00E7\u00F5es adequadas [solaris.smf.*] neste sistema para criar e configurar um servi\u00E7o de SMF. As autoriza\u00E7\u00F5es dispon\u00EDveis s\u00E3o [{1}].\nConsulte smf_security(5), rbac(5).\n
missingParamsInFile=O arquivo de senha especificado como [{0}] n\u00E3o cont\u00E9m a propriedade [{1}] da forma exigida. Execute novamente o comando ap\u00F3s adicionar [{1}=valor] a este arquivo em uma linha separada.
serviceNameExists=Parece existir um servi\u00E7o de SMF com o nome [{0}], conforme mostrado pelo comando [svcs -a], nesta m\u00E1quina. Tente criar novamente o servi\u00E7o com outro nome fornecido para o servi\u00E7o.
runtimeStatusToString={0} \u00E9 {1}
fileNotFound=Arquivo {0} n\u00E3o encontrado.
error=erro
runtimeStatusToStringStopCluster.alreadyStopped=A inst\u00E2ncia clusterizada {0} j\u00E1 foi interrompida.
runtimeStatusToStringStopCluster.success=A inst\u00E2ncia clusterizada {0} foi interrompida com sucesso.
runtimeStatusToStringStopCluster.stoppedToRunning=Isso deve ser imposs\u00EDvel. A inst\u00E2ncia clusterizada {0} foi interrompida e agora \u00E9: {1}
runtimeStatusToStringStopCluster.error=N\u00E3o foi poss\u00EDvel interromper a inst\u00E2ncia clusterizada {0}. Originalmente, estava neste estado: [{1}] e agora est\u00E1 neste estado: [{2}].
runtimeStatusToStringStartCluster.alreadyStarted=A inst\u00E2ncia clusterizada {0} j\u00E1 estava em execu\u00E7\u00E3o.
runtimeStatusToStringStartCluster.success=A inst\u00E2ncia clusterizada {0} foi iniciada com sucesso.
runtimeStatusToStringStartCluster.startedToStopped=Isso deve ser imposs\u00EDvel. A inst\u00E2ncia clusterizada {0} estava em execu\u00E7\u00E3o e agora \u00E9: {1}
runtimeStatusToStringStartCluster.error=N\u00E3o foi poss\u00EDvel iniciar a inst\u00E2ncia clusterizada {0}. Originalmente, estava neste estado: [{1}] e agora est\u00E1 neste estado: [{2}].

CertificateDN=O Nome Distinto do certificado autoassinado do servidor X.509 \u00E9:\n[{0}]
SomeProblemWithKeytool= O processo de cria\u00E7\u00E3o do dom\u00EDnio envolve uma etapa que cria a chave prim\u00E1ria e\n o certificado autoassinado do servidor. Houve falha nesta etapa devido ao motivo mostrado abaixo.\n Isso ocorre porque n\u00E3o foi poss\u00EDvel encontrar o programa keytool fornecido pelo JDK (por exemplo,\n voc\u00EA est\u00E1 executando com JRE) ou por algum outro motivo. N\u00E3o h\u00E1 motivo para p\u00E2nico, porque voc\u00EA\n sempre pode usar o programa keytool do JDK para fazer o que \u00E9 necess\u00E1rio. Um keystore tempor\u00E1rio do JKS\n ser\u00E1 criado. Voc\u00EA deve substitu\u00ED-lo pelo keystore adequado antes de utiliz\u00E1-lo para SSL.\n Consulte a documenta\u00E7\u00E3o para obter detalhes. Erro real \u00E9:\n{0}

windows.services.passwordFileNotA=O arquivo de senha especificado n\u00E3o \u00E9 um arquivo: {0}
windows.services.passwordFileNotReadable=O arquivo de senha especificado n\u00E3o est\u00E1 leg\u00EDvel: {0}
windows.services.noTargetDir=N\u00E3o \u00E9 poss\u00EDvel criar um diret\u00F3rio de servi\u00E7os no dom\u00EDnio: {0}
services.alreadyCreated=\n\nOs servi\u00E7os j\u00E1 foram criados neste servidor.\nTente primeiro deletar os arquivos da seguinte forma:\n         {1} {0}\nou -- utilize a op\u00E7\u00E3o --force e eles ser\u00E3o deletados automaticamente.\n
windows.services.install.bad=Erro ao instalar o GlassFish como um Servi\u00E7o do Windows. \nValor retornado: {0}.\nSTDERR: {1}\nSTDOUT: {2}
SMFServiceCreated=O servi\u00E7o foi criado com sucesso. Aqui est\u00E3o os detalhes:\nNome do servi\u00E7o:{0}\nTipo do servi\u00E7o:{1}\nLocal de configura\u00E7\u00E3o do servi\u00E7o:{2}\nLocal do arquivo de manifesto no sistema:{3}.\nN\u00F3s criamos o servi\u00E7o, mas voc\u00EA tem que dar in\u00EDcio a ele. Aqui est\u00E3o os comandos Solaris mais comuns:\n\n* /usr/bin/svcs  -a | grep {4}  // status\n* /usr/sbin/svcadm enable {4} // start\n* /usr/sbin/svcadm disable {4} // stop\n* /usr/sbin/svccfg delete {4} // uninstall
dryrun=\n********  DRY RUN ********\nO servi\u00E7o n\u00E3o foi realmente criado, mas poderia ter sido bem-sucedido.\nExecute o comando novamente sem a op\u00E7\u00E3o --dry-run para execut\u00E1-lo realmente.
WindowsServiceCreated=O Servi\u00E7o do Windows foi criado com sucesso. Est\u00E1 pronto para ser iniciado. Aqui est\u00E3o os detalhes:\nID do servi\u00E7o: {0}\nNome de Exibi\u00E7\u00E3o do servi\u00E7o:{1}\nDiret\u00F3rio do Servidor: {2}\nArquivo de Configura\u00E7\u00E3o do Wrapper de Servi\u00E7os do Windows: {3}\nO servi\u00E7o pode ser controlado com o Gerenciador de Servi\u00E7os do Windows ou, em vez disso, \u00E9 poss\u00EDvel utilizar o\nWrapper de Servi\u00E7os do Windows:\nComando de In\u00EDcio:  {4}  start\nComando de Interrup\u00E7\u00E3o:   {4}  stop\nComando de rein\u00EDcio:  {4}  restart\nComando de Desinstala\u00E7\u00E3o:  {4}  uninstall\nComando de Instala\u00E7\u00E3o:  {4}  install\nComando de status: {4} status\nTamb\u00E9m \u00E9 poss\u00EDvel verificar se o servi\u00E7o est\u00E1 instalado (ou n\u00E3o) com "sc query state= all"\nwindows.services.uninstall.good=Servi\u00E7o do Windows encontrado e desinstalado com sucesso.
noSuitableServiceImplementation=Ainda n\u00E3o existe nenhum suporte para o seu sistema operacional. Atualmente Linux, Windows e SMF no Solaris s\u00E3o as plataformas suportadas.
bad.server.dirs=Erro Interno: Argumento Incorreto de Diret\u00F3rios do Servidor.
noAsadminScript=N\u00E3o foi poss\u00EDvel encontrar a localiza\u00E7\u00E3o do script do cliente de administra\u00E7\u00E3o. Deveria estar aqui: {0}
xmlfiledump=\nAqui est\u00E1 o arquivo de configura\u00E7\u00E3o gerado que deveria ter sido utilizado (isto serve para a depura\u00E7\u00E3o):\n
no_initd=N\u00E3o h\u00E1 nenhuma pasta de servi\u00E7os no sistema. Est\u00E1vamos procurando por: {0}
no_write_dir=Voc\u00EA n\u00E3o tem permiss\u00E3o para gravar em {0}. Execute o comando novamente com os privil\u00E9gios raiz.
no_rc=N\u00E3o \u00E9 poss\u00EDvel determinar sua configura\u00E7\u00E3o de servi\u00E7os. N\u00E3o deve ser padr\u00E3o porque este diret\u00F3rio {0} n\u00E3o existe.\nInfelizmente n\u00E3o pudemos criar servi\u00E7os para este sistema.
no_rc2=N\u00E3o \u00E9 poss\u00EDvel determinar sua configura\u00E7\u00E3o de servi\u00E7os. N\u00E3o deve ser padr\u00E3o porque n\u00E3o h\u00E1 nenhum rc?.Os diret\u00F3rios d estavam presentes\nnos diret\u00F3rios /etc ou /etc/init.d. Infelizmente n\u00E3o pudemos criar servi\u00E7os para este sistema.
linux.services.uninstall.good=Servi\u00E7o Linux encontrado e instalado com sucesso.
LinuxServiceCreated=O servi\u00E7o foi criado com sucesso. Aqui est\u00E3o os detalhes:\nNome do servi\u00E7o:{0}\nTipo do servi\u00E7o:{1}\nLocal de configura\u00E7\u00E3o do servi\u00E7o:{2}\nA conta de usu\u00E1rio que executar\u00E1 o servi\u00E7o: {3}\nVoc\u00EA criou o servi\u00E7o e voc\u00EA mesmo precisa inici\u00E1-lo. Aqui est\u00E3o os comandos mais comuns do Linux:\n\n* /etc/init.d/{4} start\n* /etc/init.d/{4} stop\n* /etc/init.d/{4} restart\n
# Do not translate PATH as it is a reserved operating system variable name
no_updater=N\u00E3o foi poss\u00EDvel localizar o programa Ubuntu Services Updater no seu caminho. O programa tem nome {0}. \nLocalize e adicione-o ao PATH.
cant_delete=N\u00E3o \u00E9 poss\u00EDvel deletar este arquivo: {0}. Delete-o manualmente, ou efetue log-in com privil\u00E9gios superiores e execute o comando novamente.
too_many_links=Excesso de arquivos de link correspondentes encontrados. Para que n\u00E3o haja riscos, n\u00F3s N\u00C3O os deletamos. Delete-os manualmente e/ou \naltere o nome do servi\u00E7o para que n\u00E3o ocorra conflito. Aqui est\u00E3o os nomes do arquivo de link: \n{0}
ln_error=Erro ao tentar criar um link simb\u00F3lico com este comando: {0}\nOcorre esta Exce\u00E7\u00E3o: {1}
no_delete_yet=delete-service ainda n\u00E3o est\u00E1 implementado nesta plataforma.
not_installed=O servi\u00E7o n\u00E3o est\u00E1 instalado.
cant_exec=N\u00E3o \u00E9 poss\u00EDvel executar {0}. Tente obter maiores privil\u00E9gios de acesso ou efetue log-in como raiz.
