#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

internal.error=Interner Fehler: {0}
validator.invalid_value=Ung\u00FCltiger Wert f\u00FCr {0}: {1}
validator.invalid_type=Ung\u00FCltiger Typ f\u00FCr {0}. Erwartet wurde {1} oder ein Untertyp, zur\u00FCckgegeben wurde aber {2}
fileValidator.no_read=Keine Leseberechtigung: {0}
fileValidator.no_write=Keine Schreibberechtigung: {0}
fileValidator.not_a_dir={0} ist kein Verzeichnis
portValidator.in_use=Port {0} wird verwendet
domainConfig=Domainkonfiguration
keyFileNotCreated=Fehler beim Erstellen der Schl\u00FCsseldatei
adminUserComment=# Domainbenutzer und Kennwort - Obigen Eintrag nicht l\u00F6schen
serverPolicyNotCreated=Fehler beim Erstellen von server.policy
keyStoreNotCreated=Fehler beim Erstellen des Keystores {0}
trustStoreNotCreated=Fehler beim Erstellen des Truststores {0}
masterPasswordFileNotCreated=Fehler beim Erstellen der Master-Kennwortdatei {0}
timerDbnNotCreated=Fehler beim Erstellen der Timerdatenbank-DBN-Datei
timerWalNotCreated=Fehler beim Erstellen der Timerdatenbank-WAL-Datei
jbiRegistryTemplateNotCopied=Fehler beim Kopieren der JBI-Registry-Vorlagendatei
installRoot=Installations-Root
cannotDeleteJmsProviderInstance=Fehler beim L\u00F6schen der MQ-Brokerinstanz
masterPasswordFileNotRead=Fehler beim Lesen der Master-Kennwortdatei {0}

keyStorePasswordNotChanged=Fehler beim \u00C4ndern des Keystore-Kennworts f\u00FCr Speicher {0}

s1asKeyPasswordNotChanged=Fehler beim \u00C4ndern des Kennworts f\u00FCr den Standardschl\u00FCssel mit Alias s1as f\u00FCr Speicher {0}

passwordAliasPasswordNotChanged=Fehler beim \u00C4ndern des Kennworts f\u00FCr Kennwortalias-Speicher {0}

passwordAliasKeystoreNotCreated=Kennwortalias-Keystore {0} konnte nicht erstellt werden

couldNotValidateMasterPassword=Exception beim Validieren des Master-Kennworts gegen Speicher {0}

masterPasswordInvalid=Eingegebenes Kennwort ist ung\u00FCltig
derbyEjbTimerDBNotCreated=Die eingebettete EJB-Timerdatenbank konnte nicht erstellt werden. Detaillierte Meldung: {0}
noDerbyLog=Die Derby-Logdatei konnte nicht gelesen werden. Keine detaillierten Informationen verf\u00FCgbar.
nullArg=Nullargument wurde angegeben.
smfTokenNeeded=Erforderliches Token [{0}] mit ung\u00FCltigem Wert [{1}] initialisiert. Legen Sie den Wert mit der ServiceHandler-Schnittstelle ordnungsgem\u00E4\u00DF fest.
invalidTO=Ung\u00FCltiger Wert [{0}] als Timeout angegeben. Es sind nur nicht negative Ganzzahlen zul\u00E4ssig.
serviceNameInvalid=Ung\u00FCltiger Name [{0}] f\u00FCr den Service.
smfLeftoverFiles=Es wurde bereits zuvor versucht, einen Service mit demselben Namen zu erstellen. W\u00E4hlen Sie entweder einen anderen Namen f\u00FCr den Service, oder l\u00F6schen Sie den Service sowie das dazugeh\u00F6rige Verzeichnis [{0}], und wiederholen Sie den Vorgang.
doesNotExist=Objekt [{0}] konnte nicht gefunden werden.
serviceTypeNotSet=Servicetyp ist nicht korrekt konfiguriert.
serviceTemplateNotFound=Servicevorlage [{0}] ist nicht vorhanden. Es liegt ein Fehler beim Festlegen der Umgebung vor (INSTALL_ROOT usw.).
notSolaris10=Bei der aktuellen Plattform, BS: {0} Version: {1}, handelt es sich nicht um Solaris 10. Diese Funktionalit\u00E4t wird auf anderen Plattformen als Solaris 10 nicht unterst\u00FCtzt.
noPermissionToCreateManifest=Der Benutzer [{0}] ist nicht berechtigt, die Dateien und Verzeichnisse zum Servicemanifest unter [{1}] zu erstellen. Diese Struktur ist gem\u00E4\u00DF SMF-Richtlinien erforderlich. Melden Sie sich f\u00FCr diesen Vorgang entweder als Superuser an, oder wenden Sie sich an den Systemadministrator, um die relevanten Berechtigungen explizit anzufordern, und wiederholen Sie den Vorgang.
noSmfAuth=Der Benutzer [{0}] verf\u00FCgt auf diesem System offenbar nicht \u00FCber die erforderlichen Autorisierungen [solaris.smf.*] zum Erstellen und Konfigurieren eines SMF-Services. Folgende Autorisierungen sind verf\u00FCgbar: [{1}].\nSiehe smf_security(5), rbac(5).\n
missingParamsInFile=Die Kennwortdatei, die als [{0}] angegeben wurde, enth\u00E4lt nicht die Eigenschaft [{1}] im erforderlichen Format. F\u00FChren Sie den Befehl erneut aus, nachdem Sie dieser Datei [{1}=Wert] in einer separaten Zeile hinzugef\u00FCgt haben.
serviceNameExists=Ein SMF-Service namens [{0}] scheint gem\u00E4\u00DF Befehl [svcs -a] auf diesem Rechner vorhanden zu sein. Versuchen Sie, den Service mit einem anderen Namen erneut zu erstellen.
runtimeStatusToString={0} ist {1}
fileNotFound=Datei {0} nicht gefunden.
error=Fehler
runtimeStatusToStringStopCluster.alreadyStopped=Die geclusterte Instanz {0} wurde bereits gestoppt.
runtimeStatusToStringStopCluster.success=Die geclusterte Instanz {0} wurde erfolgreich gestoppt.
runtimeStatusToStringStopCluster.stoppedToRunning=Dies sollte nicht m\u00F6glich sein. Die geclusterte Instanz {0} wurde gestoppt und ist nun: {1}
runtimeStatusToStringStopCluster.error=Die geclusterte Instanz {0} konnte nicht gestoppt werden. Urspr\u00FCnglich hatte sie den Status [{1}], und nun hat sie den Status [{2}].
runtimeStatusToStringStartCluster.alreadyStarted=Die geclusterte Instanz {0} wurde bereits ausgef\u00FChrt.
runtimeStatusToStringStartCluster.success=Die geclusterte Instanz {0} wurde erfolgreich gestartet.
runtimeStatusToStringStartCluster.startedToStopped=Dies sollte nicht m\u00F6glich sein. Die geclusterte Instanz {0} wurde ausgef\u00FChrt und ist nun: {1}
runtimeStatusToStringStartCluster.error=Die geclusterte Instanz {0} konnte nicht gestartet werden. Urspr\u00FCnglich hatte sie den Status [{1}], und nun hat sie den Status [{2}].

CertificateDN=Distinguished Name des selbst signierten X.509-Serverzertifikats lautet:\n[{0}]
SomeProblemWithKeytool= Der Domainerstellungsprozess enth\u00E4lt einen Schritt, in dem ein Prim\u00E4rschl\u00FCssel und\n ein selbst signiertes Serverzertifikat erstellt werden. Dieser Schritt war aus folgendem Grund nicht erfolgreich.\n Dies k\u00F6nnte darauf zur\u00FCckzuf\u00FChren sein, dass das von JDK angegebene Schl\u00FCsseltool-Programm nicht gefunden werden konnte (z. B.\n wenn Sie JRE ausf\u00FChren). Es kann allerdings auch ein anderer Grund vorliegen. Es besteht kein Grund zur Panik, da Sie\n das JDK-Schl\u00FCsseltool-Programm jederzeit verwenden k\u00F6nnen, um die erforderlichen Schritte auszuf\u00FChren. Es wird ein tempor\u00E4rer JKS-Keystore\n erstellt. Ersetzen Sie ihn vor der Verwendung f\u00FCr SSL durch einen ordnungsgem\u00E4\u00DFen Keystore.\n Detaillierte Informationen finden Sie in der Dokumentation. Aktueller Fehler ist:\n{0}

windows.services.passwordFileNotA=Die angegebene Kennwortdatei ist keine Datei: {0}
windows.services.passwordFileNotReadable=Die angegebene Kennwortdatei ist nicht lesbar: {0}
windows.services.noTargetDir=Erstellen eines Verzeichnisses f\u00FCr Services nicht m\u00F6glich in der Domain: {0}
services.alreadyCreated=\n\nEs wurden bereits Services f\u00FCr diesen Server erstellt.\nVersuchen Sie zun\u00E4chst, die Dateien wie folgt zu l\u00F6schen:\n         {1} {0}\nVerwenden Sie alternativ die Option "--force", damit sie automatisch gel\u00F6scht werden.\n
windows.services.install.bad=Fehler beim Versuch, GlassFish als Windows-Service zu installieren. \nDer R\u00FCckgabewert war: {0}.\nSTDERR: {1}\nSTDOUT: {2}
SMFServiceCreated=Der Service wurde erfolgreich erstellt. Die Einzelheiten sind im Folgenden aufgelistet:\nServicename: {0}\nServicetyp: {1}\nKonfigurationsverzeichnis des Services: {2}\nManifestdateiverzeichnis im System: {3}.\nSie haben den Service erstellt, m\u00FCssen ihn jedoch selbst starten. Die wichtigsten Solaris-Befehle sind im Folgenden aufgelistet:\n\n* /usr/bin/svcs  -a | grep {4}  // status\n* /usr/sbin/svcadm enable {4} // start\n* /usr/sbin/svcadm disable {4} // stop\n* /usr/sbin/svccfg delete {4} // uninstall
dryrun=\n********  Testlauf ********\nDer Service wurde nicht tats\u00E4chlich erstellt, w\u00E4re aber erfolgreich gewesen.\nF\u00FChren Sie den Befehl erneut ohne die Option "--dry-run" aus, um ihn tats\u00E4chlich auszuf\u00FChren.
WindowsServiceCreated=Der Windows-Service wurde erfolgreich erstellt. Er ist zum Start bereit. Die Einzelheiten sind im Folgenden aufgelistet:\nService-ID: {0}\nAnzeigename des Services:{1}\nSerververzeichnis: {2}\nKonfigurationsdatei f\u00FCr Windows Services Wrapper: {3}\nDer Service kann mit dem Windows Services Manager gesteuert werden, oder Sie k\u00F6nnen stattdessen den\nWindows Services Wrapper verwenden:\nStartbefehl:  {4}  start\nStoppbefehl:   {4}  stop\nNeustartbefehl:  {4}  restart\nDeinstallationsbefehl:  {4}  uninstall\nInstallationsbefehl:  {4}  install\nStatusbefehl: {4} status\nSie k\u00F6nnen au\u00DFerdem \u00FCberpr\u00FCfen, ob der Service installiert ist, mit "sc query state= all"\nwindows.services.uninstall.good=Der Windows-Service wurde gefunden und erfolgreich deinstalliert.
noSuitableServiceImplementation=Ihr Betriebssystem wird noch nicht unterst\u00FCtzt. Die derzeit unterst\u00FCtzten Plattformen sind Linux, Windows und SMF auf Solaris.
bad.server.dirs=Interner Fehler: Ung\u00FCltiges Argument f\u00FCr Serververzeichnisse.
noAsadminScript=Der Speicherort des Administrationsclientskripts kann nicht gefunden werden. Es sollte hier sein: {0}
xmlfiledump=\nHier befindet sich die generierte Konfigurationsdatei, die verwendet worden w\u00E4re (dies ist praktisch f\u00FCr das Debugging):\n
no_initd=Es ist kein Systemordner f\u00FCr Services vorhanden. Nach Folgendem wurde gesucht: {0}
no_write_dir=Sie haben keine Schreibberechtigung f\u00FCr {0}. F\u00FChren Sie den Befehl mit Root-Berechtigungen erneut aus.
no_rc=Die Servicekonfiguration kann nicht bestimmt werden. Es muss eine nicht standardm\u00E4\u00DFige Konfiguration sein, da folgendes Verzeichnis nicht vorhanden ist: {0}.\nF\u00FCr dieses System k\u00F6nnen keine Services erstellt werden.
no_rc2=Die Servicekonfiguration kann nicht bestimmt werden. Es muss eine nicht standardm\u00E4\u00DFige Konfiguration sein, da\nin/etc- oder /etc/init.d -Verzeichnissen keine rc?.d-Verzeichnisse vorhanden waren. F\u00FCr dieses System k\u00F6nnen keine Services erstellt werden.
linux.services.uninstall.good=Der Linux-Service wurde gefunden und erfolgreich deinstalliert.
LinuxServiceCreated=Der Service wurde erfolgreich erstellt. Die Details sind im Folgenden aufgelistet:\nServicename:{0}\nServicetyp:{1}\nKonfigurationsverzeichnis des Services:{2}\nBenutzeraccount zum Ausf\u00FChren des Services: {3}\nSie haben den Service erstellt, m\u00FCssen ihn jedoch selbst starten. Folgendes sind die wichtigsten Linux-Befehle:\n\n* /etc/init.d/{4} start\n* /etc/init.d/{4} stop\n* /etc/init.d/{4} restart\n
# Do not translate PATH as it is a reserved operating system variable name
no_updater=Das Ubuntu Services Updater-Programm konnte im Pfad nicht gefunden werden. Das Programm hei\u00DFt {0}. \nSuchen Sie es, und f\u00FCgen Sie es zum PATH hinzu.
cant_delete=Folgende Datei kann nicht gel\u00F6scht werden: {0}. L\u00F6schen Sie sie manuell, oder melden Sie sich mit h\u00F6heren Berechtigungen an, und f\u00FChren Sie den Befehl erneut aus.
too_many_links=Zu viele \u00FCbereinstimmende Linkdateien gefunden. Um sicher zu gehen, wurden diese NICHT gel\u00F6scht. L\u00F6schen Sie sie manuell, und/oder \n\u00E4ndern Sie den Namen des Services, um Konflikte zu vermeiden. Dies sind die Linkdateinamen: \n{0}
ln_error=Fehler beim Erstellen eines Softlinks mit diesem Befehl: {0}\nFolgende Exception: {1}
no_delete_yet="delete-service" wurde noch nicht f\u00FCr diese Plattform implementiert.
not_installed=Der Service ist nicht installiert.
cant_exec={0} kann nicht ausgef\u00FChrt werden. Versuchen Sie, umfangreichere Zugriffsberechtigungen zu erhalten, oder melden Sie sich als Root an.
