#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

internal.error=Error interno: {0}.
validator.invalid_value=Valor no v\u00E1lido para {0}: {1}
validator.invalid_type=Tipo no v\u00E1lido para {0}. Se esperaba {1} o el subtipo, pero se ha obtenido {2}
fileValidator.no_read=No se dispone de permiso de lectura: {0}
fileValidator.no_write=No se dispone de permiso de escritura: {0}
fileValidator.not_a_dir={0} no es un directorio
portValidator.in_use=El puerto {0} est\u00E1 en uso
domainConfig=configuraci\u00F3n de dominio
keyFileNotCreated=Error al crear el archivo de claves
adminUserComment=# Domain User and Password - Do Not Delete Entry Above
serverPolicyNotCreated=Error al crear server.policy
keyStoreNotCreated=Error al crear el almac\u00E9n de claves {0}
trustStoreNotCreated=Error al crear el almac\u00E9n de confianza {0}
masterPasswordFileNotCreated=Error al crear el archivo de contrase\u00F1as maestras {0}
timerDbnNotCreated=Error al crear el archivo dbn de la base de datos de temporizadores
timerWalNotCreated=Error al crear el archivo wal de la base de datos de temporizadores
jbiRegistryTemplateNotCopied=Error al copiar el archivo de plantilla del registro de JBI
installRoot=ra\u00EDz de instalaci\u00F3n
cannotDeleteJmsProviderInstance=Error al suprimir la instancia del broker de MQ
masterPasswordFileNotRead=Error al leer el archivo de contrase\u00F1as maestras {0}

keyStorePasswordNotChanged=Error al cambiar la contrase\u00F1a del almac\u00E9n de claves para el almac\u00E9n {0}

s1asKeyPasswordNotChanged=Error al cambiar la contrase\u00F1a de la clave por defecto con el alias s1as para el almac\u00E9n {0}

passwordAliasPasswordNotChanged=Error al cambiar la contrase\u00F1a del almac\u00E9n de alias de contrase\u00F1as {0}

passwordAliasKeystoreNotCreated=No se ha podido crear un almac\u00E9n de claves de alias de contrase\u00F1as {0}

couldNotValidateMasterPassword=Se ha producido una excepci\u00F3n al validar la contrase\u00F1a maestra con el almac\u00E9n {0}

masterPasswordInvalid=La contrase\u00F1a introducida no es v\u00E1lida
derbyEjbTimerDBNotCreated=No se ha podido crear la base de datos del temporizador de EJB embebida; mensaje detallado: {0}
noDerbyLog=No se ha podido leer el archivo log derby. No hay ninguna informaci\u00F3n detallada disponible.
nullArg=Se ha especificado un argumento nulo.
smfTokenNeeded=El token necesario [{0}] se ha inicializado con un valor no v\u00E1lido [{1}]. Defina el valor correctamente con la interfaz de ServiceHandler.
invalidTO=Valor no v\u00E1lido [{0}] especificado como timeout. S\u00F3lo se permiten valores enteros no negativos.
serviceNameInvalid=Nombre no v\u00E1lido [{0}] para el servicio.
smfLeftoverFiles=Ha habido un intento anterior de crear un servicio con el mismo nombre. Seleccione otro nombre para el servicio o suprima el servicio y el directorio correspondiente [{0}] y vuelva a intentarlo.
doesNotExist=No se ha encontrado el objeto [{0}].
serviceTypeNotSet=El tipo de servicio no est\u00E1 configurado correctamente.
serviceTemplateNotFound=La plantilla de servicio [{0}] no existe; se ha producido un error en el entorno de configuraci\u00F3n como, por ejemplo, INSTALL_ROOT, etc.
notSolaris10=La plataforma presente, sistema operativo: {0} versi\u00F3n: {1} no es Solaris 10. No est\u00E1 soportada esta utilidad en plataformas que no sean Solaris 10.
noPermissionToCreateManifest=El usuario [{0}] no tiene permiso para crear los archivos y directorios relacionados con el manifiesto de servicio en [{1}]. Esta estructura es necesaria para las directrices de SMF. Convi\u00E9rtase en superusuario para realizar esta operaci\u00F3n o p\u00F3ngase en contacto con el Administrador del Sistema para obtener de forma expl\u00EDcita los permisos pertinentes y vuelva a intentarlo.
noSmfAuth=Parece que el usuario [{0}] no dispone de las autorizaciones necesarias [solaris.smf.*] en este sistema para crear y configurar un servicio de SMF. Las autorizaciones disponibles son [{1}].\nConsulte smf_security(5), rbac(5).\n
missingParamsInFile=El archivo de contrase\u00F1as especificado como [{0}] no contiene la propiedad [{1}] con el formato necesario. Vuelva a ejecutar el comando despu\u00E9s de agregar [{1}=valor] a este archivo en una l\u00EDnea independiente.
serviceNameExists=Parece que existe un servicio de SMF con el nombre [{0}], tal y como muestra el comando [svcs -a] en esta m\u00E1quina. Intente crear de nuevo el servicio con otro nombre.
runtimeStatusToString={0} es {1}
fileNotFound=No se ha encontrado el archivo {0}.
error=error
runtimeStatusToStringStopCluster.alreadyStopped=La instancia en cluster {0} ya se hab\u00EDa parado.
runtimeStatusToStringStopCluster.success=La instancia en cluster {0} se ha parado correctamente.
runtimeStatusToStringStopCluster.stoppedToRunning=Esto no es posible. La instancia en cluster {0} se ha parado y ahora es: {1}
runtimeStatusToStringStopCluster.error=La instancia en cluster {0} no se ha podido parar. Originalmente estaba en este estado: [{1}] y ahora est\u00E1 en el estado siguiente: [{2}].
runtimeStatusToStringStartCluster.alreadyStarted=La instancia en cluster {0} ya se est\u00E1 ejecutando.
runtimeStatusToStringStartCluster.success=La instancia en cluster {0} se ha iniciado correctamente.
runtimeStatusToStringStartCluster.startedToStopped=Esto no es posible. La instancia en cluster {0} estaba en ejecuci\u00F3n y ahora es: {1}
runtimeStatusToStringStartCluster.error=La instancia en cluster {0} no se ha podido iniciar. Originalmente estaba en este estado: [{1}] y ahora est\u00E1 en el estado siguiente: [{2}].

CertificateDN=El nombre distinguido del certificado del servidor X.509 autofirmado es:\n[{0}]
SomeProblemWithKeytool= El proceso de creaci\u00F3n de un dominio incluye el paso de crear una clave primaria y\n un certificado de servidor autofirmado. La raz\u00F3n por la que falla este paso se muestra a continuaci\u00F3n.\n Esto se podr\u00EDa deber a que el programa keytool que ofrece JDK no se ha encontrado (p. ej.\n est\u00E1 ejecutando con JRE) o por otra raz\u00F3n. No pasa nada, ya que\n puede utilizar el programa keytool de JDK siempre que lo necesite. Se crear\u00E1 un almac\u00E9n\n de claves JKS temporal. Debe sustituirlo con un almac\u00E9n de claves adecuado antes de usarlo para SSL.\n Consulte la documentaci\u00F3n para obtener m\u00E1s informaci\u00F3n. El error real es:\n{0}

windows.services.passwordFileNotA=El archivo de contrase\u00F1as que ha especificado no es un archivo: {0}
windows.services.passwordFileNotReadable=El archivo de contrase\u00F1as que ha especificado no se puede leer: {0}
windows.services.noTargetDir=No se puede crear un directorio para servicios en el dominio: {0}
services.alreadyCreated=\\n\\nYa se han creado servicios para este servidor.\\nIntente suprimir primero los archivos similares:\\n         {1} {0}\\nO bien -- utilice la opci\u00F3n --force y se suprimir\u00E1n autom\u00E1ticamente.\\n
windows.services.install.bad=Error al intentar instalar GlassFish como un servicio de Windows. \nEl valor de retorno ha sido: {0}.\nSTDERR: {1}\nSTDOUT: {2}
SMFServiceCreated=El servicio se ha creado correctamente. A continuaci\u00F3n se muestran los detalles:\nNombre del servicio:{0}\nTipo de servicio:{1}\nUbicaci\u00F3n de configuraci\u00F3n del servicio:{2}\nUbicaci\u00F3n del archivo de manifiesto en el sistema:{3}.\nHa creado el servicio, pero debe iniciarlo usted mismo. \u00C9stos son los comandos m\u00E1s habituales de Solaris:\n\n* /usr/bin/svcs  -a | grep {4}  // status\n* /usr/sbin/svcadm enable {4} // start\n* /usr/sbin/svcadm disable {4} // stop\n* /usr/sbin/svccfg delete {4} // uninstall
dryrun=\n********  Ejecuci\u00F3n Simulada ********\nEl servicio no se ha creado realmente, pero se podr\u00EDa haber creado correctamente.\nVuelva a ejecutar el comando sin la opci\u00F3n --dry-run para ejecutarla realmente.
WindowsServiceCreated=El servicio de Windows se ha creado correctamente. Est\u00E1 listo para iniciarse. Aqu\u00ED se muestran los detalles:\nID del servicio: {0}\nNombre mostrado del servicio:{1}\nDirectorio del servidor: {2}\nArchivo de configuraci\u00F3n para el envoltorio de servicios de Windows: {3}\nEl servicio se puede controlar mediante el Administrador de servicios de Windows o puede utilizar el envoltorio de servicios de\nWindows en su lugar:\nComando de inicio: {4}  start\nComando de parada:   {4}  stop\nComando de reinicio:  {4}  restart\nComando de desinstalaci\u00F3n:  {4}  uninstall\nComando de instalaci\u00F3n:  {4}  install\nComando de estado: {4} status\nTambi\u00E9n puede verificar si el servicio est\u00E1 instalado (o no) con ''sc query state= all''\nwindows.services.uninstall.good=Se ha encontrado el servicio de Windows y se ha desinstalado correctamente.
noSuitableServiceImplementation=Su sistema operativo a\u00FAn no est\u00E1 soportado. Actualmente, las plataformas soportadas son Linux, Windows y SMF en Solaris.
bad.server.dirs=Error interno: argumento Dirs de servidor err\u00F3neo.
noAsadminScript=No se ha encontrado la ubicaci\u00F3n del script del cliente de administraci\u00F3n. Se supone que deber\u00EDa estar aqu\u00ED: {0}
xmlfiledump=\nAqu\u00ED est\u00E1 el archivo de configuraci\u00F3n generado que se habr\u00EDa utilizado (esto es pr\u00E1ctico para realizar la depuraci\u00F3n):\n
no_initd=No hay carpeta de sistema para Servicios. Se estaba buscando: {0}
no_write_dir=No tiene permisos para escribir en {0}. Vuelva a ejecutar el comando con privilegios de usuario root.
no_rc=No se puede determinar la configuraci\u00F3n de sus servicios. Debe ser no est\u00E1ndar porque este directorio: {0} no existe.\n Desafortunadamente, no hemos podido crear servicios para este sistema.
no_rc2=No se puede determinar la configuraci\u00F3n de sus servicios. Debe ser no est\u00E1ndar porque no exist\u00EDan directorios rc?.d\nen los directorios /etc ni /etc/init.d. Desafortunadamente, no hemos podido crear servicios para este sistema.
linux.services.uninstall.good=Se ha encontrado el servicio de Linux y se ha desinstalado correctamente.
LinuxServiceCreated=El servicio se ha creado correctamente. A continuaci\u00F3n se muestran los detalles:\nNombre del servicio:{0}\nTipo del servicio:{1}\nUbicaci\u00F3n de la configuraci\u00F3n del servicio:{2}\nCuenta de usuario que ejecutar\u00E1 el servicio: {3}\nHa creado el servicio, pero debe iniciarlo usted mismo. Estos son los comandos m\u00E1s habituales de Linux:\n\n* /etc/init.d/{4} start\n* /etc/init.d/{4} stop\n* /etc/init.d/{4} restart\n
# Do not translate PATH as it is a reserved operating system variable name
no_updater=No se ha encontrado el programa Ubuntu Services Updater en su ruta de acceso. El programa se llama {0}. \\nLocal\u00EDcelo y agr\u00E9guelo a PATH.
cant_delete=No se ha podido suprimir este archivo: {0}. Supr\u00EDmalo manualmente, o con\u00E9ctese con privilegios m\u00E1s altos y vuelva a ejecutar el comando.
too_many_links=Se han encontrado demasiados archivos de enlaces que coinciden. Por motivos de seguridad, NO se han suprimido. Supr\u00EDmalos manualmente y/o plant\u00E9ese \ncambiar el nombre del servicio de modo que no cause ning\u00FAn conflicto. A continuaci\u00F3n se muestran los nombres de los archivos de enlaces: \n{0}
ln_error=Error al intentar crear un enlace l\u00F3gico con este comando: {0}\nSe ha obtenido esta excepci\u00F3n: {1}
no_delete_yet=delete-service a\u00FAn no est\u00E1 implantado para esta plataforma.
not_installed=El servicio no est\u00E1 instalado.
cant_exec=No se puede ejecutar {0}. Pruebe a obtener los privilegios de acceso aumentados o con\u00E9ctese como root.
