#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


button.ok=OK
button.cancel=\u53D6\u6D88
connection.direct=\u76F4\u63A5
connection.proxy=\u30D7\u30ED\u30AD\u30B7\u7D4C\u7531
connection.proxy.host=\u30D7\u30ED\u30AD\u30B7\u30FB\u30DB\u30B9\u30C8:
connection.proxy.port=\u30D7\u30ED\u30AD\u30B7\u30FB\u30DD\u30FC\u30C8:
connection.title=\u30A4\u30F3\u30BF\u30FC\u30CD\u30C3\u30C8\u63A5\u7D9A
connection.helpText=GlassFish\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30A4\u30F3\u30BF\u30FC\u30CD\u30C3\u30C8\u306B\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u30D7\u30ED\u30AD\u30B7\u304C\u5FC5\u8981\u306A\u5834\u5408\u306F\u3001\u30D7\u30ED\u30AD\u30B7\u306E\u30DB\u30B9\u30C8\u3068\u30DD\u30FC\u30C8\u306E\u60C5\u5831\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
console.moreInfo.link=https://glassfish.dev.java.net/
console.moreInfo.linkText=\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u8A73\u7D30
install.pageTitle=GlassFish\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB - \u30A4\u30F3\u30B9\u30C8\u30FC\u30EB
install.text=GlassFish\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u306B\u306F\u3001\u30A4\u30F3\u30BF\u30FC\u30CD\u30C3\u30C8\u63A5\u7D9A\u3092\u6307\u5B9A\u3057\u3066\u300COK\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
product.title=GlassFish Server\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB
status.current=\u30B9\u30C6\u30FC\u30BF\u30B9:
status.loading=\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u8D77\u52D5\u4E2D\u3067\u3059\u3002\u304A\u5F85\u3061\u304F\u3060\u3055\u3044\u3002
status.spin.alt=\u30B9\u30C6\u30FC\u30BF\u30B9\u30FB\u30A4\u30F3\u30C7\u30A3\u30B1\u30FC\u30BF\u306E\u753B\u50CF\u3002
status.pageTitle=GlassFish Server\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB
status.text=\u30D6\u30E9\u30A6\u30B6\u3067\u30DA\u30FC\u30B8\u304C\u81EA\u52D5\u7684\u306B\u30EA\u30D5\u30EC\u30C3\u30B7\u30E5\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u30DA\u30FC\u30B8\u306E\u518D\u30ED\u30FC\u30C9\u3092\u884C\u3063\u3066\u304F\u3060\u3055\u3044\u3002
status.welcometo=\u3088\u3046\u3053\u305D 
thankYou=GlassFish\u3078\u3088\u3046\u3053\u305D!!

state.uninitialized=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u30FB\u30A2\u30C0\u30D7\u30BF\u304C\u307E\u3060\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
state.authenticating=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u306B\u306F\u3001\u4E8B\u524D\u306B\u8A8D\u8A3C\u304C\u5FC5\u8981\u3067\u3059\u3002
state.permissionNeeded=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u307E\u305F\u306F\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u306B\u306F\u3001\u6A29\u9650\u304C\u5FC5\u8981\u3067\u3059\u3002
state.permissionGranted=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u307E\u305F\u306F\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u305F\u3081\u306E\u6A29\u9650\u304C\u3042\u308A\u307E\u3059\u3002
state.canceled=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u304C\u53D6\u308A\u6D88\u3055\u308C\u307E\u3057\u305F\u3002
state.downloading=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EBWeb\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u4E2D\u3067\u3059...
state.downloaded=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EBWeb\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u307E\u3057\u305F\u3002
state.expanding=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EBwar\u30D5\u30A1\u30A4\u30EB\u306E\u5C55\u958B\u4E2D\u3067\u3059...
state.expanded=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EBwar\u30D5\u30A1\u30A4\u30EB\u304C\u5C55\u958B\u3055\u308C\u307E\u3057\u305F\u3002
state.installing=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u4E2D\u3067\u3059...
state.installedNotLoaded=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306F\u3059\u3067\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u307E\u3059\u304C\u3001\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
state.loading=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u8D77\u52D5\u4E2D\u3067\u3059\u3002\u304A\u5F85\u3061\u304F\u3060\u3055\u3044\u3002
state.loaded=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u30FB\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3059\u3002
state.notInstalled=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u30FB\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u307E\u3060\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
state.prepareRedeploy=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u30FB\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3092\u6E96\u5099\u3057\u3066\u3044\u307E\u3059...
state.cleanupFailed=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u4EE5\u524D\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30AF\u30EA\u30FC\u30CB\u30F3\u30B0\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F
state.backupFailed=__admingui\u306E\u540D\u524D\u3092__admingui.backup\u306B\u5909\u66F4\u3067\u304D\u307E\u305B\u3093
state.cleaningBackup=\u4E00\u6642\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3057\u3066\u3044\u307E\u3059...
state.cleanupFailed=\u4E00\u6642\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30FB\u30D5\u30A1\u30A4\u30EB\u306F\u9664\u53BB\u3055\u308C\u307E\u3057\u305F
state.restore=\u4EE5\u524D\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u305F\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u5FA9\u5143\u3057\u3066\u3044\u307E\u3059...
state.upgradeFailed=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u30D5\u30A1\u30A4\u30EB\u307E\u305F\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u6A29\u9650\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002


statusNotAvailable.pageTitle=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093
statusNotAvailable.text=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306F\u3001\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u306E\u307F\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002

http.bad.method=\u30E1\u30BD\u30C3\u30C9\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093
