#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

noApplications=Aucune application trouv\u00E9e.
nothingToList=Aucun \u00E9l\u00E9ment \u00E0 r\u00E9pertorier.
create.connector.resource=Cr\u00E9e une ressource de connecteur avec le nom JNDI indiqu\u00E9
create.connector.resource.poolname=Nom du pool de connexions de connecteur. Si plusieurs \u00E9l\u00E9ments de ressource de connecteur pointent vers le m\u00EAme \u00E9l\u00E9ment du pool de connexions, ils utilisent la m\u00EAme connexion du pool lors de l'ex\u00E9cution.
create.connector.resource.objecttype=
create.connector.resource.description=Texte de description de la ressource de connecteur.
create.connector.resource.jndi_name=Nom JNDI de cette ressource de connecteur.
create.connector.resource.enabled=D\u00E9termine si la ressource de connecteur est activ\u00E9e lors de l'ex\u00E9cution. La valeur par d\u00E9faut est True.
create.connector.resource.success=Ressource de connecteur {0} cr\u00E9\u00E9e.
create.connector.resource.duplicate=Une ressource nomm\u00E9e {0} existe d\u00E9j\u00E0.
create.connector.resource.fail=Impossible de cr\u00E9er la ressource de connecteur {0}.
create.connector.resource.noJndiName=Aucun nom JNDI d\u00E9fini pour la ressource de connecteur.
create.connector.resource.connPoolNotFound=Valeur d''attribut (pool-name = {0}) introuvable dans la liste de pools de connexions de connecteur.
delete.connector.resource=Enl\u00E8ve une ressource de connecteur portant le nom JNDI indiqu\u00E9
delete.connector.resource.jndi_name=Nom JNDI de cette ressource de connecteur \u00E0 enlever.
delete.connector.resource.success=Ressource de connecteur {0} supprim\u00E9e.
delete.connector.resource.fail=Impossible de supprimer la ressource de connecteur {0}.
delete.connector.resource.noJndiName=Aucun nom JNDI d\u00E9fini pour la ressource de connecteur.
delete.connector.resource.notfound=La ressource de connecteur nomm\u00E9e {0} n''existe pas.
delete.connector.resource.resource-ref.exist=La ressource de connecteur [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans une cible d''instance/de cluster. Utilisez delete-resource-ref sur la cible appropri\u00E9e.
delete.connector.resource.multiple.resource-refs=La ressource de connecteur [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans plusieurs cibles d''instance/de cluster. Utilisez delete-resource-ref sur la cible appropri\u00E9e.
delete.connector.resource.no.resource-ref=La ressource de connecteur [ {0} ] n''est pas r\u00E9f\u00E9renc\u00E9e dans la cible [ {1} ]
delete.connector.resource.notAllowed=Impossible de supprimer la ressource {0} car elle doit obligatoirement \u00EAtre configur\u00E9e dans le syst\u00E8me.
list.connector.resources=Liste toutes les ressources de connecteur
list.connector.resources.success=La commande list-connector-resources a \u00E9t\u00E9 ex\u00E9cut\u00E9e.
list.connector.resources.fail=Echec de la commande list-connector-resources.
list.connector.resources.empty=Aucun \u00E9l\u00E9ment \u00E0 r\u00E9pertorier.
create.connector.connection.pool=Ajoute un pool de connexions avec le nom indiqu\u00E9
create.connector.connection.pool.raname=Nom de l'adaptateur de ressources.
create.connector.connection.pool.connectiondefinition=Nom de la d\u00E9finition de connexion.
create.connector.connection.pool.steadypoolsize=Nombre minimal et initial de connexions g\u00E9r\u00E9es dans le pool. La valeur par d\u00E9faut est 8.
create.connector.connection.pool.maxpoolsize=Nombre maximal de connexions pouvant \u00EAtre cr\u00E9\u00E9es pour r\u00E9pondre \u00E0 la demande client. La valeur par d\u00E9faut est 32.
create.connector.connection.pool.maxwait=Dur\u00E9e totale, en millisecondes, pendant laquelle un appelant doit patienter avant la cr\u00E9ation d'une connexion, si aucune connexion n'est disponible. Si la valeur de la dur\u00E9e est 0, l'appelant est bloqu\u00E9 pendant un temps ind\u00E9fini jusqu'\u00E0 ce qu'une ressource soit disponible ou qu'une erreur survienne. La valeur par d\u00E9faut est 60 000.
create.connector.connection.pool.poolresize=Nombre de connexions \u00E0 ajouter ou \u00E0 supprimer lors d'un redimensionnement du pool. Ajout : lorsque le pool ne comporte plus de connexions disponibles, ce nombre de connexions est ajout\u00E9. Suppression : toutes les connexions non valides et inactives sont supprim\u00E9es, le nombre de connexions supprim\u00E9es peut parfois \u00EAtre plus \u00E9lev\u00E9 que cette valeur. La taille de pool constante (steadypoolsize) est assur\u00E9e. Les valeurs possibles sont comprises entre 0 et 32. La valeur par d\u00E9faut est 2.
create.connector.connection.pool.ping=Un pool pour lequel cet attribut a la valeur True fait l'objet d'une commande Ping lors de la reconfiguration ou de la cr\u00E9ation du pool. Cela permet d'identifier et de signaler toute valeur erron\u00E9e de ses attributs. La valeur par d\u00E9faut de cet attribut est False.
create.connector.connection.pool.pooling=Lorsqu'il a la valeur False, cet attribut d\u00E9sactive le groupement des connexions. La valeur par d\u00E9faut de cet attribut est True.
create.connector.connection.pool.idletimeout=Dur\u00E9e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool. Une fois ce d\u00E9lai \u00E9coul\u00E9, le pool peut fermer cette connexion. La valeur par d\u00E9faut est 300.
create.connector.connection.pool.isconnectvalidatereq=Avec la valeur True, les connexions seront v\u00E9rifi\u00E9es pour d\u00E9terminer si elles sont utilisables avant d'\u00EAtre envoy\u00E9es \u00E0 l'application. La valeur par d\u00E9faut est False.
create.connector.connection.pool.failconnection=Avec la valeur True, toutes les connexions du pool sont ferm\u00E9es en cas d'\u00E9chec d'un seul contr\u00F4le de validation. Ce param\u00E8tre est obligatoire si la valeur True est affect\u00E9e \u00E0 is-connection-validation-required. Les valeurs autoris\u00E9es sont on, off, yes, no, 1, 0, True ou False. La valeur par d\u00E9faut est False.
create.connector.connection.pool.transactionsupport= Indique le niveau de prise en charge des transactions dont disposera ce pool. Les valeurs possibles sont 'XATransaction', 'LocalTransaction' et 'NoTransaction'. Cet attribut peut poss\u00E9der une valeur inf\u00E9rieure ou \u00E9gale (mais non sup\u00E9rieure) \u00E0 l'attribut de prise en charge des transactions de l'adaptateur de ressources. L'attribut de prise en charge des transactions de l'adaptateur de ressources comporte un ordre de valeurs, 'XATransaction' \u00E9tant la plus \u00E9lev\u00E9e et 'NoTransaction', la plus faible.
create.connector.connection.pool.description=Texte de description du pool de connexions de connecteur indiqu\u00E9.
create.connector.connection.pool.property=Paires nom d'attribut/valeur facultatives permettant de configurer le pool de connexions de connecteur.
create.connector.connection.pool.connector_connection_pool_name=Nom du pool de connexions de connecteur \u00E0 cr\u00E9er.
create.connector.connection.pool.success=Pool de connexions de connecteur {0} cr\u00E9\u00E9.
create.connector.connection.pool.fail=Echec de la cr\u00E9ation du pool de connexions de connecteur {0}.
create.connector.connection.pool.noJndiName=Aucun nom d\u00E9fini pour le pool de connexions de connecteur.
create.connector.connection.pool.duplicate=Il existe d\u00E9j\u00E0 une ressource nomm\u00E9e {0}.
admin.mbeans.rmb.invalid_ra_connectdef_not_found=D\u00E9finition de connexion non valide. Module connecteur avec la d\u00E9finition de connexion {0} introuvable.
admin.mbeans.rmb.null_res_adapter=Le nom de l'adaptateur de ressources est NULL
admin.mbeans.rmb.invalid_ra_app_not_found=Nom non valide. L''application portant le nom {0} est introuvable.
admin.mbeans.rmb.invalid_ra_cm_not_found=Nom non valide. Le module connecteur portant le nom {0} est introuvable.
delete.connector.connection.pool=Enl\u00E8ve le pool de connexions de connecteur indiqu\u00E9
delete.connector.connection.pool.cascade=Avec la valeur True, toutes les ressources de connecteur associ\u00E9es au pool sont supprim\u00E9es, sauf le pool lui-m\u00EAme. Avec la valeur False, la suppression du pool \u00E9choue si des ressources sont associ\u00E9es \u00E0 celui-ci. Vous devez supprimer la ressource explicitement ou attribuer la valeur True \u00E0 l'option. Par d\u00E9faut, la valeur est False.
delete.connector.connection.pool.connector_connection_pool_name=Nom du pool de connexions de connecteur \u00E0 enlever.
delete.connector.connection.pool.success=Pool de connexions de connecteur {0} supprim\u00E9.
delete.connector.connection.pool.fail=Impossible de supprimer le pool de connexions de connecteur {0}.
delete.connector.connection.pool.notfound=Le pool de connexions de connecteur nomm\u00E9 {0} n''existe pas.
delete.connector.connection.pool.noJndiName=Aucun ID d\u00E9fini pour le pool de connexions de connecteur.
delete.connector.connection.pool.pool_in_use=Certaines ressources de connecteur font r\u00E9f\u00E9rence au pool de connexions {0}. Utilisez l''option "cascade" pour les supprimer \u00E9galement.
list.connector.connection.pools=Liste tous les pools de connexions de connecteur
list.connector.connection.pools.success=La commande list-connector-connection-pools a \u00E9t\u00E9 ex\u00E9cut\u00E9e.
list.connector.connection.pools.fail=Echec de la commande list-connector-connection-pools
list.connector.connection.pools.empty=Aucun \u00E9l\u00E9ment \u00E0 r\u00E9pertorier.
create.admin.object=Ajoute l'objet administr\u00E9 portant le nom JNDI indiqu\u00E9
create.admin.object.restype=Cette option permet d'administrer les types de ressource d'objet, tels que d\u00E9finis par l'adaptateur de ressources dans le fichier ra.xml.
create.admin.object.raname=Il s'agit du nom de l'adaptateur de ressources associ\u00E9 \u00E0 cet objet.
create.admin.object.description=Texte de description de la ressource de connecteur.
create.admin.object.jndi_name=Nom JNDI de l'objet administr\u00E9 \u00E0 cr\u00E9er.
create.admin.object.enabled=Indique si l'objet est activ\u00E9. La valeur par d\u00E9faut est True.
create.admin.object.success=Objet administr\u00E9 {0} cr\u00E9\u00E9.
create.admin.object.duplicate=Il existe d\u00E9j\u00E0 une ressource nomm\u00E9e {0}.
create.admin.object.fail=Impossible de cr\u00E9er l''objet administr\u00E9 {0}.
create.admin.object.noJndiName=Aucun nom JNDI d\u00E9fini pour l'objet administr\u00E9.
create.admin.object.raNotFound=Applications : la commande connector-module {0} de l''\u00E9l\u00E9ment de configuration est introuvable.
create.admin.object.noResTypes=Les noms d''interface d''objet d''administration (resTypes) sont introuvables dans ConnectorRuntime pour l''adaptateur de ressources {0}.
admin.mbeans.rmb.null_ao_intf=L''adaptateur de ressources {0} ne contient aucun type de ressource pour admin-object. Indiquez un autre \u00E9l\u00E9ment res-adapter.
admin.mbeans.rmb.ao_intf_impl_check_failed=Impossible de d\u00E9terminer les informations de ressource d''objet d''administration de l''adaptateur de ressources [ {0} ] pour le type de ressource [ {1} ] et l''\u00E9l\u00E9ment classname [ {2} ]
admin.mbeans.rmb.multiple_admin_objects.found.for.restype=Vous devez indiquer le param\u00E8tre classname admin-object (--classname) car plusieurs admin-objects utilisent ce type de ressource [ {0} ] 
admin.mbeans.rmb.invalid_res_type=Type de ressource non valide : {0}
delete.admin.object=Enl\u00E8ve l'objet administr\u00E9 portant le nom JNDI indiqu\u00E9
delete.admin.object.jndi_name=Nom JNDI de l'objet administr\u00E9 \u00E0 supprimer.
delete.admin.object.success=Objet administr\u00E9 {0} supprim\u00E9.
delete.admin.object.fail=Impossible de supprimer l''objet administr\u00E9 {0}.
delete.admin.object.noJndiName=Aucun nom JNDI d\u00E9fini pour l'objet administr\u00E9.
delete.admin.object.notfound=Il n''existe aucun objet administr\u00E9 appel\u00E9 {0}.
delete.admin.object.resource-ref.exist=La ressource d''objet d''administration [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans une cible d''instance/de cluster. Utilisez delete-resource-ref sur la cible appropri\u00E9e.
delete.admin.object.multiple.resource-refs=La ressource d''objet d''administration [ {0} ] est r\u00E9f\u00E9renc\u00E9e dans plusieurs cibles d''instance/de cluster. Utilisez delete-resource-ref sur la cible appropri\u00E9e.
delete.admin.object.no.resource-ref=La ressource d''objet d''administration [ {0} ] n''est pas r\u00E9f\u00E9renc\u00E9e dans la cible [ {1} ]
list.admin.objects=Liste tous les objets administr\u00E9s
list.admin.objects.success=La commande list-connector-resources a \u00E9t\u00E9 ex\u00E9cut\u00E9e.
list.admin.objects.fail=Echec de la commande list-connector-resources.
create.resource.adapter.config=Cr\u00E9e les informations de configuration du fichier domain.xml pour le module connecteur
create.resource.adapter.config.threadpoolid=ID du pool de threads \u00E0 partir duquel le gestionnaire de travaux obtient le thread. Cette option prend uniquement un ID du pool de threads.
create.resource.adapter.config.raname=Cet op\u00E9rande indique le nom du module connecteur. Il s'agit de la valeur de la commande resource-adapter-name figurant dans le fichier domain.xml.
create.resource.adapter.config.property=Cette option indique les propri\u00E9t\u00E9s de configuration du bean Java de l'adaptateur de ressources. Les propri\u00E9t\u00E9s peuvent \u00EAtre indiqu\u00E9es sous forme de paires nom/valeur s\u00E9par\u00E9es par le signe deux-points (:).
create.resource.adapter.confignoRAName=Aucun nom RA d\u00E9fini pour la configuration de l'adaptateur de ressources.
create.resource.adapter.config.duplicate=La configuration de l''adaptateur de ressources existe d\u00E9j\u00E0 pour le fichier RAR {0}.
create.resource.adapter.config.fail=Impossible de cr\u00E9er la configuration de l''adaptateur de ressources {0}. {1}
delete.resource.adapter.config=Supprime la configuration de l'adaptateur de ressources
delete.resource.adapter.config.raname=Cet op\u00E9rande permet d'indiquer le nom du module connecteur. Cette valeur est conserv\u00E9e dans resource-adapter-name, dans le fichier domain.xml.
delete.resource.adapter.config.noRARName=Aucun nom RAR d\u00E9fini pour la configuration de l'adaptateur de ressources.
delete.resource.adapter.config.notfound=Resource-Adapter-Config pour {0} n''existe pas.
delete.resource.adapter.config.fail=Impossible de supprimer la configuration de l''adaptateur de ressources {0}
list.resource.adapter.configs=Liste les noms des \u00E9l\u00E9ments resource\u2014adapter\u2014configs cr\u00E9\u00E9s
list.resource.adapter.configs.raname=Cette option indique le nom du module connecteur.
list.resource.adapter.configs.verbose=Cette option permet de lister les propri\u00E9t\u00E9s configur\u00E9es.
list.resource.adapter.configs.fail=Impossible de lister les configurations de l'adaptateur de ressources.
create.connector.work.security.map=Cr\u00E9e une mappe de s\u00E9curit\u00E9 du contexte de travail pour l'adaptateur de ressources indiqu\u00E9
create.connector.work.security.map.usagetext=create-connector-work-security-map\n\t--raname=raname\n\t--principalsmap (eisprincipal=mappedprincipal)[,eisprincipal=mappedprincipal]* |\n\t--groupsmap (eisgroup=mappedgroup)[,eisgroup=mappedgroup]*\n\t[--description <description>] [-?|--help[=<help(default:false)>]]\n\tmapname
create.connector.work.security.raname=Adaptateur de ressources demandant la mise en correspondance des identit\u00E9s du domaine EIS avec le domaine du serveur d'applications.
create.connector.work.security.principalsmap=Indique une liste d'ID utilisateur EIS back-end. Vous pouvez indiquer plusieurs ID utilisateur sous forme de liste d'\u00E9l\u00E9ments s\u00E9par\u00E9s par le signe deux-points. Utilisez l'option --principalsmap ou --groupsmap, mais pas les deux.
create.connector.work.security.groupsmap=Indique une liste de groupes d'utilisateurs EIS back-end. Vous pouvez indiquer plusieurs groupes sous forme de liste d'\u00E9l\u00E9ments s\u00E9par\u00E9s par le signe deux-points.
create.connector.work.security.mapname=Cette propri\u00E9t\u00E9 indique la mappe de s\u00E9curit\u00E9 de travail EIS.
create.connector.work.security.map.noRaName=Nom introuvable pour la mappe de s\u00E9curit\u00E9 de travail de connecteur.
create.connector.work.security.map.noMap=Aucun \u00E9l\u00E9ment principalsmap ou groupsmap d\u00E9fini pour la mappe de s\u00E9curit\u00E9 de travail du connecteur.
create.connector.work.security.map.specifyPrincipalsOrGroupsMap=Un \u00E9l\u00E9ment work-security-map peut comporter des correspondances de groupes (quel que soit le nombre) ou des correspondances d'ID utilisateur (quel que soit le nombre), mais pas les deux. Indiquez --principalsmap ou --groupsmap.
create.connector.work.security.map.duplicate=Une mappe de s\u00E9curit\u00E9 de travail du connecteur nomm\u00E9e {0} existe d\u00E9j\u00E0 pour l''adaptateur de ressources {1}.
create.connector.work.security.map.fail=Impossible de cr\u00E9er la mappe de s\u00E9curit\u00E9 de travail de connecteur {0}.
delete.connector.work.security.map=Supprime la mappe de s\u00E9curit\u00E9 de travail pour l'adaptateur de ressources indiqu\u00E9
delete.connector.work.security.map.raname=nom de l'adaptateur de ressources pour la mappe de s\u00E9curit\u00E9 de travail \u00E0 supprimer
delete.connector.work.security.map.mapname=nom de la mappe de s\u00E9curit\u00E9 de travail \u00E0 supprimer
delete.connector.work.security.map.notFound=Il n''existe pas de mappe de s\u00E9curit\u00E9 de travail de connecteur nomm\u00E9e {0} pour l''adaptateur de ressources {1}.
delete.connector.work.security.map.fail=Impossible de supprimer la mappe de s\u00E9curit\u00E9 de travail de connecteur {0} pour l''adaptateur de ressources {1}.
list.connector.work.security.maps=Liste toutes les mappes de s\u00E9curit\u00E9 de travail de connecteur pour l'adaptateur de ressources indiqu\u00E9.
list.connector.work.security.maps.fail=Impossible de lister la mappe de s\u00E9curit\u00E9 de travail de connecteur {0} pour l''adaptateur de ressources {1}.
list.connector.work.security.maps.eisPrincipalAndMappedPrincipal={0} : ID utilisateur EIS = {1}, ID utilisateur mis en correspondance = {2}
list.connector.work.security.maps.eisGroupAndMappedGroup= {0} : groupe EIS = {1}, groupe mis en correspondance = {2}
list.connector.work.security.maps.workSecurityMapNotFound=Aucun \u00E9l\u00E9ment \u00E0 lister. L''adaptateur de ressources {0} n''existe pas ou l''adaptateur de ressources {0} n''est associ\u00E9 \u00E0 aucune mappe de s\u00E9curit\u00E9 de travail. 
create.connector.security.map=Cr\u00E9e une mappe de s\u00E9curit\u00E9 pour le pool de connexions de connecteur indiqu\u00E9
create.connector.security.map.poolname=Indique le nom du pool de connexions de connecteur auquel appartient la mappe de s\u00E9curit\u00E9
create.connector.security.map.principals=Indique une liste d'ID utilisateur EIS back-end. Vous pouvez indiquer plusieurs ID utilisateur \u00E0 l'aide d'une liste d'\u00E9l\u00E9ments s\u00E9par\u00E9s par le signe deux-points (:). Utilisez l'option --principals ou --usergroups, mais pas les deux.
create.connector.security.map.usergroups=Indique une liste de groupes utilisateur EIS back-end. Vous pouvez indiquer plusieurs groupes utilisateur \u00E0 l'aide d'une liste d'\u00E9l\u00E9ments s\u00E9par\u00E9s par le signe deux-points (:).
create.connector.security.map.mappedusername=Cette propri\u00E9t\u00E9 indique le nom utilisateur EIS.
create.connector.security.map.mapname=Nom de la mappe de s\u00E9curit\u00E9 \u00E0 cr\u00E9er ou mettre \u00E0 jour.
create.connector.security.map.noSecurityMapName=Aucun \u00E9l\u00E9ment mapname indiqu\u00E9.
create.connector.security.map.duplicate=Une mappe de s\u00E9curit\u00E9 nomm\u00E9e {0} existe d\u00E9j\u00E0 pour le pool de connexions de connecteur {1}. Indiquez un autre nom de correspondance.
create.connector.security.map.principal_exists=L''ID utilisateur {0} existe d\u00E9j\u00E0 dans le pool de connexions de connecteur {1}. Indiquez un autre nom d''ID utilisateur.
create.connector.security.map.usergroup_exists=Le groupe d''utilisateurs {0} existe d\u00E9j\u00E0 dans le pool de connexions de connecteur {1}. Indiquez un autre nom de groupe d''utilisateurs.
create.connector.security.map.noPrincipalsOrGroupsMap=Vous devez indiquer l'ID utilisateur ou le groupe d'utilisateurs lors de la cr\u00E9ation d'une mappe de s\u00E9curit\u00E9. Aucun des deux ne peut \u00EAtre NULL.
create.connector.security.map.specifyPrincipalsOrGroupsMap=Un \u00E9l\u00E9ment work-security-map peut comporter des correspondances de groupe (quel que soit le nombre) ou des correspondances d'ID utilisateur (quel que soit le nombre), mais pas les deux. Indiquez --principals ou --usergroups.
create.connector.security.map.noSuchPoolFound=Le pool de connexions de connecteur {0} indiqu\u00E9 n''existe pas. Indiquez un nom de pool valide.
create.connector.security.map.fail=Impossible de cr\u00E9er une mappe de s\u00E9curit\u00E9 de connecteur {0} pour le pool de connexions de connecteur {1}
create.connector.security.map.usagetext=create-connector-security-map\n\t--poolname connector_connection_pool_name\n\t--principals principal-name[,principal-name]* |\n\t--usergroups user-group[,user-group]* --mappedusername user-name\n\t[-?|--help[=<help(default:false)>]] mapname
delete.connector.security.map=Supprime une mappe de s\u00E9curit\u00E9 pour le pool de connexions de connecteur indiqu\u00E9
delete.connector.security.map.poolname=Indique le nom du pool de connexions de connecteur auquel appartient la mappe de s\u00E9curit\u00E9 \u00E0 supprimer
delete.connector.security.map.mapname=Nom de la mappe de s\u00E9curit\u00E9 \u00E0 supprimer
delete.connector.security.map.notFound=Il n''existe aucune mappe de s\u00E9curit\u00E9 nomm\u00E9e {0} pour le pool de connexions de connecteur {1}.
delete.connector.security.map.fail=Impossible de supprimer la mappe de s\u00E9curit\u00E9 {0} pour le pool de connexions de connecteur {1}.
list.connector.security.maps=Liste les mappes de s\u00E9curit\u00E9 appartenant au pool de connexions de connecteur indiqu\u00E9
list.connector.security.maps.empty=Aucun \u00E9l\u00E9ment \u00E0 r\u00E9pertorier.
list.connector.security.securitymap=Le nom de la mappe de s\u00E9curit\u00E9 contenue dans le pool de connexions de connecteur \u00E0 partir duquel l'identit\u00E9 et les ID utilisateur doivent \u00EAtre list\u00E9s est indiqu\u00E9.
list.connector.security.pool-name=Nom du pool de connexions de connecteur pour lequel vous voulez lister les mappes de s\u00E9curit\u00E9
list.connector.security.maps.securityMapNotFound=La mappe de s\u00E9curit\u00E9 {0} n''existe pas pour le pool de connexions de connecteur {1}. Indiquez un nom de correspondance valide.
list.connector.security.maps.fail=Impossible de lister la mappe de s\u00E9curit\u00E9 {0} pour le pool de connexions de connecteur {1}
list.connector.security.maps.principals=\tID utilisateur
list.connector.security.maps.groups=\tGroupes d'utilisateurs
list.connector.security.maps.backendPrincipal=\tID back-end
list.connector.security.maps.username=\t\tNom utilisateur = {0}
list.connector.security.maps.password=\t\tMot de passe = {0}
update.connector.security.map=Cr\u00E9e ou modifie une mappe de s\u00E9curit\u00E9 pour le pool de connexions de connecteur indiqu\u00E9
update.connector.security.map.usagetext=Mettre \u00E0 jour la mappe de s\u00E9curit\u00E9 de connecteur \n\t--poolname connector_connection_pool_name\n\t[--addprincipals principal-name[,principal-name]*]\n\t[--addusergroups user-group[,user-group]*]\n\t[--removeprincipals principal-name[,principal-name]*]\n\t[--removeusergroups user-group[,user-group]*]\n\t[--mappedusername user-name] [-?|--help[=<help(default:false)>]] mapname
update.connector.security.map.poolname=Indique le nom du pool de connexions de connecteur auquel appartient la mappe de s\u00E9curit\u00E9 qui doit \u00EAtre mise \u00E0 jour ou cr\u00E9\u00E9e.
update.connector.security.map.addprincipals=Indique une liste d'ID utilisateur EIS, s\u00E9par\u00E9s par le signe deux-points, \u00E0 ajouter. Utilisez l'option --addprincipals ou --addusergroups, mais pas les deux \u00E0 la fois.
update.connector.security.map.addusergroups=Indique une liste de groupes d'utilisateurs EIS, s\u00E9par\u00E9s par le signe deux-points, \u00E0 ajouter. Utilisez l'option --addprincipals ou --addusergroups, mais pas les deux \u00E0 la fois.
update.connector.security.map.removeprincipals=Indique une liste d'ID utilisateur EIS, s\u00E9par\u00E9s par le signe deux-points, \u00E0 enlever.
update.connector.security.map.removeusergroups=Indique une liste de groupes d'utilisateurs EIS, s\u00E9par\u00E9s par le signe deux-points, \u00E0 enlever.
update.connector.security.map.mappedusername=Indique le nom utilisateur EIS
update.connector.security.map.mapname=nom de la mappe de s\u00E9curit\u00E9 \u00E0 cr\u00E9er ou mettre \u00E0 jour
update.connector.security.map.map_does_not_exist=La mappe de s\u00E9curit\u00E9 {0} n''existe pas pour le pool de connexions de connecteur {1}. Indiquez un nom de correspondance valide.
update.connector.security.map.same_principal_values=La valeur {0} est indiqu\u00E9e dans --addprincipals et --removeprincipals. Vous ne pouvez pas sp\u00E9cifier la m\u00EAme valeur pour ces options.
update.connector.security.map.same_usergroup_values=La valeur {0} est indiqu\u00E9e dans --addprincipals et --removeprincipals. Vous ne pouvez pas sp\u00E9cifier la m\u00EAme valeur pour ces options.
update.connector.security.map.principal_does_not_exists=L''ID utilisateur {0} que vous voulez supprimer n''existe pas dans le pool de connexions de connecteur {1}. Indiquez un nom d''ID utilisateur valide.
update.connector.security.map.usergroup_does_not_exists=Le groupe d''utilisateurs {0} que vous voulez supprimer n''existe pas dans le pool de connexions de connecteur {1}. Indiquez un nom de groupe d''utilisateurs valide.
update.connector.security.map.principals_usergroups_will_be_null=Les valeurs de la commande supprimeront l'ensemble des ID utilisateur et groupes d'utilisateurs. Vous ne pouvez pas tous les supprimer. Au moins l'un d'entre eux doit exister.
update.connector.security.map.fail=Impossible de mettre \u00E0 jour la mappe de s\u00E9curit\u00E9 {0} pour le pool de connexions de connecteur {1}.
update.connector.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Echec de l'ajout d'ID utilisateur \u00E0 une mappe de s\u00E9curit\u00E9 avec les groupes d'utilisateurs.
update.connector.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Echec de l'ajout de groupes d'utilisateurs \u00E0 une mappe de s\u00E9curit\u00E9 avec les ID utilisateur.
update.connector.work.security.map.noargs=La mise \u00E0 jour de la mappe de s\u00E9curit\u00E9 de travail de connecteur doit \u00EAtre ex\u00E9cut\u00E9e avec au moins un argument facultatif de type add(principals/usergroups) ou remove(principals/usergroups)
update.connector.work.security.map.noSuchRAFound=L''adaptateur de ressources {0} n''existe pas. Indiquez un nom d''adaptateur de ressources.
update.connector.work.security.map.mapNotExist=La mappe de s\u00E9curit\u00E9 de travail {0} n''existe pas pour l''adaptateur de ressources {1}. Indiquez un nom de mappe valide.
update.connector.work.security.map.samePrincipalValues=La valeur {0} est indiqu\u00E9e dans --addprincipals et --removeprincipals. Vous ne pouvez pas sp\u00E9cifier la m\u00EAme valeur pour ces options.
update.connector.work.security.map.sameUsergroupValues=La valeur {0} est indiqu\u00E9e dans --addprincipals et --removeprincipals. Vous ne pouvez pas sp\u00E9cifier la m\u00EAme valeur pour ces options.
update.connector.work.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Echec de l'ajout d'ID utilisateur \u00E0 une mappe de s\u00E9curit\u00E9 avec les groupes d'utilisateurs.
update.connector.work.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Echec de l'ajout de groupes d'utilisateurs \u00E0 une mappe de s\u00E9curit\u00E9 avec les ID utilisateur.
update.connector.work.security.map.principals_usergroups_will_be_null=Les valeurs de la commande supprimeront l'ensemble des ID utilisateur et groupes d'utilisateurs. Vous ne pouvez pas tous les supprimer. Au moins l'un d'entre eux doit exister.
update.connector.work.security.map.principalNotExists=L''ID utilisateur {0} que vous voulez supprimer n''existe pas dans la mappe de s\u00E9curit\u00E9 {1}. Indiquez un nom d''ID utilisateur valide.
update.connector.work.security.map.usergroupNotExists=Le groupe d''utilisateurs {0} que vous voulez supprimer n''existe pas dans la mappe de s\u00E9curit\u00E9 {1}. Indiquez un nom de groupe d''utilisateurs valide.
update.connector.work.security.map.principalExists=L''ID utilisateur {0} existe d\u00E9j\u00E0 dans la mappe de s\u00E9curit\u00E9 {1}. Indiquez un autre nom d''ID utilisateur.
update.connector.work.security.map.groupExists=Le groupe {0} existe d\u00E9j\u00E0 dans la mappe de s\u00E9curit\u00E9 {1}. Indiquez un autre nom de groupe.
update.connector.work.security.map.fail=Impossible de mettre \u00E0 jour la mappe de s\u00E9curit\u00E9 {0} pour l''adaptateur de ressources {1}.
flush.connection.pool.fail=Echec du vidage du pool de connexions pour {0}.
flush.connection.pool.notexist=Le pool de ressources {0} n''existe pas.
flush.connection.pool.pooling.disabled=Echec de la tentative de vidage du pool de connexions, car le groupement est d\u00E9sactiv\u00E9 pour le pool : {0}
ping.connection.pool=Teste la connectivit\u00E9 \u00E0 un pool de connexions donn\u00E9, qui peut \u00EAtre jdbc-connection-pool ou connector-connection-pool.
ping.connection.pool.pool_name=Nom du pool de connexions auquel envoyer la commande ping.
ping.connection.pool.success=La commande ping a \u00E9t\u00E9 envoy\u00E9e au pool de connexions {0}.
ping.connection.pool.fail=Echec de l''envoi de la commande ping au pool de connexions pour {0}.
ping.connection.pool.connPoolNotFound=Pool de connexions {0} introuvable.
ping.create.connector.connection.pool.fail=Tentative d''envoi de la commande ping lors de la cr\u00E9ation du pool de connexions de connecteur : {0}  - Echec.
ping.create.connector.connection.pool.success=Tentative d''envoi de la commande ping lors de la cr\u00E9ation du pool de connexions de connecteur : {0} - Succ\u00E8s.
pool.util.app.is.not.enabled=L''application [ {0} ], dans laquelle le pool [{1} ] est d\u00E9fini, n''est pas activ\u00E9e.
pool.util.app.does.not.exist=L''application [ {0} ] n''existe pas.
pool.util.module.does.not.exist=Le module [ {0} ] n''existe pas dans l''application [ {1} ]
pool.util.pool.does.not-exist=Le pool [ {0} ] n''existe pas.
pool.util.app.name.needed=--appname est n\u00E9cessaire lorsque --modulename est indiqu\u00E9
create.pmf.resource.not.supported=La ressource de fabrique de gestionnaire de persistance n''est plus prise en charge. Utilisez plut\u00F4t la commande jdbc-resource [ {0} ] r\u00E9f\u00E9renc\u00E9e par la commande persistence-manager-factory-resource [ {1} ] dans les applications.
