#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

noApplications=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
nothingToList=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
create.connector.resource=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u3067\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059
create.connector.resource.poolname=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3067\u3059\u3002\u8907\u6570\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u8981\u7D20\u304C\u540C\u3058\u63A5\u7D9A\u30D7\u30FC\u30EB\u8981\u7D20\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u305D\u308C\u3089\u306F\u5B9F\u884C\u6642\u306B\u540C\u3058\u30D7\u30FC\u30EB\u63A5\u7D9A\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
create.connector.resource.objecttype=
create.connector.resource.description=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306B\u3064\u3044\u3066\u306E\u8A73\u7D30\u3092\u8AAC\u660E\u3059\u308B\u30C6\u30AD\u30B9\u30C8\u3067\u3059\u3002
create.connector.resource.jndi_name=\u3053\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u3067\u3059\u3002
create.connector.resource.enabled=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u304C\u5B9F\u884C\u6642\u306B\u4F7F\u7528\u53EF\u80FD\u304B\u3069\u3046\u304B\u3092\u5224\u65AD\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002
create.connector.resource.success=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9{0}\u304C\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
create.connector.resource.duplicate={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30EA\u30BD\u30FC\u30B9\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.connector.resource.fail=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093: {0}\u3002
create.connector.resource.noJndiName=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.connector.resource.connPoolNotFound=\u5C5E\u6027\u5024(pool-name={0})\u304C\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30EA\u30B9\u30C8\u5185\u306B\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
delete.connector.resource=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u9664\u53BB\u3057\u307E\u3059
delete.connector.resource.jndi_name=\u9664\u53BB\u3055\u308C\u308B\u3053\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u3067\u3059\u3002
delete.connector.resource.success=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9{0}\u304C\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002
delete.connector.resource.fail=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
delete.connector.resource.noJndiName=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
delete.connector.resource.notfound={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.connector.resource.resource-ref.exist=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u30011\u3064\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
delete.connector.resource.multiple.resource-refs=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u3001\u8907\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
delete.connector.resource.no.resource-ref=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u3001\u30BF\u30FC\u30B2\u30C3\u30C8[ {1} ]\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u305B\u3093
delete.connector.resource.notAllowed={0}\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u30B7\u30B9\u30C6\u30E0\u5185\u3067\u69CB\u6210\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u305F\u3081\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
list.connector.resources=\u3059\u3079\u3066\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u30EA\u30B9\u30C8
list.connector.resources.success=\u30B3\u30DE\u30F3\u30C9list-connector-resources\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
list.connector.resources.fail=\u30B3\u30DE\u30F3\u30C9list-connector-resources\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
list.connector.resources.empty=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
create.connector.connection.pool=\u6307\u5B9A\u3055\u308C\u305F\u63A5\u7D9A\u30D7\u30FC\u30EB\u540D\u3067\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059
create.connector.connection.pool.raname=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u540D\u524D\u3002
create.connector.connection.pool.connectiondefinition=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u540D\u524D\u3002
create.connector.connection.pool.steadypoolsize=\u30D7\u30FC\u30EB\u3067\u7DAD\u6301\u3059\u308B\u63A5\u7D9A\u306E\u6700\u5C0F\u6570\u304A\u3088\u3073\u521D\u671F\u6570\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F8\u3067\u3059\u3002
create.connector.connection.pool.maxpoolsize=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u6E80\u305F\u3059\u305F\u3081\u306B\u4F5C\u6210\u3067\u304D\u308B\u63A5\u7D9A\u306E\u6700\u5927\u6570\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F32\u3067\u3059\u3002
create.connector.connection.pool.maxwait=\u63A5\u7D9A\u304C\u4F7F\u7528\u3067\u304D\u306A\u3044\u5834\u5408\u306B\u3001\u63A5\u7D9A\u304C\u4F5C\u6210\u3055\u308C\u308B\u307E\u3067\u547C\u51FA\u3057\u5074\u304C\u5F85\u3064\u5FC5\u8981\u304C\u3042\u308B\u6642\u9593(\u30DF\u30EA\u79D2)\u30020\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30EA\u30BD\u30FC\u30B9\u304C\u4F7F\u7528\u53EF\u80FD\u306B\u306A\u308B\u304B\u3001\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u307E\u3067\u3001\u547C\u51FA\u3057\u5074\u304C\u7121\u5236\u9650\u306B\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F60000\u3067\u3059\u3002
create.connector.connection.pool.poolresize=\u30D7\u30FC\u30EB\u304C\u63A5\u7D9A\u6570\u3092\u30B9\u30B1\u30FC\u30EB\u30A2\u30C3\u30D7\u307E\u305F\u306F\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3\u3059\u308B\u5358\u4F4D\u91CF\u3002\u30B9\u30B1\u30FC\u30EB\u30A2\u30C3\u30D7: \u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u306B\u7A7A\u304D\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u3053\u306E\u91CF\u306E\u30D7\u30FC\u30EB\u304C\u30B9\u30B1\u30FC\u30EB\u30A2\u30C3\u30D7\u3057\u307E\u3059\u3002\u30B9\u30B1\u30FC\u30EB\u30C0\u30A6\u30F3: \u7121\u52B9\u306A\u63A5\u7D9A\u3068\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u304C\u3059\u3079\u3066\u9664\u53BB\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u5024\u3088\u308A\u591A\u304F\u306E\u91CF\u306E\u63A5\u7D9A\u304C\u9664\u53BB\u3055\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u3002Steadypoolsize\u304C\u78BA\u4FDD\u3055\u308C\u307E\u3059\u3002\u4F7F\u7528\u53EF\u80FD\u306A\u5024\u306F0\u304B\u308932\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F2\u3067\u3059\u3002
create.connector.connection.pool.ping=\u3053\u306E\u5C5E\u6027\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u30D7\u30FC\u30EB\u306B\u5BFE\u3057\u3066\u3001\u305D\u306E\u4F5C\u6210\u4E2D\u307E\u305F\u306F\u518D\u69CB\u6210\u4E2D\u306Bping\u304C\u5B9F\u884C\u3055\u308C\u3001\u5C5E\u6027\u306B\u5BFE\u3059\u308B\u8AA4\u3063\u305F\u5024\u304C\u3042\u308C\u3070\u305D\u308C\u3092\u8B58\u5225\u3057\u3066\u8B66\u544A\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.connector.connection.pool.pooling=false\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u3053\u306E\u5C5E\u6027\u306F\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002
create.connector.connection.pool.idletimeout=\u30D7\u30FC\u30EB\u3067\u63A5\u7D9A\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u307E\u307E\u3067\u3044\u3089\u308C\u308B\u6700\u5927\u6642\u9593(\u79D2)\u3002\u3053\u306E\u6642\u9593\u304C\u7D4C\u904E\u3059\u308B\u3068\u3001\u30D7\u30FC\u30EB\u306F\u3053\u306E\u63A5\u7D9A\u3092\u9589\u3058\u3089\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F300\u3067\u3059\u3002
create.connector.connection.pool.isconnectvalidatereq=\u5024\u3092true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u63A5\u7D9A\u304C\u6E21\u3055\u308C\u308B\u524D\u306B\u3001\u4F7F\u7528\u3067\u304D\u308B\u63A5\u7D9A\u304B\u3069\u3046\u304B\u304C\u78BA\u8A8D\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.connector.connection.pool.failconnection=true\u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u306F\u30011\u3064\u306E\u691C\u8A3C\u30C1\u30A7\u30C3\u30AF\u306B\u5931\u6557\u3059\u308B\u3068\u30D7\u30FC\u30EB\u5185\u306E\u3059\u3079\u3066\u306E\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u307E\u3059\u3002is-connection-validation-required\u304Ctrue\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u306F\u5FC5\u9808\u3067\u3059\u3002\u6709\u52B9\u306A\u5024\u306F\u3001on\u3001off\u3001yes\u3001no\u30011\u30010\u3001true\u3001false\u3067\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ffalse\u3067\u3059\u3002
create.connector.connection.pool.transactionsupport= \u3053\u306E\u30D7\u30FC\u30EB\u306B\u8A2D\u5B9A\u3055\u308C\u308B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u306E\u30EC\u30D9\u30EB\u304C\u793A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u6307\u5B9A\u3067\u304D\u308B\u5024\u306F\u3001'XATransaction'\u3001'LocalTransaction'\u304A\u3088\u3073'NoTransaction'\u3067\u3059\u3002\u3053\u306E\u5C5E\u6027\u306B\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u5C5E\u6027\u4EE5\u4E0B\u306E\u5024\u3092\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u304C\u3001\u305D\u308C\u3088\u308A\u9AD8\u3044\u5024\u306F\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u5C5E\u6027\u306B\u306F\u5024\u306E\u9806\u5E8F\u304C\u3042\u308A\u3001'XATransaction'\u304C\u6700\u9AD8\u3067\u3001'NoTransaction'\u304C\u6700\u4F4E\u3067\u3059\u3002
create.connector.connection.pool.description=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u3064\u3044\u3066\u306E\u8A73\u7D30\u3092\u8AAC\u660E\u3059\u308B\u30C6\u30AD\u30B9\u30C8\u3002
create.connector.connection.pool.property=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u69CB\u6210\u3059\u308B\u305F\u3081\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u5C5E\u6027\u540D/\u5024\u30DA\u30A2\u3002
create.connector.connection.pool.connector_connection_pool_name=\u4F5C\u6210\u3055\u308C\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3002
create.connector.connection.pool.success=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u304C\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
create.connector.connection.pool.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
create.connector.connection.pool.noJndiName=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u30D7\u30FC\u30EB\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.connector.connection.pool.duplicate={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30EA\u30BD\u30FC\u30B9\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
admin.mbeans.rmb.invalid_ra_connectdef_not_found=\u63A5\u7D9A\u5B9A\u7FA9\u304C\u7121\u52B9\u3067\u3059\u3002\u63A5\u7D9A\u5B9A\u7FA9{0}\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
admin.mbeans.rmb.null_res_adapter=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u540D\u304Cnull\u3067\u3059
admin.mbeans.rmb.invalid_ra_app_not_found=\u7121\u52B9\u306A\u540D\u524D\u3067\u3059\u3002\u540D\u524D{0}\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
admin.mbeans.rmb.invalid_ra_cm_not_found=\u7121\u52B9\u306A\u540D\u524D\u3067\u3059\u3002\u540D\u524D{0}\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
delete.connector.connection.pool=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u9664\u53BB
delete.connector.connection.pool.cascade=true\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D7\u30FC\u30EB\u81EA\u4F53\u306F\u6B8B\u308A\u307E\u3059\u304C\u3001\u30D7\u30FC\u30EB\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u3059\u3079\u3066\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002false\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u304C\u30D7\u30FC\u30EB\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u3068\u3001\u30D7\u30FC\u30EB\u306E\u524A\u9664\u306B\u5931\u6557\u3057\u307E\u3059\u3002\u30EA\u30BD\u30FC\u30B9\u3092\u660E\u793A\u7684\u306B\u524A\u9664\u3059\u308B\u304B\u3001\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092true\u306B\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u306Ffalse\u3067\u3059\u3002
delete.connector.connection.pool.connector_connection_pool_name=\u9664\u53BB\u3055\u308C\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3002
delete.connector.connection.pool.success=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u304C\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002
delete.connector.connection.pool.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
delete.connector.connection.pool.notfound={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.connector.connection.pool.noJndiName=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306BID\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
delete.connector.connection.pool.pool_in_use=\u4E00\u90E8\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u304C\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002cascade\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u3001\u3053\u308C\u3089\u3082\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002
list.connector.connection.pools=\u3059\u3079\u3066\u306E\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u30EA\u30B9\u30C8
list.connector.connection.pools.success=\u30B3\u30DE\u30F3\u30C9list-connector-connection-pools\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
list.connector.connection.pools.fail=\u30B3\u30DE\u30F3\u30C9list-connector-connection-pools\u306B\u5931\u6557\u3057\u307E\u3057\u305F
list.connector.connection.pools.empty=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
create.admin.object=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u306E\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u8FFD\u52A0\u3057\u307E\u3059
create.admin.object.restype=\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u3001ra.xml\u30D5\u30A1\u30A4\u30EB\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u3092\u7BA1\u7406\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
create.admin.object.raname=\u3053\u308C\u304C\u3001\u3053\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u540D\u524D\u3067\u3059\u3002
create.admin.object.description=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306B\u3064\u3044\u3066\u306E\u8A73\u7D30\u3092\u8AAC\u660E\u3059\u308B\u30C6\u30AD\u30B9\u30C8\u3067\u3059\u3002
create.admin.object.jndi_name=\u4F5C\u6210\u3059\u308B\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306EJNDI\u540D\u3002
create.admin.object.enabled=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u6709\u52B9\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306Ftrue\u3067\u3059\u3002
create.admin.object.success=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8{0}\u304C\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
create.admin.object.duplicate={0}\u3068\u3044\u3046\u540D\u524D\u306E\u30EA\u30BD\u30FC\u30B9\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.admin.object.fail=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8{0}\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
create.admin.object.noJndiName=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306EJNDI\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.admin.object.raNotFound=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3: \u69CB\u6210\u8981\u7D20connector-module {0}\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
create.admin.object.noResTypes=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{0}\u306EConnectorRuntime\u3067\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9\u540D(resTypes)\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
admin.mbeans.rmb.null_ao_intf=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{0}\u306B\u306F\u3001admin-object\u7528\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u5225\u306Eres-adapter\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
admin.mbeans.rmb.ao_intf_impl_check_failed=\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7[ {1} ]\u304A\u3088\u3073classname [ {2} ]\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF[ {0} ]\u306E\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u60C5\u5831\u3092\u7279\u5B9A\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F
admin.mbeans.rmb.multiple_admin_objects.found.for.restype=\u8907\u6570\u306Eadmin-object\u304C\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7[ {0} ]\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u305F\u3081\u3001admin-object\u306Eclassname\u30D1\u30E9\u30E1\u30FC\u30BF(--classname)\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059
admin.mbeans.rmb.invalid_res_type=\u7121\u52B9\u306A\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7: {0}
delete.admin.object=\u6307\u5B9A\u3055\u308C\u305FJNDI\u540D\u306E\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u9664\u53BB\u3057\u307E\u3059
delete.admin.object.jndi_name=\u524A\u9664\u3059\u308B\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306EJNDI\u540D\u3002
delete.admin.object.success=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8{0}\u304C\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002
delete.admin.object.fail=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
delete.admin.object.noJndiName=\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306EJNDI\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
delete.admin.object.notfound={0}\u3068\u3044\u3046\u540D\u524D\u306E\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.admin.object.resource-ref.exist=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u30011\u3064\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
delete.admin.object.multiple.resource-refs=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u3001\u8907\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9/\u30AF\u30E9\u30B9\u30BF\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u9069\u5207\u306A\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066delete-resource-ref\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
delete.admin.object.no.resource-ref=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9[ {0} ]\u306F\u3001\u30BF\u30FC\u30B2\u30C3\u30C8[ {1} ]\u5185\u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u305B\u3093
list.admin.objects=\u3059\u3079\u3066\u306E\u7BA1\u7406\u5BFE\u8C61\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30EA\u30B9\u30C8
list.admin.objects.success=\u30B3\u30DE\u30F3\u30C9list-connector-resources\u306F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
list.admin.objects.fail=\u30B3\u30DE\u30F3\u30C9list-connector-resources\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
create.resource.adapter.config=\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306Edomain.xml\u306B\u69CB\u6210\u60C5\u5831\u3092\u4F5C\u6210\u3057\u307E\u3059
create.resource.adapter.config.threadpoolid=\u4F5C\u696D\u30DE\u30CD\u30FC\u30B8\u30E3\u304C\u30B9\u30EC\u30C3\u30C9\u3092\u53D6\u5F97\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306EID\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u306F\u30011\u3064\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EBID\u306E\u307F\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
create.resource.adapter.config.raname=\u3053\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u306F\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u3001domain.xml\u30D5\u30A1\u30A4\u30EB\u306Eresource-adapter-name\u306E\u5024\u3067\u3059\u3002
create.resource.adapter.config.property=\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BFJavaBean\u306E\u69CB\u6210\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u3001\u30B3\u30ED\u30F3(:)\u3067\u533A\u5207\u3089\u308C\u305F\u540D\u524D\u3068\u5024\u306E\u30DA\u30A2\u3068\u3057\u3066\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
create.resource.adapter.confignoRAName=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u306BRA\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.resource.adapter.config.duplicate=RAR {0}\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.resource.adapter.config.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210{0}\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002{1}
delete.resource.adapter.config=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3092\u524A\u9664\u3057\u307E\u3059
delete.resource.adapter.config.raname=\u3053\u306E\u30AA\u30DA\u30E9\u30F3\u30C9\u3067\u306F\u3001\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u5024\u306F\u3001domain.xml\u30D5\u30A1\u30A4\u30EB\u306Eresource-adapter-name\u306B\u4FDD\u6301\u3055\u308C\u307E\u3059\u3002
delete.resource.adapter.config.noRARName=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u306BRAR\u540D\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
delete.resource.adapter.config.notfound={0}\u306EResource-Adapter-Config\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.resource.adapter.config.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093
list.resource.adapter.configs=\u4F5C\u6210\u3055\u308C\u305Fresource-adapter-configs\u306E\u540D\u524D\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059
list.resource.adapter.configs.raname=\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u306F\u3001\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
list.resource.adapter.configs.verbose=\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u306F\u3001\u69CB\u6210\u3055\u308C\u305F\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u30EA\u30B9\u30C8\u3067\u304D\u307E\u3059\u3002
list.resource.adapter.configs.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3092\u30EA\u30B9\u30C8\u3067\u304D\u307E\u305B\u3093\u3002
create.connector.work.security.map=\u6307\u5B9A\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u4F5C\u696D\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u4F5C\u6210\u3057\u307E\u3059
create.connector.work.security.map.usagetext=create-connector-work-security-map\n\t--raname=raname\n\t--principalsmap (eisprincipal=mappedprincipal)[,eisprincipal=mappedprincipal]* |\n\t--groupsmap (eisgroup=mappedgroup)[,eisgroup=mappedgroup]*\n\t[--description <description>] [-?|--help[=<help(default:false)>]]\n\tmapname
create.connector.work.security.raname=EIS\u30C9\u30E1\u30A4\u30F3\u306E\u8B58\u5225\u5B50\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30C9\u30E1\u30A4\u30F3\u306B\u30DE\u30C3\u30D7\u3059\u308B\u3088\u3046\u306B\u30EA\u30AF\u30A8\u30B9\u30C8\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u3002
create.connector.work.security.principalsmap=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u8907\u6570\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002--principalsmap\u307E\u305F\u306F--groupsmap\u306E\u4E21\u65B9\u3067\u306F\u306A\u304F\u3069\u3061\u3089\u304B\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.work.security.groupsmap=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u8907\u6570\u306E\u30B0\u30EB\u30FC\u30D7\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
create.connector.work.security.mapname=\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u306F\u3001EIS\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
create.connector.work.security.map.noRaName=\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306B\u5BFE\u3057\u3066\u540D\u524D\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
create.connector.work.security.map.noMap=\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306B\u5BFE\u3057\u3066principalsmap\u307E\u305F\u306Fgroupsmap\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.connector.work.security.map.specifyPrincipalsOrGroupsMap=work-security-map\u306B\u306F\u3001(\u4EFB\u610F\u306E\u6570\u306E)\u30B0\u30EB\u30FC\u30D7\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0\u307E\u305F\u306F(\u4EFB\u610F\u306E\u6570\u306E)\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u4E21\u65B9\u3067\u306F\u306A\u304F\u3069\u3061\u3089\u304B\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002--principalsmap\u307E\u305F\u306F--groupsmap\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.work.security.map.duplicate=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306B\u5BFE\u3059\u308B{0}\u3068\u3044\u3046\u540D\u524D\u306E\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
create.connector.work.security.map.fail=\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
delete.connector.work.security.map=\u6307\u5B9A\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u524A\u9664\u3057\u307E\u3059
delete.connector.work.security.map.raname=\u524A\u9664\u3059\u308B\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u540D\u524D
delete.connector.work.security.map.mapname=\u524A\u9664\u3059\u308B\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u540D\u524D
delete.connector.work.security.map.notFound=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306B\u5BFE\u3059\u308B{0}\u3068\u3044\u3046\u540D\u524D\u306E\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.connector.work.security.map.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306E\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
list.connector.work.security.maps=\u6307\u5B9A\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u3059\u3079\u3066\u306E\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
list.connector.work.security.maps.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306E\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u30EA\u30B9\u30C8\u3067\u304D\u307E\u305B\u3093\u3002
list.connector.work.security.maps.eisPrincipalAndMappedPrincipal={0}: EIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB={1}\u3001\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB={2}
list.connector.work.security.maps.eisGroupAndMappedGroup= {0}: EIS\u30B0\u30EB\u30FC\u30D7={1}\u3001\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u30B0\u30EB\u30FC\u30D7={2}
list.connector.work.security.maps.workSecurityMapNotFound=\u30EA\u30B9\u30C8\u3059\u308B\u3082\u306E\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{0}\u304C\u5B58\u5728\u3057\u306A\u3044\u304B\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{0}\u304C\u3069\u306E\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306B\u3082\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002 
create.connector.security.map=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u4F5C\u6210\u3057\u307E\u3059
create.connector.security.map.poolname=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u304C\u5C5E\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3059
create.connector.security.map.principals=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u8907\u6570\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002--principals\u307E\u305F\u306F--usergroups\u306E\u4E21\u65B9\u3067\u306F\u306A\u304F\u3069\u3061\u3089\u304B\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.usergroups=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u8907\u6570\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
create.connector.security.map.mappedusername=\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u306F\u3001EIS\u30E6\u30FC\u30B6\u30FC\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
create.connector.security.map.mapname=\u4F5C\u6210\u307E\u305F\u306F\u66F4\u65B0\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u540D\u524D\u3002
create.connector.security.map.noSecurityMapName=\u30DE\u30C3\u30D7\u540D\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
create.connector.security.map.duplicate=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u5BFE\u3059\u308B{0}\u3068\u3044\u3046\u540D\u524D\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u30DE\u30C3\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.principal_exists=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u306F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB{0}\u304C\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.usergroup_exists=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u306F\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7{0}\u304C\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.noPrincipalsOrGroupsMap=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u4F5C\u6210\u6642\u306B\u306F\u3001\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304B\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u3069\u3061\u3089\u304B\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u4E21\u65B9\u3092null\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
create.connector.security.map.specifyPrincipalsOrGroupsMap=work-security-map\u306B\u306F\u3001(\u4EFB\u610F\u306E\u6570\u306E)\u30B0\u30EB\u30FC\u30D7\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0\u307E\u305F\u306F(\u4EFB\u610F\u306E\u6570\u306E)\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u4E21\u65B9\u3067\u306F\u306A\u304F\u3069\u3061\u3089\u304B\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002--principals\u307E\u305F\u306F--usergroups\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.noSuchPoolFound=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30D7\u30FC\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
create.connector.security.map.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
create.connector.security.map.usagetext=create-connector-security-map\n\t--poolname connector_connection_pool_name\n\t--principals principal-name[,principal-name]* |\n\t--usergroups user-group[,user-group]* --mappedusername user-name\n\t[-?|--help[=<help(default:false)>]] mapname
delete.connector.security.map=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u524A\u9664\u3057\u307E\u3059
delete.connector.security.map.poolname=\u524A\u9664\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u304C\u5C5E\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3059
delete.connector.security.map.mapname=\u524A\u9664\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u540D\u524D
delete.connector.security.map.notFound=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u5BFE\u3059\u308B{0}\u3068\u3044\u3046\u540D\u524D\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
delete.connector.security.map.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
list.connector.security.maps=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u5C5E\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059
list.connector.security.maps.empty=\u30EA\u30B9\u30C8\u3059\u308B\u9805\u76EE\u304C\u3042\u308A\u307E\u305B\u3093\u3002
list.connector.security.securitymap=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u3068\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3092\u8868\u793A\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u5185\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3057\u305F\u3002
list.connector.security.pool-name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u30EA\u30B9\u30C8\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D
list.connector.security.maps.securityMapNotFound=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u5BFE\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30DE\u30C3\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
list.connector.security.maps.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u30EA\u30B9\u30C8\u3067\u304D\u307E\u305B\u3093
list.connector.security.maps.principals=\t\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
list.connector.security.maps.groups=\t\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7
list.connector.security.maps.backendPrincipal=\t\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30FB\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
list.connector.security.maps.username=\t\t\u30E6\u30FC\u30B6\u30FC\u540D = {0}
list.connector.security.maps.password=\t\t\u30D1\u30B9\u30EF\u30FC\u30C9 = {0}
update.connector.security.map=\u6307\u5B9A\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u4F5C\u6210\u307E\u305F\u306F\u5909\u66F4\u3057\u307E\u3059
update.connector.security.map.usagetext=\u30B3\u30CD\u30AF\u30BF\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u66F4\u65B0\n\t--poolname connector_connection_pool_name\n\t[--addprincipals principal-name[,principal-name]*]\n\t[--addusergroups user-group[,user-group]*]\n\t[--removeprincipals principal-name[,principal-name]*]\n\t[--removeusergroups user-group[,user-group]*]\n\t[--mappedusername user-name] [-?|--help[=<help(default:false)>]] mapname
update.connector.security.map.poolname=\u66F4\u65B0\u307E\u305F\u306F\u4F5C\u6210\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u304C\u5C5E\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
update.connector.security.map.addprincipals=\u8FFD\u52A0\u3059\u308BEIS\u56FA\u6709\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002--addprincipals\u307E\u305F\u306F--addusergroups\u306E\u4E21\u65B9\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u540C\u6642\u306B\u4F7F\u7528\u305B\u305A\u306B\u3001\u3069\u3061\u3089\u304B\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.security.map.addusergroups=\u8FFD\u52A0\u3059\u308BEIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002--addprincipals\u307E\u305F\u306F--addusergroups\u306E\u4E21\u65B9\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u540C\u6642\u306B\u4F7F\u7528\u305B\u305A\u306B\u3001\u3069\u3061\u3089\u304B\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.security.map.removeprincipals=\u9664\u53BB\u3059\u308BEIS\u56FA\u6709\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
update.connector.security.map.removeusergroups=\u9664\u53BB\u3059\u308BEIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u30B3\u30ED\u30F3\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
update.connector.security.map.mappedusername=EIS\u30E6\u30FC\u30B6\u30FC\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059
update.connector.security.map.mapname=\u4F5C\u6210\u307E\u305F\u306F\u66F4\u65B0\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u540D\u524D
update.connector.security.map.map_does_not_exist=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u5BFE\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30DE\u30C3\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.security.map.same_principal_values=\u3053\u306E\u5024{0}\u306F--addprincipals\u3068--removeprincipals\u306E\u4E21\u65B9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u540C\u3058\u5024\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
update.connector.security.map.same_usergroup_values=\u3053\u306E\u5024{0}\u306F--addusergroups\u3068--removeusergroups\u306E\u4E21\u65B9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u540C\u3058\u5024\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
update.connector.security.map.principal_does_not_exists=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u306F\u3001\u524A\u9664\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB{0}\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.security.map.usergroup_does_not_exists=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306B\u306F\u3001\u524A\u9664\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7{0}\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.security.map.principals_usergroups_will_be_null=\u30B3\u30DE\u30F3\u30C9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5024\u3067\u306F\u3001\u3059\u3079\u3066\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u3059\u3079\u3066\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u3092\u524A\u9664\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u5C11\u306A\u304F\u3068\u30821\u3064\u306F\u5B58\u5728\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
update.connector.security.map.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB{1}\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u66F4\u65B0\u3067\u304D\u307E\u305B\u3093\u3002
update.connector.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3078\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u8FFD\u52A0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
update.connector.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3078\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
update.connector.work.security.map.noargs=\u30B3\u30CD\u30AF\u30BF\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u66F4\u65B0\u306F\u3001add(principals/usergroups)\u307E\u305F\u306Fremove(principals/usergroups)\u306E\u3069\u3061\u3089\u304B\u5C11\u306A\u304F\u3068\u30821\u3064\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u5F15\u6570\u3092\u6307\u5B9A\u3057\u3066\u5B9F\u884C\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059
update.connector.work.security.map.noSuchRAFound=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.mapNotExist=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306B\u5BFE\u3059\u308B\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30DE\u30C3\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.samePrincipalValues=\u3053\u306E\u5024{0}\u306F--addprincipals\u3068--removeprincipals\u306E\u4E21\u65B9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u540C\u3058\u5024\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
update.connector.work.security.map.sameUsergroupValues=\u3053\u306E\u5024{0}\u306F--addusergroups\u3068--removeusergroups\u306E\u4E21\u65B9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u540C\u3058\u5024\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
update.connector.work.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3078\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u8FFD\u52A0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
update.connector.work.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3078\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
update.connector.work.security.map.principals_usergroups_will_be_null=\u30B3\u30DE\u30F3\u30C9\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5024\u3067\u306F\u3001\u3059\u3079\u3066\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u3059\u3079\u3066\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u3092\u524A\u9664\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u5C11\u306A\u304F\u3068\u30821\u3064\u306F\u5B58\u5728\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
update.connector.work.security.map.principalNotExists=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{1}\u306B\u306F\u3001\u524A\u9664\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB{0}\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.usergroupNotExists=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{1}\u306B\u306F\u3001\u524A\u9664\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7{0}\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u6709\u52B9\u306A\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.principalExists=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{1}\u306B\u306F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB{0}\u304C\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.groupExists=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{1}\u306B\u306F\u30B0\u30EB\u30FC\u30D7{0}\u304C\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u30B0\u30EB\u30FC\u30D7\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
update.connector.work.security.map.fail=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF{1}\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7{0}\u3092\u66F4\u65B0\u3067\u304D\u307E\u305B\u3093\u3002
flush.connection.pool.fail={0}\u306E\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D5\u30E9\u30C3\u30B7\u30E5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
flush.connection.pool.notexist=\u30EA\u30BD\u30FC\u30B9\u30FB\u30D7\u30FC\u30EB{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
flush.connection.pool.pooling.disabled=\u30D7\u30FC\u30EB\u306E\u30D7\u30FC\u30EA\u30F3\u30B0\u304C\u7121\u52B9\u306A\u305F\u3081\u3001\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D5\u30E9\u30C3\u30B7\u30E5\u306B\u5931\u6557\u3057\u307E\u3057\u305F: {0}
ping.connection.pool=\u6307\u5B9A\u3055\u308C\u305Fjdbc-connection-pool\u307E\u305F\u306Fconnector-connection-pool\u63A5\u7D9A\u30D7\u30FC\u30EB\u3078\u306E\u63A5\u7D9A\u6027\u3092\u30C6\u30B9\u30C8\u3057\u307E\u3059\u3002
ping.connection.pool.pool_name=ping\u3055\u308C\u308B\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u540D\u524D\u3002
ping.connection.pool.success={0}\u306E\u63A5\u7D9A\u30D7\u30FC\u30EB\u306Eping\u306B\u6210\u529F\u3057\u307E\u3057\u305F\u3002
ping.connection.pool.fail={0}\u306E\u63A5\u7D9A\u30D7\u30FC\u30EB\u306Eping\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
ping.connection.pool.connPoolNotFound=\u63A5\u7D9A\u30D7\u30FC\u30EB{0}\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
ping.create.connector.connection.pool.fail=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u4F5C\u6210\u4E2D\u306Eping\u306E\u8A66\u884C: {0} - \u5931\u6557\u3002
ping.create.connector.connection.pool.success=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u4F5C\u6210\u4E2D\u306Eping\u306E\u8A66\u884C: {0} - \u6210\u529F\u3002
pool.util.app.is.not.enabled=\u30D7\u30FC\u30EB[{1} ]\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3[ {0} ]\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u307E\u305B\u3093\u3002
pool.util.app.does.not.exist=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3[ {0} ]\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
pool.util.module.does.not.exist=\u30E2\u30B8\u30E5\u30FC\u30EB[ {0} ]\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3[ {1} ]\u306B\u5B58\u5728\u3057\u307E\u305B\u3093
pool.util.pool.does.not-exist=\u30D7\u30FC\u30EB[ {0} ]\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
pool.util.app.name.needed=--modulename\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F--appname\u304C\u5FC5\u8981\u3067\u3059\u3002
create.pmf.resource.not.supported=\u6C38\u7D9A\u6027\u30DE\u30CD\u30FC\u30B8\u30E3\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u304F\u306A\u308A\u307E\u3057\u305F\u3002\u304B\u308F\u308A\u306B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306Epersistence-manager-factory-resource [ {1} ]\u306B\u3088\u3063\u3066\u53C2\u7167\u3055\u308C\u308Bjdbc-resource [ {0} ]\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
