#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

noApplications=No se ha encontrado ninguna aplicaci\u00F3n.
nothingToList=No hay nada que mostrar.
create.connector.resource=Crea un recurso de conector con el nombre de JNDI especificado
create.connector.resource.poolname=Nombre del pool de conexiones de conector. Si dos o m\u00E1s elementos de recurso del conector apuntan al mismo elemento del pool de conexiones, utilizan la misma conexi\u00F3n de pool en tiempo de ejecuci\u00F3n.
create.connector.resource.objecttype=
create.connector.resource.description=Texto que proporciona detalles descriptivos acerca del recurso de conector.
create.connector.resource.jndi_name=Nombre de JNDI de este recurso de conector.
create.connector.resource.enabled=Determina si el recurso de conector est\u00E1 activado en tiempo de ejecuci\u00F3n. El valor por defecto es true.
create.connector.resource.success=Se ha creado el recurso de conector {0}.
create.connector.resource.duplicate=Ya existe un recurso denominado {0}.
create.connector.resource.fail=No se ha podido crear el recurso de conector {0}.
create.connector.resource.noJndiName=No hay ning\u00FAn nombre de JNDI definido para el recurso de conector.
create.connector.resource.connPoolNotFound=No se ha encontrado el valor de atributo (pool-name = {0}) en la lista de los pool de conexiones de conector.
delete.connector.resource=Elimina un recurso de conector con el nombre de JNDI especificado
delete.connector.resource.jndi_name=Se ha eliminado el nombre de JNDI de este recurso de conector.
delete.connector.resource.success=Se ha suprimido el recurso de conector {0}.
delete.connector.resource.fail=No se ha podido suprimir el recurso de conector {0}.
delete.connector.resource.noJndiName=No hay ning\u00FAn nombre de JNDI definido para el recurso de conector.
delete.connector.resource.notfound=No existe un recurso de conector denominado {0}.
delete.connector.resource.resource-ref.exist=Se hace referencia al recurso de conector [{0}] en un destino de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.connector.resource.multiple.resource-refs=Se hace referencia al recurso de conector [{0}] en varios destinos de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.connector.resource.no.resource-ref=No se hace referencia al recurso de conector [{0}] en el destino [{1}]
delete.connector.resource.notAllowed=El recurso {0} no se puede suprimir porque es necesario que est\u00E9 configurarlo en el sistema.
list.connector.resources=Mostrar Todos los Recursos de Conector
list.connector.resources.success=El comando list-connector-resources se ha ejecutado correctamente.
list.connector.resources.fail=Fallo del comando list-connector-resources.
list.connector.resources.empty=No hay nada que mostrar.
create.connector.connection.pool=Agrega un pool de conexiones con el nombre del pool de conexiones especificado
create.connector.connection.pool.raname=Nombre del adaptador de recursos.
create.connector.connection.pool.connectiondefinition=Nombre de la definici\u00F3n de conexi\u00F3n.
create.connector.connection.pool.steadypoolsize=N\u00FAmero m\u00EDnimo e inicial de conexiones mantenidas en el pool. El valor por defecto es 8.
create.connector.connection.pool.maxpoolsize=N\u00FAmero m\u00E1ximo de conexiones que se pueden crear para cumplir una solicitud de cliente. El valor por defecto es 32.
create.connector.connection.pool.maxwait=Tiempo, en milisegundos, que un emisor de llamada debe esperar antes de que se cree una conexi\u00F3n, si no hay una disponible. Si se define en 0, el emisor de llamada se bloquea indefinidamente hasta que haya un recurso disponible o hasta que se produzca un error. El valor por defecto es 60000.
create.connector.connection.pool.poolresize=Cantidad en la que el pool aumentar\u00E1 o reducir\u00E1 la escala del n\u00FAmero de conexiones. Aumentar la escala: cuando el pool no tiene conexiones libres, el pool aumentar\u00E1 la escala en esta cantidad. Reducir la escala: todas las conexiones inactivas o no v\u00E1lidas se eliminan, provocando a veces la eliminaci\u00F3n de una cantidad de conexiones mayor que este valor. Se garantizar\u00E1 un tama\u00F1o estable del pool. Los valores posibles son desde 0 a 32. El valor por defecto es 2.
create.connector.connection.pool.ping=En un pool con este atributo definido en true se realiza un ping durante la creaci\u00F3n o nueva configuraci\u00F3n para identificar y notificar los valores err\u00F3neos de sus atributos. El valor por defecto de este atributo es false.
create.connector.connection.pool.pooling=Cuando se define como false, este atributo desactiva el pool de conexiones. El valor por defecto de este atributo es true.
create.connector.connection.pool.idletimeout=Tiempo m\u00E1ximo, en segundos, que una conexi\u00F3n puede permanecer inactiva en el pool. Despu\u00E9s de este tiempo, el pool puede cerrar esta conexi\u00F3n. El valor por defecto es 300.
create.connector.connection.pool.isconnectvalidatereq=Si el valor se define en true, se comprobar\u00E1n las conexiones para ver si se pueden usar, antes de enviarlas a la aplicaci\u00F3n. El valor por defecto es false.
create.connector.connection.pool.failconnection=Si se define en true, se cierran todas las conexiones del pool si falla una \u00FAnica comprobaci\u00F3n de validaci\u00F3n. Este par\u00E1metro es obligatorio si is-connection-validation-required se define en true. Los valores v\u00E1lidos son on, off, yes, no, 1, 0, true o false. El valor por defecto es false.
create.connector.connection.pool.transactionsupport= Indica el nivel de soporte de transacci\u00F3n que tendr\u00E1 este pool. Los valores posibles son 'XATransaction', 'LocalTransaction' y 'NoTransaction'. Este atributo puede tener un valor menor o igual que el atributo de soporte de transacci\u00F3n del adaptador de recursos, pero no mayor. El atributo de soporte de transacci\u00F3n del adaptador de recursos tiene un orden de valores, donde 'XATransaction' es el mayor y 'NoTransaction' el menor.
create.connector.connection.pool.description=Texto que ofrece detalles acerca del pool de conexiones de conector.
create.connector.connection.pool.property=Pares de nombre/valor del atributo opcional para configurar el pool de conexiones de conector.
create.connector.connection.pool.connector_connection_pool_name=Nombre del pool de conexiones de conector que se va a crear.
create.connector.connection.pool.success=Se ha creado el pool de conexiones de conector {0}.
create.connector.connection.pool.fail=Fallo al crear el pool de conexiones de conector {0}.
create.connector.connection.pool.noJndiName=No hay ning\u00FAn nombre de pool definido para el pool de conexiones de conector.
create.connector.connection.pool.duplicate=Ya existe un recurso denominado {0}.
admin.mbeans.rmb.invalid_ra_connectdef_not_found=Definici\u00F3n de conexi\u00F3n no v\u00E1lida. No se ha encontrado el m\u00F3dulo de conector con la definici\u00F3n de conexi\u00F3n {0}.
admin.mbeans.rmb.null_res_adapter=El nombre del adaptador de recursos es nulo
admin.mbeans.rmb.invalid_ra_app_not_found=Nombre no v\u00E1lido. No se ha encontrado la aplicaci\u00F3n con el nombre {0}.
admin.mbeans.rmb.invalid_ra_cm_not_found=Nombre no v\u00E1lido. No se ha encontrado el m\u00F3dulo de conector con el nombre {0}.
delete.connector.connection.pool=Elimina el pool de conexiones de conector especificado
delete.connector.connection.pool.cascade=Cuando se define en true, suprime todos los recursos de conector asociados al pool, excepto el pool en s\u00ED. Cuando se define en false, la supresi\u00F3n del pool falla si hay alg\u00FAn recurso asociado al pool. Los recursos se deben suprimen expl\u00EDcitamente o bien la opci\u00F3n se debe definir en true. La configuraci\u00F3n por defecto es false.
delete.connector.connection.pool.connector_connection_pool_name=Nombre del pool de conexiones de conector que se va a eliminar.
delete.connector.connection.pool.success=Se ha suprimido el pool de conexiones de conector {0}.
delete.connector.connection.pool.fail=No se ha podido suprimir el pool de conexiones de conector {0}.
delete.connector.connection.pool.notfound=El pool de conexiones de conector denominado {0} no existe.
delete.connector.connection.pool.noJndiName=No hay ning\u00FAn identificador definido para el pool de conexiones de conector.
delete.connector.connection.pool.pool_in_use=Algunos recursos de conector hacen referencia al pool de conexiones {0}. Utilice la opci\u00F3n ''cascade'' para suprimirlos tambi\u00E9n.
list.connector.connection.pools=Muestra todos los pools de conexiones de conector
list.connector.connection.pools.success=El comando list-connector-connection-pools se ha ejecutado correctamente.
list.connector.connection.pools.fail=Fallo del comando list-connector-connection-pools
list.connector.connection.pools.empty=No hay nada que mostrar.
create.admin.object=Agrega el objeto administrado con el nombre de JNDI especificado
create.admin.object.restype=Esta opci\u00F3n se utiliza para administrar los tipos de recursos de objeto, seg\u00FAn lo definido por el adaptador de recursos en el archivo ra.xml.
create.admin.object.raname=\u00C9ste es el nombre del adaptador de recursos asociado a este objeto.
create.admin.object.description=Texto que proporciona detalles descriptivos acerca del recurso de conector.
create.admin.object.jndi_name=Nombre de JNDI del objeto administrado que se va a crear.
create.admin.object.enabled=Especifica si el objeto est\u00E1 activado. El valor por defecto es true.
create.admin.object.success=Se ha creado el objeto administrado {0}.
create.admin.object.duplicate=Ya existe un recurso con el nombre {0}.
create.admin.object.fail=No se ha podido crear el objeto administrado {0}.
create.admin.object.noJndiName=No hay ning\u00FAn nombre de JNDI definido para el objeto administrado.
create.admin.object.raNotFound=Aplicaciones: no se ha encontrado el elemento de configuraci\u00F3n connector-module {0}.
create.admin.object.noResTypes=No se han encontrado los nombres de interfaz del objeto de administraci\u00F3n (resTypes) en ConnectorRuntime para el adaptador de recursos {0}.
admin.mbeans.rmb.null_ao_intf=El adaptador de recursos {0} no contiene ning\u00FAn tipo de recurso para admin-object. Especifique otro valor de res-adapter.
admin.mbeans.rmb.ao_intf_impl_check_failed=No se ha podido determinar la informaci\u00F3n de recurso de objeto de administraci\u00F3n del adaptador de recursos [{0}] para el tipo de recurso [{1}] y nombre de clase [{2}]
admin.mbeans.rmb.multiple_admin_objects.found.for.restype=Es necesario especificar el par\u00E1metro de nombre de clase de admin-object (--classname), ya que varios admin-objects utilizan este tipo de recurso [{0}] 
admin.mbeans.rmb.invalid_res_type=Tipo de recurso no v\u00E1lido: {0}
delete.admin.object=Elimina el objeto administrado con el nombre de JNDI especificado
delete.admin.object.jndi_name=Nombre de JNDI del objeto administrado que se va a suprimir.
delete.admin.object.success=Se ha suprimido el objeto administrado {0}.
delete.admin.object.fail=No se ha podido suprimir el objeto administrado {0}.
delete.admin.object.noJndiName=No hay ning\u00FAn nombre de JNDI definido para el objeto administrado.
delete.admin.object.notfound=No existe un objeto administrado denominado {0}.
delete.admin.object.resource-ref.exist=Se hace referencia al recurso de objeto de administraci\u00F3n [{0}] en un destino de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.admin.object.multiple.resource-refs=Se hace referencia al recurso de objeto de administraci\u00F3n [{0}] en varios destinos de instancia/cluster. Utilice el comando delete-resource-ref en el destino adecuado.
delete.admin.object.no.resource-ref=No se hace referencia al recurso de objeto de administraci\u00F3n [{0}] en el destino [{1}]
list.admin.objects=Muestra todos los objetos administrados
list.admin.objects.success=El comando list-connector-resources se ha ejecutado correctamente.
list.admin.objects.fail=Fallo del comando list-connector-resources.
create.resource.adapter.config=Crea la informaci\u00F3n de configuraci\u00F3n en domain.xml para el m\u00F3dulo de conector
create.resource.adapter.config.threadpoolid=ID del pool de threads del que el gestor de trabajos obtiene el thread. Esta opci\u00F3n toma s\u00F3lo un ID de pool de threads.
create.resource.adapter.config.raname=Este operando indica el nombre del m\u00F3dulo de conector. Es el valor de resource-adapter-name en el archivo domain.xml.
create.resource.adapter.config.property=Esta opci\u00F3n especifica las propiedades de configuraci\u00F3n de Java Bean del adaptador de recursos. Las propiedades se pueden especificar como pares de nombre/valor separados por dos puntos (:).
create.resource.adapter.confignoRAName=No se ha definido ning\u00FAn nombre de RA para la configuraci\u00F3n del adaptador de recursos.
create.resource.adapter.config.duplicate=Ya existe la configuraci\u00F3n del adaptador de recursos para RAR {0}.
create.resource.adapter.config.fail=No se ha podido crear la configuraci\u00F3n del adaptador de recursos {0}. {1}
delete.resource.adapter.config=Suprime la configuraci\u00F3n del adaptador de recursos
delete.resource.adapter.config.raname=Este operando ayuda a especificar el nombre del m\u00F3dulo de conector. Este valor se mantiene en resource-adapter-name en el archivo domain.xml.
delete.resource.adapter.config.noRARName=No se ha definido ning\u00FAn nombre de RAR para la configuraci\u00F3n del adaptador de recursos.
delete.resource.adapter.config.notfound=Resource-Adapter-Config para {0} no existe.
delete.resource.adapter.config.fail=No se ha podido suprimir la configuraci\u00F3n del adaptador de recursos {0}
list.resource.adapter.configs=Muestra los nombres de resource-adapter-configs creados
list.resource.adapter.configs.raname=Esta opci\u00F3n especifica el nombre del m\u00F3dulo de conector.
list.resource.adapter.configs.verbose=Esta opci\u00F3n ayuda a mostrar las propiedades que hay configuradas.
list.resource.adapter.configs.fail=No se han podido mostrar las configuraciones del adaptador de recursos.
create.connector.work.security.map=Crea una asignaci\u00F3n de seguridad de contexto de trabajo para el adaptador de recursos especificado
create.connector.work.security.map.usagetext=create-connector-work-security-map\n\t--raname=raname\n\t--principalsmap (eisprincipal=mappedprincipal)[,eisprincipal=mappedprincipal]* |\n\t--groupsmap (eisgroup=mappedgroup)[,eisgroup=mappedgroup]*\n\t[--description <description>] [-?|--help[=<help(default:false)>]]\n\tmapname
create.connector.work.security.raname=Adaptador de recursos que solicita la asignaci\u00F3n de identidades del dominio de EIS al dominio del servidor de aplicaciones.
create.connector.work.security.principalsmap=Especifica una lista de principales de EIS de backend. Se puede especificar m\u00E1s de un principal mediante una lista separada por dos puntos. Utilice la opci\u00F3n --principalsmap o --groupsmap, pero no ambas.
create.connector.work.security.groupsmap=Especifica una lista de grupos de usuarios de EIS de backend. Se puede especificar m\u00E1s de un grupo mediante una lista separada por dos puntos.
create.connector.work.security.mapname=Esta propiedad especifica la asignaci\u00F3n de seguridad de trabajo de EIS.
create.connector.work.security.map.noRaName=No se ha encontrado ning\u00FAn nombre para la asignaci\u00F3n de seguridad de trabajo del conector.
create.connector.work.security.map.noMap=No hay ning\u00FAn valor principalsmap o groupsmap definido para la asignaci\u00F3n de seguridad de trabajo del conector.
create.connector.work.security.map.specifyPrincipalsOrGroupsMap=work-security-map puede tener (cualquier n\u00FAmero de) asignaciones de grupo o (cualquier n\u00FAmero de) asignaciones de principales, pero no ambas. Especifique --principalsmap o --groupsmap.
create.connector.work.security.map.duplicate=Ya existe una asignaci\u00F3n de seguridad de trabajo del conector denominada {0} para el adaptador de recursos {1}.
create.connector.work.security.map.fail=No se ha podido crear la asignaci\u00F3n de seguridad de trabajo del conector {0}.
delete.connector.work.security.map=Suprime la asignaci\u00F3n de seguridad de trabajo para el adaptador de recursos especificado
delete.connector.work.security.map.raname=nombre del adaptador de recursos para la asignaci\u00F3n de seguridad de trabajo que se va a suprimir
delete.connector.work.security.map.mapname=nombre de la asignaci\u00F3n de seguridad de trabajo que se va a suprimir
delete.connector.work.security.map.notFound=No existe una asignaci\u00F3n de seguridad de trabajo del conector denominada {0} para el adaptador de recursos {1}.
delete.connector.work.security.map.fail=No se ha podido suprimir la asignaci\u00F3n de seguridad de trabajo del conector {0} para el adaptador de recursos {1}.
list.connector.work.security.maps=Muestra todas las asignaciones de seguridad de trabajo del conector para el adaptador de recursos especificado.
list.connector.work.security.maps.fail=No se ha podido mostrar la asignaci\u00F3n de seguridad de trabajo del conector {0} para el adaptador de recursos {1}.
list.connector.work.security.maps.eisPrincipalAndMappedPrincipal={0}: principal de EIS={1}, principal asignado={2}
list.connector.work.security.maps.eisGroupAndMappedGroup= {0}: grupo de EIS={1}, grupo asignado={2}
list.connector.work.security.maps.workSecurityMapNotFound=No hay nada que mostrar. El adaptador de recursos {0} no existe o bien el adaptador de recursos {0} no est\u00E1 asociado a ninguna asignaci\u00F3n de seguridad de trabajo. 
create.connector.security.map=Crea una asignaci\u00F3n de seguridad para el pool de conexiones de conector especificado
create.connector.security.map.poolname=Especifica el nombre del pool de conexiones de conector al que pertenece la asignaci\u00F3n de seguridad
create.connector.security.map.principals=Especifica una lista de principales de EIS de backend. Se puede especificar m\u00E1s de un principal mediante una lista separada por :. Utilice la opci\u00F3n --principals o --usergroups, pero no ambas.
create.connector.security.map.usergroups=Especifica una lista de grupos de usuarios de EIS de backend. Se puede especificar m\u00E1s de un grupo de usuarios mediante una lista separada por :.
create.connector.security.map.mappedusername=Esta propiedad especifica el nombre de usuario de EIS.
create.connector.security.map.mapname=Nombre de la asignaci\u00F3n de seguridad que se va a crear o actualizar.
create.connector.security.map.noSecurityMapName=No se ha especificado ning\u00FAn valor de mapname.
create.connector.security.map.duplicate=Ya existe una asignaci\u00F3n de seguridad denominada {0} para el pool de conexiones de conector {1}. Proporcione otro nombre de asignaci\u00F3n.
create.connector.security.map.principal_exists=Ya existe el principal {0} en el pool de conexiones de conector {1}. Proporcione otro nombre de principal.
create.connector.security.map.usergroup_exists=Ya existe user-group {0} en el pool de conexiones de conector {1}. Proporcione otro nombre de user-group.
create.connector.security.map.noPrincipalsOrGroupsMap=Se tiene que especificar el principal o el grupo de usuarios al crear una asignaci\u00F3n de seguridad. Ambos no pueden ser nulos.
create.connector.security.map.specifyPrincipalsOrGroupsMap=work-security-map puede tener (cualquier n\u00FAmero de) asignaciones de grupo o (cualquier n\u00FAmero de) asignaciones de principales, pero no ambas. Especifique --principals o --usergroups.
create.connector.security.map.noSuchPoolFound=El pool de conexiones de conector {0} especificado no existe. Especifique un nombre de pool v\u00E1lido.
create.connector.security.map.fail=No se ha podido crear la asignaci\u00F3n de seguridad del conector {0} para el pool de conexiones de conector {1}
create.connector.security.map.usagetext=create-connector-security-map\n\t--poolname connector_connection_pool_name\n\t--principals principal-name[,principal-name]* |\n\t--usergroups user-group[,user-group]* --mappedusername user-name\n\t[-?|--help[=<help(default:false)>]] mapname
delete.connector.security.map=Suprime una asignaci\u00F3n de seguridad para el pool de conexiones de conector especificado
delete.connector.security.map.poolname=Especifica el nombre del pool de conexiones de conector al que pertenece la asignaci\u00F3n de seguridad que se va a suprimir
delete.connector.security.map.mapname=Nombre de la asignaci\u00F3n de seguridad que se va a suprimir
delete.connector.security.map.notFound=No existe una asignaci\u00F3n de seguridad denominada {0} para el pool de conexiones de conector {1}.
delete.connector.security.map.fail=No se ha podido suprimir la asignaci\u00F3n de seguridad {0} para el pool de conexiones de conector {1}.
list.connector.security.maps=Muestra las asignaciones de seguridad que pertenecen al pool de conexiones de conector especificado
list.connector.security.maps.empty=No hay nada que mostrar.
list.connector.security.securitymap=Se ha especificado el nombre de la asignaci\u00F3n de seguridad incluida en el pool de conexiones de conector desde el que se deben mostrar la identidad y los principales.
list.connector.security.pool-name=Nombre del pool de conexiones de conector para el que desea mostrar las asignaciones de seguridad
list.connector.security.maps.securityMapNotFound=La asignaci\u00F3n de seguridad {0} no existe para el pool de conexiones de conector {1}. Proporcione un nombre de asignaci\u00F3n v\u00E1lido.
list.connector.security.maps.fail=No se ha podido mostrar la asignaci\u00F3n de seguridad {0} para el pool de conexiones de conector {1}
list.connector.security.maps.principals=\tPrincipales
list.connector.security.maps.groups=\tGrupos de Usuarios
list.connector.security.maps.backendPrincipal=\tPrincipal de Backend
list.connector.security.maps.username=\t\tUsuario = {0}
list.connector.security.maps.password=\t\tContrase\u00F1a = {0}
update.connector.security.map=Crea o modifica una asignaci\u00F3n de seguridad para el pool de conexiones de conector especificado
update.connector.security.map.usagetext=Actualizar asignaci\u00F3n de seguridad de conector\\n\\t--poolname connector_connection_pool_name\\n\\t[--addprincipals principal-name[,principal-name]*]\\n\\t[--addusergroups user-group[,user-group]*]\\n\\t[--removeprincipals principal-name[,principal-name]*]\\n\\t[--removeusergroups user-group[,user-group]*]\\n\\t[--mappedusername user-name] [-?|--help[=<help(default:false)>]] mapname
update.connector.security.map.poolname=Especifica el nombre del pool de conexiones de conector al que pertenece la asignaci\u00F3n de seguridad que se va a actualizar o crear.
update.connector.security.map.addprincipals=Especifica una lista separada por dos puntos de principales espec\u00EDficos de EIS que se van a agregar. Utilice la opci\u00F3n --addprincipals o --addusergroups, pero no ambas al mismo tiempo.
update.connector.security.map.addusergroups=Especifica una lista separada por dos puntos de grupos de usuarios de EIS que se van a agregar. Utilice la opci\u00F3n --addprincipals o --addusergroups, pero no ambas al mismo tiempo.
update.connector.security.map.removeprincipals=Especifica una lista separada por dos puntos de principales espec\u00EDficos de EIS que se van a eliminar.
update.connector.security.map.removeusergroups=Especifica una lista separada por dos puntos de grupos de usuarios de EIS que se van a eliminar.
update.connector.security.map.mappedusername=Especifica el nombre de usuario de EIS
update.connector.security.map.mapname=nombre de la asignaci\u00F3n de seguridad que se va a crear o actualizar
update.connector.security.map.map_does_not_exist=La asignaci\u00F3n de seguridad {0} no existe para el pool de conexiones de conector {1}. Proporcione un nombre de asignaci\u00F3n v\u00E1lido.
update.connector.security.map.same_principal_values=Este valor {0} se ha proporcionado en --addprincipals y --removeprincipals. No se puede proporcionar el mismo valor para estas opciones.
update.connector.security.map.same_usergroup_values=Este valor {0} se ha proporcionado en --addusergroups y --removeusergroups. No se puede proporcionar el mismo valor para estas opciones.
update.connector.security.map.principal_does_not_exists=El principal {0} que desea suprimir no existe en el pool de conexiones de conector {1}. Proporcione un nombre de principal v\u00E1lido.
update.connector.security.map.usergroup_does_not_exists=El grupo de usuarios {0} que desea suprimir no existe en el pool de conexiones de conector {1}. Proporcione un nombre de grupo de usuarios v\u00E1lido.
update.connector.security.map.principals_usergroups_will_be_null=Los valores del comando suprimir\u00E1n todos los principales y grupos de usuarios. No puede suprimir todos los principales y grupos de usuarios. Debe existir al menos uno de ellos.
update.connector.security.map.fail=No se ha podido actualizar la asignaci\u00F3n de seguridad {0} para el pool de conexiones de conector {1}.
update.connector.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Fallo al agregar principales a una asignaci\u00F3n de seguridad con grupos de usuarios.
update.connector.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Fallo al agregar grupos de usuarios a una asignaci\u00F3n de seguridad con principales.
update.connector.work.security.map.noargs=Se debe ejecutar la asignaci\u00F3n de seguridad de trabajo del conector de actualizaci\u00F3n con al menos un argumento opcional add(principals/usergroups) o remove(principals/usergroups)
update.connector.work.security.map.noSuchRAFound=El adaptador de recursos {0} no existe. Especifique un nombre de adaptador de recursos.
update.connector.work.security.map.mapNotExist=La asignaci\u00F3n de seguridad de trabajo {0} no existe para el adaptador de recursos {1}. Proporcione un nombre de asignaci\u00F3n v\u00E1lido.
update.connector.work.security.map.samePrincipalValues=Este valor {0} se ha proporcionado en --addprincipals y --removeprincipals. No se puede proporcionar el mismo valor para estas opciones.
update.connector.work.security.map.sameUsergroupValues=Este valor {0} se ha proporcionado en --addusergroups y --removeusergroups. No se puede proporcionar el mismo valor para estas opciones.
update.connector.work.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Fallo al agregar principales a una asignaci\u00F3n de seguridad con grupos de usuarios.
update.connector.work.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Fallo al agregar grupos de usuarios a una asignaci\u00F3n de seguridad con principales.
update.connector.work.security.map.principals_usergroups_will_be_null=Los valores del comando suprimir\u00E1n todos los principales y grupos de usuarios. No puede suprimir todos los principales y grupos de usuarios. Debe existir al menos uno de ellos.
update.connector.work.security.map.principalNotExists=El principal {0} que desea suprimir no existe en la asignaci\u00F3n de seguridad {1}. Proporcione un nombre de principal v\u00E1lido.
update.connector.work.security.map.usergroupNotExists=El grupo de usuarios {0} que desea suprimir no existe en la asignaci\u00F3n de seguridad {1}. Proporcione un nombre de grupo de usuarios v\u00E1lido.
update.connector.work.security.map.principalExists=Ya existe el principal {0} en la asignaci\u00F3n de seguridad {1}. Proporcione otro nombre de principal.
update.connector.work.security.map.groupExists=Ya existe el grupo {0} en la asignaci\u00F3n de seguridad {1}. Proporcione otro nombre de grupo.
update.connector.work.security.map.fail=No se ha podido actualizar la asignaci\u00F3n de seguridad {0} para el adaptador de recursos {1}.
flush.connection.pool.fail=Fallo al vaciar el pool de conexiones para {0}.
flush.connection.pool.notexist=El pool de recursos {0} no existe.
flush.connection.pool.pooling.disabled=Fallo al intentar vaciar el pool de conexiones porque est\u00E1 desactivado para el pool: {0}
ping.connection.pool=Prueba la conectividad a un pool de conexiones determinado, que puede ser jdbc-connection-pool o connector-connection-pool.
ping.connection.pool.pool_name=Nombre del pool de conexiones al que se va a hacer ping.
ping.connection.pool.success=Se ha hecho ping al pool de conexiones para {0} correctamente.
ping.connection.pool.fail=Fallo al hacer ping al pool de conexiones para {0}.
ping.connection.pool.connPoolNotFound=No se ha encontrado el pool de conexiones {0}.
ping.create.connector.connection.pool.fail=Se ha intentado hacer ping durante la creaci\u00F3n del pool de conexiones de conector: {0} - Fallo.
ping.create.connector.connection.pool.success=Se ha intentado hacer ping durante la creaci\u00F3n del pool de conexiones de conector: {0} - Correcto.
pool.util.app.is.not.enabled=La aplicaci\u00F3n [{0}] en la que est\u00E1 definido el pool [{1}] no est\u00E1 activada.
pool.util.app.does.not.exist=La aplicaci\u00F3n [{0}] no existe.
pool.util.module.does.not.exist=El m\u00F3dulo [{0}] no existe en la aplicaci\u00F3n [{1}]
pool.util.pool.does.not-exist=El pool [{0}] no existe.
pool.util.app.name.needed=--appname es necesario cuando se especifica --modulename
create.pmf.resource.not.supported=El recurso de f\u00E1brica del gestor de persistencia ya no est\u00E1 soportado. En su lugar, utilice jdbc-resource [{0}] al que hace referencia persistence-manager-factory-resource [{1}] en las aplicaciones.
