#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

noApplications=Nenhuma aplica\u00E7\u00E3o encontrada.
nothingToList=Nada a listar.
create.connector.resource=Cria um recurso de conector com o nome de JNDI especificado
create.connector.resource.poolname=Nome do pool de conex\u00F5es do conector. Quando dois ou mais elementos do recurso JDBC apontam para o mesmo elemento do pool de conex\u00F5es, eles utilizam o mesmo pool de conex\u00F5es durante o runtime.
create.connector.resource.objecttype=
create.connector.resource.description=Texto fornecendo detalhes descritivos sobre o recurso do conector.
create.connector.resource.jndi_name=Nome de JNDI deste recurso do conector.
create.connector.resource.enabled=Determina se o recurso do conector \u00E9 ativado em runtime. O valor default \u00E9 verdadeiro.
create.connector.resource.success=Recurso do conector {0} criado.
create.connector.resource.duplicate=Um recurso nomeado como {0} j\u00E1 existe.
create.connector.resource.fail=N\u00E3o foi poss\u00EDvel criar o recurso do conector {0}.
create.connector.resource.noJndiName=Nenhum nome de JNDI definido para o recurso do conector.
create.connector.resource.connPoolNotFound=Valor de atributo (pool-name = {0}) n\u00E3o encontrado na lista de pools de conex\u00F5es do conector.
delete.connector.resource=Remove um recurso do conector com o nome de JNDI especificado
delete.connector.resource.jndi_name=O nome JNDI desse recurso do conector a ser removido.
delete.connector.resource.success=Recurso do conector {0} deletado.
delete.connector.resource.fail=N\u00E3o foi poss\u00EDvel deletar o recurso do conector {0}.
delete.connector.resource.noJndiName=Nenhum nome de JNDI definido para o recurso do conector.
delete.connector.resource.notfound=Um recurso do conector nomeado como {0} n\u00E3o existe.
delete.connector.resource.resource-ref.exist=\u00C9 feita refer\u00EAncia ao recurso do conector [ {0} ] em um destino de inst\u00E2ncia/cluster. Utilize delete-resource-ref no destino apropriado.
delete.connector.resource.multiple.resource-refs=\u00C9 feita refer\u00EAncia ao recurso do conector [ {0} ] em v\u00E1rios destinos de inst\u00E2ncia/cluster. Utilize delete-resource-ref no destino apropriado.
delete.connector.resource.no.resource-ref=N\u00E3o \u00E9 feita refer\u00EAncia ao recurso de conector [ {0} ] no destino [ {1} ]
delete.connector.resource.notAllowed=O recurso {0} n\u00E3o pode ser deletado porque sua configura\u00E7\u00E3o \u00E9 necess\u00E1ria no sistema.
list.connector.resources=Lista todos os recursos do conector
list.connector.resources.success=Comando list-connector-resources executado com sucesso.
list.connector.resources.fail=Falha ao executar comando list-connector-resources.
list.connector.resources.empty=Nada a listar.
create.connector.connection.pool=Adiciona um pool de conex\u00F5es com o nome de pool de conex\u00F5es especificado
create.connector.connection.pool.raname=O nome do adaptador do recurso.
create.connector.connection.pool.connectiondefinition=O nome da defini\u00E7\u00E3o da conex\u00E3o.
create.connector.connection.pool.steadypoolsize=N\u00FAmero m\u00EDnimo e inicial de conex\u00F5es mantidas no pool. O valor default \u00E9 8.
create.connector.connection.pool.maxpoolsize=O n\u00FAmero m\u00E1ximo de conex\u00F5es que podem ser criadas para atender \u00E0 solicita\u00E7\u00E3o do cliente. O valor default \u00E9 32.
create.connector.connection.pool.maxwait=O tempo, em milissegundos, que um chamador deve aguardar antes que uma conex\u00E3o seja criada, se n\u00E3o houver conex\u00E3o dispon\u00EDvel.  Se estiver definido em 0, o chamador \u00E9 bloqueado indefinidamente ate que um recurso esteja dispon\u00EDvel ou ocorrer um erro.  O valor default \u00E9 60000.
create.connector.connection.pool.poolresize=Quantidade pela qual o pool expandir\u00E1 ou reduzir\u00E1 o n\u00FAmero de conex\u00F5es. Expandir: quando o pool n\u00E3o possui conex\u00F5es livres, ele se expande nesta quantidade. Reduzir: Todas as conex\u00F5es inv\u00E1lidas e ociosas s\u00E3o removidas, resultando, \u00E0s vezes, na remo\u00E7\u00E3o de quantidade de conex\u00F5es maior do que este valor. Steadypoolsize ser\u00E1 protegido. Valores poss\u00EDveis v\u00E3o de 0 a 32. O valor default \u00E9 2.
create.connector.connection.pool.ping=Um pool com este atributo definido como verdadeiro recebe o ping durante sua cria\u00E7\u00E3o ou reconfigura\u00E7\u00E3o, para identificar e advertir sobre valores err\u00F4neos em atributos. O valor default deste atributo \u00E9 falso.
create.connector.connection.pool.pooling=Quando definido como falso, esse atributo desativa o pool de conex\u00F5es. O valor default deste atributo \u00E9 verdadeiro.
create.connector.connection.pool.idletimeout=Tempo m\u00E1ximo, em segundos, que uma conex\u00E3o pode permanecer ociosa no pool. Ap\u00F3s esse tempo, o pool pode fechar a conex\u00E3o. O valor default \u00E9 300.
create.connector.connection.pool.isconnectvalidatereq=Se o valor for definido como verdadeiro, as conex\u00F5es ser\u00E3o verificadas para confirmar se podem ser utilizadas antes serem distribu\u00EDdas para a aplica\u00E7\u00E3o. O valor default \u00E9 falso.
create.connector.connection.pool.failconnection=Se definido como verdadeiro, todas as conex\u00F5es no pool s\u00E3o encerradas se ocorrer falha em uma \u00FAnica verifica\u00E7\u00E3o de valida\u00E7\u00E3o. Esse par\u00E2metro \u00E9 obrigat\u00F3rio se is-connection-validation-required estiver definido como verdadeiro. Os valores legais s\u00E3o ativado, desativado, sim, n\u00E3o, 1, 0, verdadeiro ou falso. O valor default \u00E9 falso.
create.connector.connection.pool.transactionsupport= Indica o n\u00EDvel de suporte na transa\u00E7\u00E3o que esse pool receber\u00E1. Os valores poss\u00EDveis s\u00E3o 'XATransaction', 'LocalTransaction' e 'NoTransaction'. Esse atributo pode ter um valor inferior ou igual, mas n\u00E3o superior, ao atributo de suporte da transa\u00E7\u00E3o do adaptador do recurso. O atributo de suporte de transa\u00E7\u00E3o do adaptador tem uma ordem de valores, em que XATransaction \u00E9 superior e NoTransaction \u00E9 inferior.
create.connector.connection.pool.description=Texto fornecendo detalhes sobre o pool de conex\u00F5es do conector.
create.connector.connection.pool.property=Pares opcionais de nome/valor de atributo para configurar o pool de conex\u00F5es do conector.
create.connector.connection.pool.connector_connection_pool_name=Nome do pool de conex\u00F5es do conector a ser criado.
create.connector.connection.pool.success=Pool de conex\u00F5es do conector {0} criado.
create.connector.connection.pool.fail=Falha ao criar o pool {0} de conex\u00F5es do conector.
create.connector.connection.pool.noJndiName=Nenhum nome de pool definido para o pool de conex\u00F5es do conector.
create.connector.connection.pool.duplicate=Um recurso nomeado como {0} j\u00E1 existe.
admin.mbeans.rmb.invalid_ra_connectdef_not_found=Defini\u00E7\u00E3o de conex\u00E3o inv\u00E1lida. M\u00F3dulo Conector com a defini\u00E7\u00E3o de conex\u00E3o {0} n\u00E3o encontrado.
admin.mbeans.rmb.null_res_adapter=O Nome do Adaptador de Recursos \u00E9 nulo
admin.mbeans.rmb.invalid_ra_app_not_found=Nome inv\u00E1lido. A aplica\u00E7\u00E3o com o nome {0} n\u00E3o foi encontrada.
admin.mbeans.rmb.invalid_ra_cm_not_found=Nome inv\u00E1lido. O M\u00F3dulo Conector com o nome {0} foi n\u00E3o encontrado.
delete.connector.connection.pool=Remove o pool de conex\u00F5es do conector especificado
delete.connector.connection.pool.cascade=Quando definida como verdadeira, todos os recursos do conector associados ao pool, exceto o pr\u00F3prio pool, ser\u00E3o deletados. Quando definida como falsa, a dele\u00E7\u00E3o do pool falhar\u00E1, se qualquer recurso estiver associado ao pool. O recurso deve ser deletado explicitamente ou a op\u00E7\u00E3o deve ser definida como verdadeira. A defini\u00E7\u00E3o default \u00E9 falsa.
delete.connector.connection.pool.connector_connection_pool_name=Nome do pool de conex\u00F5es do conector a ser removido.
delete.connector.connection.pool.success=Pool de conex\u00F5es do conector {0} deletado.
delete.connector.connection.pool.fail=N\u00E3o foi poss\u00EDvel deletar o pool de conex\u00F5es do conector {0}.
delete.connector.connection.pool.notfound=N\u00E3o existe um pool de conex\u00F5es do conector com o nome {0}.
delete.connector.connection.pool.noJndiName=Nenhuma id definida para o pool de conex\u00F5es do conector.
delete.connector.connection.pool.pool_in_use=Alguns recursos do conector est\u00E3o referenciando o pool de conex\u00F5es {0}. Use tamb\u00E9m a op\u00E7\u00E3o ''em cascata'' para delet\u00E1-los.
list.connector.connection.pools=Lista todos os pools de conex\u00F5es do conector
list.connector.connection.pools.success=Comando list-connector-connection-pools executado com sucesso.
list.connector.connection.pools.fail=Falha ao executar comando list-connector-connection-pools.
list.connector.connection.pools.empty=Nada a listar.
create.admin.object=Adiciona o objeto administrado com o nome de JNDI especificado
create.admin.object.restype=Essa op\u00E7\u00E3o \u00E9 utilizada para administrar os tipos de recurso do objeto, conforme definido pelo adaptador de recursos no arquivo ra.xml.
create.admin.object.raname=Esse \u00E9 o nome do adaptador de recursos associado ao objeto.
create.admin.object.description=Texto fornecendo detalhes descritivos sobre o recurso do conector.
create.admin.object.jndi_name=O nome de JNDI do objeto administrado a ser criado.
create.admin.object.enabled=Especifica se o objeto est\u00E1 ativado. O valor default \u00E9 verdadeiro.
create.admin.object.success=Objeto administrado {0} criado.
create.admin.object.duplicate=Um recurso nomeado como {0} j\u00E1 existe.
create.admin.object.fail=N\u00E3o foi poss\u00EDvel criar o objeto administrado {0}.
create.admin.object.noJndiName=Nenhum nome de JNDI definido para o objeto administrado.
create.admin.object.raNotFound=Aplica\u00E7\u00F5es: O elemento de configura\u00E7\u00E3o connector-module {0} n\u00E3o foi encontrado.
create.admin.object.noResTypes=N\u00E3o foi poss\u00EDvel localizar os nomes de interface de objeto admin (resTypes) do ConnectorRuntime para o adaptador do recurso {0}.
admin.mbeans.rmb.null_ao_intf=O Adaptador do Recurso {0} n\u00E3o cont\u00E9m qualquer tipo de recurso para admin-object. Especifique outro adaptador.
admin.mbeans.rmb.ao_intf_impl_check_failed=N\u00E3o foi poss\u00EDvel determinar as informa\u00E7\u00F5es do recurso de objeto administrativo do Adaptador de Recurso [ {0} ] para o Tipo de Recurso [ {1} ] e o classname [ {2} ]
admin.mbeans.rmb.multiple_admin_objects.found.for.restype=Voc\u00EA precisa especificar o par\u00E2metro de classname para admin-object (--classname) como admin-objects m\u00FAltiplos que usam esse tipo de recurso [ {0} ] 
admin.mbeans.rmb.invalid_res_type=Tipo de Recurso Inv\u00E1lido: {0}
delete.admin.object=Remove o objeto administrado com o nome de JNDI especificado
delete.admin.object.jndi_name=O nome de JNDI do objeto administrado a ser deletado.
delete.admin.object.success=Objeto administrado {0} deletado.
delete.admin.object.fail=N\u00E3o foi poss\u00EDvel deletar o objeto administrado {0}.
delete.admin.object.noJndiName=Nenhum nome de JNDI definido para o objeto administrado.
delete.admin.object.notfound=Um objeto administrado nomeado como {0} n\u00E3o existe.
delete.admin.object.resource-ref.exist=\u00C9 feita refer\u00EAncia ao recurso do objeto administrativo [ {0} ] em um destino de inst\u00E2ncia/cluster. Utilize delete-resource-ref no destino apropriado.
delete.admin.object.multiple.resource-refs=\u00C9 feita refer\u00EAncia ao recurso de objeto administrativo [ {0} ] em v\u00E1rios destinos de inst\u00E2ncia/cluster. Utilize delete-resource-ref no destino apropriado.
delete.admin.object.no.resource-ref=N\u00E3o \u00E9 feita refer\u00EAncia ao recurso de objeto administrativo [ {0} ] referenciado no destino [ {1} ]
list.admin.objects=Lista todos os objetos administrados
list.admin.objects.success=Comando list-connector-resources executado com sucesso.
list.admin.objects.fail=Falha ao executar comando list-connector-resources.
create.resource.adapter.config=Cria as informa\u00E7\u00F5es de configura\u00E7\u00E3o no dom\u00EDnio .xml para o m\u00F3dulo do conector
create.resource.adapter.config.threadpoolid=O ID do pool de thread do qual o gerenciador do trabalho obt\u00E9m o thread. Essa op\u00E7\u00E3o considera somente um ID de pool de thread.
create.resource.adapter.config.raname=Esse operando indica o nome do m\u00F3dulo do conector. \u00C9 o valor do resource-adapter-name no arquivo .xml do dom\u00EDnio.
create.resource.adapter.config.property=Essa op\u00E7\u00E3o especifica as propriedades de configura\u00E7\u00E3o do bean java do adaptador do recurso. As propriedades podem ser especificadas como pares de valor de nome separados por dois-pontos (:).
create.resource.adapter.confignoRAName=Nenhum Nome RA definido para a configura\u00E7\u00E3o do adaptador do recurso.
create.resource.adapter.config.duplicate=J\u00E1 existe uma configura\u00E7\u00E3o do adaptador de recurso para o RAR {0}.
create.resource.adapter.config.fail=N\u00E3o foi poss\u00EDvel criar a configura\u00E7\u00E3o do adaptador do recurso {0}. {1}
delete.resource.adapter.config=Deleta a configura\u00E7\u00E3o do adaptador do recurso
delete.resource.adapter.config.raname=Esse operando ajuda a especificar o nome do m\u00F3dulo do conector. Esse valor \u00E9 mantido no resource-adapter-name no arquivo .xml do dom\u00EDnio.
delete.resource.adapter.config.noRARName=Nenhum nome RAR definido para a configura\u00E7\u00E3o do adaptador do recurso.
delete.resource.adapter.config.notfound=Resource-Adapter-Config para {0} n\u00E3o existe.
delete.resource.adapter.config.fail=N\u00E3o foi poss\u00EDvel deletar a configura\u00E7\u00E3o do adaptador do recurso {0}
list.resource.adapter.configs=Lista os nomes das resource\u2014adapter\u2014configs criadas
list.resource.adapter.configs.raname=Esta op\u00E7\u00E3o especifica o nome do m\u00F3dulo do conector.
list.resource.adapter.configs.verbose=Esta op\u00E7\u00E3o ajuda a listar as propriedades que s\u00E3o configuradas.
list.resource.adapter.configs.fail=N\u00E3o foi poss\u00EDvel listar as configura\u00E7\u00F5es do adaptador do recurso.
create.connector.work.security.map=Cria um mapa de seguran\u00E7a do contexto de trabalho para o adaptador de recurso especificado
create.connector.work.security.map.usagetext=create-connector-work-security-map\n\t--raname=raname\n\t--principalsmap (eisprincipal=mappedprincipal)[,eisprincipal=mappedprincipal]* |\n\t--groupsmap (eisgroup=mappedgroup)[,eisgroup=mappedgroup]*\n\t[--description <description>] [-?|--help[=<help(default:false)>]]\n\tmapname
create.connector.work.security.raname=Adaptador do recurso solicitando mapeamento de identidades do dom\u00EDnio EIS para o dom\u00EDnio do servidor da aplica\u00E7\u00E3o.
create.connector.work.security.principalsmap=Especifica uma lista de principais EIS de backend. Mais de um principal pode ser especificado usando uma lista separada por dois-pontos. Use as op\u00E7\u00F5es --principalsmap ou --groupsmap, mas n\u00E3o ambas.
create.connector.work.security.groupsmap=Especifica uma lista de grupos de usu\u00E1rios EIS de backend. Mais de um grupo pode ser especificado usando uma lista separada por dois-pontos.
create.connector.work.security.mapname=Esta propriedade especifica o mapa do grupo de seguran\u00E7a de trabalho EIS.
create.connector.work.security.map.noRaName=Nome n\u00E3o definido para o mapa de seguran\u00E7a de trabalho do conector.
create.connector.work.security.map.noMap=Nenhum principalsmap ou groupsmap definido para o mapa de seguran\u00E7a de trabalho do conector.
create.connector.work.security.map.specifyPrincipalsOrGroupsMap=Um mapa de seguran\u00E7a de trabalho pode ter (qualquer n\u00FAmero de) mapeamento de grupo ou (qualquer n\u00FAmero de) mapeamento de principais, mas n\u00E3o ambos. Especifique --principalsmap ou --groupsmap.
create.connector.work.security.map.duplicate=J\u00E1 existe um mapa de seguran\u00E7a de trabalho do conector nomeado como {0} para o adaptador do recurso {1}.
create.connector.work.security.map.fail=N\u00E3o foi poss\u00EDvel criar o mapa de seguran\u00E7a de trabalho do conector {0}.
delete.connector.work.security.map=Deleta o mapa de seguran\u00E7a de trabalho para o adaptador de recurso especificado
delete.connector.work.security.map.raname=nome do adaptador de recurso para o mapa de seguran\u00E7a de trabalho a ser deletado
delete.connector.work.security.map.mapname=nome do mapa de seguran\u00E7a de trabalho a ser deletado
delete.connector.work.security.map.notFound=N\u00E3o existe mapa de seguran\u00E7a de trabalho do conector nomeado como {0} para o adaptador do recurso {1}.
delete.connector.work.security.map.fail=N\u00E3o foi poss\u00EDvel deletar o mapa de seguran\u00E7a de trabalho do conector {0} para o adaptador de recurso {1}.
list.connector.work.security.maps=Lista todos os mapas de seguran\u00E7a de trabalho do conector para o adaptador de recurso especificado.
list.connector.work.security.maps.fail=N\u00E3o foi poss\u00EDvel listar o mapa de seguran\u00E7a de trabalho do conector {0} para o adaptador de recurso {1}.
list.connector.work.security.maps.eisPrincipalAndMappedPrincipal={0}: principal EIS={1}, principal mapeado={2}
list.connector.work.security.maps.eisGroupAndMappedGroup= {0}: grupo EIS={1}, grupo mapeado={2}
list.connector.work.security.maps.workSecurityMapNotFound=Nada a listar. O adaptador de recurso {0} n\u00E3o existe ou o adaptador de recurso {0} n\u00E3o est\u00E1 associado a qualquer mapa de seguran\u00E7a de trabalho. 
create.connector.security.map=Cria um mapa de seguran\u00E7a para o pool de conex\u00F5es do conector especificado
create.connector.security.map.poolname=Especifica o nome do pool de conex\u00F5es do conector ao qual pertence o mapa de seguran\u00E7a.
create.connector.security.map.principals=Especifica uma lista de principais EIS de backend. Mais de um principal pode ser especificado usando uma lista separada por dois-pontos. Use as op\u00E7\u00F5es --principals ou --usergroups, mas n\u00E3o ambas.
create.connector.security.map.usergroups=Especifica uma lista de grupos de usu\u00E1rios EIS de backend. Mais de um grupo de usu\u00E1rios pode ser especificado usando uma lista separada por dois-pontos.
create.connector.security.map.mappedusername=Esta propriedade especifica o nome de usu\u00E1rio do EIS.
create.connector.security.map.mapname=O nome do mapa de seguran\u00E7a a ser criado ou atualizado.
create.connector.security.map.noSecurityMapName=Nenhum nome de mapa especificado.
create.connector.security.map.duplicate=J\u00E1 existe um mapa de seguran\u00E7a nomeado como {0} para o pool de conex\u00F5es do conector {1}. Especifique outro nome de mapa.
create.connector.security.map.principal_exists=J\u00E1 existe o principal {0} no pool de conex\u00F5es do conector {1}. Especifique outro nome de principal.
create.connector.security.map.usergroup_exists=J\u00E1 existe o grupo de usu\u00E1rio {0} no pool de conex\u00F5es do conector {1}. Especifique outro nome de grupo de usu\u00E1rios.
create.connector.security.map.noPrincipalsOrGroupsMap=Informe o principal ou o grupo de usu\u00E1rio a ser especificado ao criar um mapa de seguran\u00E7a. N\u00E3o \u00E9 poss\u00EDvel que ambos sejam nulos.
create.connector.security.map.specifyPrincipalsOrGroupsMap=Um mapa de seguran\u00E7a de trabalho pode ter (qualquer n\u00FAmero de) mapeamento de grupo ou (qualquer n\u00FAmero de) mapeamento de principais, mas n\u00E3o ambos. Especifique --principals ou --usergroups.
create.connector.security.map.noSuchPoolFound=N\u00E3o existe o pool de conex\u00F5es do conector {0} especificado. Especifique um nome de pool v\u00E1lido.
create.connector.security.map.fail=N\u00E3o foi poss\u00EDvel criar um mapa de seguran\u00E7a do conector {0} para o pool de conex\u00F5es do conector {1}
create.connector.security.map.usagetext=create-connector-security-map\n\t--poolname connector_connection_pool_name\n\t--principals principal-name[,principal-name]* |\n\t--usergroups user-group[,user-group]* --mappedusername user-name\n\t[-?|--help[=<help(default:false)>]] mapname
delete.connector.security.map=Deleta um mapa de seguran\u00E7a para o pool de conex\u00F5es do conector especificado
delete.connector.security.map.poolname=Especifica o nome do pool de conex\u00F5es do conector ao qual pertence o mapa de seguran\u00E7a que ser\u00E1 deletado.
delete.connector.security.map.mapname=O nome do mapa de seguran\u00E7a a ser deletado
delete.connector.security.map.notFound=Um mapa de seguran\u00E7a nomeado como {0} para o pool de conex\u00F5es do conector {1} n\u00E3o existe.
delete.connector.security.map.fail=N\u00E3o foi poss\u00EDvel deletar um mapa de seguran\u00E7a {0} para o pool de conex\u00F5es do conector {1}.
list.connector.security.maps=Lista os mapas de seguran\u00E7a que pertencem ao pool de conex\u00F5es do conector especificado
list.connector.security.maps.empty=Nada a listar.
list.connector.security.securitymap=Especificou o nome do mapa de seguran\u00E7a contido dentro do pool de conex\u00F5es do conector do qual a identidade e os principais devem ser listados.
list.connector.security.pool-name=Nome do pool de conex\u00F5es do conector para o qual deseja listar os mapas de seguran\u00E7a
list.connector.security.maps.securityMapNotFound=O mapa de seguran\u00E7a {0} n\u00E3o existe para o pool de conex\u00F5es do conector {1}. Especifique um nome de mapa v\u00E1lido.
list.connector.security.maps.fail=N\u00E3o foi poss\u00EDvel listar um mapa de seguran\u00E7a {0} para o pool de conex\u00F5es do conector {1}.
list.connector.security.maps.principals=\tPrincipal(is)
list.connector.security.maps.groups=\tGrupo(s) de Usu\u00E1rio
list.connector.security.maps.backendPrincipal=\tPrincipal de Back-end
list.connector.security.maps.username=\t\tNome de Usu\u00E1rio = {0}
list.connector.security.maps.password=\t\tSenha = {0}
update.connector.security.map=Cria ou modifica um mapa de seguran\u00E7a para o pool de conex\u00F5es do conector especificado
update.connector.security.map.usagetext=Atualizar mapa de seguran\u00E7a do conector\n\t--poolname connector_connection_pool_name\n\t[--addprincipals principal-name[,principal-name]*]\n\t[--addusergroups user-group[,user-group]*]\n\t[--removeprincipals principal-name[,principal-name]*]\n\t[--removeusergroups user-group[,user-group]*]\n\t[--mappedusername user-name] [-?|--help[=<help(default:false)>]] mapname
update.connector.security.map.poolname=Especifica o nome do pool de conex\u00F5es do conector ao qual pertence o mapa de seguran\u00E7a que ser\u00E1 atualizado ou criado.
update.connector.security.map.addprincipals=Especifica uma lista separada por dois-pontos de principais espec\u00EDficos de EIS a serem adicionados. Use as op\u00E7\u00F5es --addprincipals ou --addusergroups, mas n\u00E3o ambas ao mesmo tempo.
update.connector.security.map.addusergroups=Especifica uma lista separada por dois-pontos de grupos de usu\u00E1rios de EIS a serem adicionados. Use as op\u00E7\u00F5es --addprincipals ou --addusergroups, mas n\u00E3o ambas ao mesmo tempo.
update.connector.security.map.removeprincipals=Especifica uma lista separada por dois-pontos de principais espec\u00EDficos de EIS a serem removidos.
update.connector.security.map.removeusergroups=Especifica uma lista separada por dois-pontos de grupos de usu\u00E1rios de EIS a serem removidos.
update.connector.security.map.mappedusername=Especifica o nome de usu\u00E1rio do EIS
update.connector.security.map.mapname=nome do mapa de seguran\u00E7a a ser criado ou atualizado.
update.connector.security.map.map_does_not_exist=O mapa de seguran\u00E7a {0} n\u00E3o existe para o pool de conex\u00F5es do conector {1}. Especifique um nome de mapa v\u00E1lido.
update.connector.security.map.same_principal_values=Esse valor {0} \u00E9 oferecido em --addprincipals e --removeprincipals. N\u00E3o \u00E9 poss\u00EDvel fornecer o mesmo valor para essas op\u00E7\u00F5es.
update.connector.security.map.same_usergroup_values=Esse valor {0} \u00E9 oferecido em --addusergroups e --removeusergroups. N\u00E3o \u00E9 poss\u00EDvel fornecer o mesmo valor para essas op\u00E7\u00F5es.
update.connector.security.map.principal_does_not_exists=O principal {0} que voc\u00EA deseja deletar n\u00E3o existe no pool de conex\u00F5es do conector {1}. Especifique um nome de principal v\u00E1lido.
update.connector.security.map.usergroup_does_not_exists=O grupo de usu\u00E1rio {0} que voc\u00EA deseja deletar n\u00E3o existe no pool de conex\u00F5es do conector {1}. Especifique um nome de grupo de usu\u00E1rios v\u00E1lido.
update.connector.security.map.principals_usergroups_will_be_null=Os valores em seu comando deletar\u00E3o todos os principais e grupos de usu\u00E1rios. N\u00E3o \u00E9 poss\u00EDvel deletar todos os principais e grupos de usu\u00E1rios. Pelo menos um deles deve existir.
update.connector.security.map.fail=N\u00E3o foi poss\u00EDvel atualizar um mapa de seguran\u00E7a {0} para o pool de conex\u00F5es do conector {1}.
update.connector.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Falha ao adicionar principais a um mapa de seguran\u00E7a com os grupos de usu\u00E1rio.
update.connector.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Falha ao adicionar grupos de usu\u00E1rio a um mapa de seguran\u00E7a com principais.
update.connector.work.security.map.noargs=O comando para atualizar o mapa de seguran\u00E7a de trabalho do conector deve ser executado com pelo menos um argumento opcional de add(principals/usergroups) ou remove(principals/usergroups)
update.connector.work.security.map.noSuchRAFound=O Adaptador do Recurso {0} n\u00E3o existe. Especifique um nome do adaptador do recurso.
update.connector.work.security.map.mapNotExist=O mapa de Seguran\u00E7a de Trabalho {0} n\u00E3o existe para o adaptador de recurso {1}. Forne\u00E7a um nome de mapa v\u00E1lido.
update.connector.work.security.map.samePrincipalValues=Esse valor {0} \u00E9 oferecido em --addprincipals e --removeprincipals. N\u00E3o \u00E9 poss\u00EDvel fornecer o mesmo valor para essas op\u00E7\u00F5es.
update.connector.work.security.map.sameUsergroupValues=Esse valor {0} \u00E9 oferecido em --addusergroups e --removeusergroups. N\u00E3o \u00E9 poss\u00EDvel fornecer o mesmo valor para essas op\u00E7\u00F5es.
update.connector.work.security.map.addPrincipalToExistingUserGroupsWorkSecurityMap=Falha ao adicionar principais a um mapa de seguran\u00E7a com os grupos de usu\u00E1rio.
update.connector.work.security.map.addUserGroupsToExistingPrincipalsWorkSecurityMap=Falha ao adicionar grupos de usu\u00E1rio a um mapa de seguran\u00E7a com principais.
update.connector.work.security.map.principals_usergroups_will_be_null=Os valores em seu comando deletar\u00E3o todos os principais e grupos de usu\u00E1rios. N\u00E3o \u00E9 poss\u00EDvel deletar todos os principais e grupos de usu\u00E1rios. Pelo menos um deles deve existir.
update.connector.work.security.map.principalNotExists=O principal {0} que voc\u00EA deseja deletar n\u00E3o existe no mapa de seguran\u00E7a {1}. Forne\u00E7a um nome de principal v\u00E1lido.
update.connector.work.security.map.usergroupNotExists=O grupo de usu\u00E1rio {0} que voc\u00EA deseja deletar n\u00E3o existe no mapa de seguran\u00E7a {1}. Forne\u00E7a um nome de grupo de usu\u00E1rio v\u00E1lido.
update.connector.work.security.map.principalExists=J\u00E1 existe o principal {0} no mapa de seguran\u00E7a {1}. Forne\u00E7a um nome de principal diferente.
update.connector.work.security.map.groupExists=J\u00E1 existe o Grupo {0} no mapa de seguran\u00E7a {1}. Forne\u00E7a um nome de grupo diferente.
update.connector.work.security.map.fail=N\u00E3o foi poss\u00EDvel atualizar o mapa de seguran\u00E7a {0} para o adaptador de recurso {1}.
flush.connection.pool.fail=Falha na Descarga do Pool de Conex\u00F5es para {0}.
flush.connection.pool.notexist=O pool do recurso {0} n\u00E3o existe.
flush.connection.pool.pooling.disabled=Falha ao tentar Fazer Flush do Pool de Conex\u00F5es porque o Pooling est\u00E1 desativado para o pool : {0}
ping.connection.pool=Testa a conectividade a um determinado pool de conex\u00F5es, que pode ser jdbc-connection-pool ou connector-connection-pool.
ping.connection.pool.pool_name=Nome do Pool de Conex\u00F5es para o qual ser\u00E1 enviado o ping.
ping.connection.pool.success=Ping do Pool de Conex\u00F5es para {0} Enviado com Sucesso.
ping.connection.pool.fail=Falha ao Fazer Ping no Pool de Conex\u00F5es para {0}.
ping.connection.pool.connPoolNotFound=Pool de conex\u00F5es {0} n\u00E3o encontrado.
ping.create.connector.connection.pool.fail=Falha ao tentar efetuar ping durante a Cria\u00E7\u00E3o do Pool de Conex\u00F5es do Conector: {0}.
ping.create.connector.connection.pool.success=Tentativa bem-sucedida de efetuar ping durante a Cria\u00E7\u00E3o do Pool de Conex\u00F5es do Conector: {0}.
pool.util.app.is.not.enabled=A aplica\u00E7\u00E3o [ {0} ] na qual o pool [{1} ] foi definido, n\u00E3o est\u00E1 ativada.
pool.util.app.does.not.exist=Aplica\u00E7\u00E3o [ {0} ] n\u00E3o existe
pool.util.module.does.not.exist=O m\u00F3dulo [ {0} ] n\u00E3o existe na aplica\u00E7\u00E3o [ {1} ]
pool.util.pool.does.not-exist=O pool [ {0} ] n\u00E3o existe.
pool.util.app.name.needed=--appname \u00E9 necess\u00E1rio quando --modulename \u00E9 especificado
create.pmf.resource.not.supported=N\u00E3o h\u00E1 mais suporte para recursos de f\u00E1brica do gerenciador de persist\u00EAncia. Em vez disso, use o jdbc-resource [ {0} ] referenciado por persistence-manager-factory-resource [ {1} ] nas aplica\u00E7\u00F5es.
