#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#


## 'server' is the name of the server instance. No Not Translate it.
tree.adminServer=\u30B5\u30FC\u30D0\u30FC(\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC)
tree.domain=\u30C9\u30E1\u30A4\u30F3

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmDeleteRealms=\u9078\u629E\u3057\u305F\u30EC\u30EB\u30E0\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteJaccProviders=\u9078\u629E\u3057\u305FJACC\u30D7\u30ED\u30D0\u30A4\u30C0\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteAuditModules=\u9078\u629E\u3057\u305F\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteMsgSecurities=\u9078\u629E\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u69CB\u6210\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteMsgProviders=\u9078\u629E\u3057\u305F\u30D7\u30ED\u30D0\u30A4\u30C0\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteUser=\u9078\u629E\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteLifecycle=\u9078\u629E\u3057\u305F\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteProfiler=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteConfigs=\u9078\u629E\u3057\u305F\u69CB\u6210\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmRotateLog=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306F\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeletePswdAlias=\u9078\u629E\u3057\u305F\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmEmptyPswdForPswdAlias=\u3053\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u7A7A\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmRestartInstanceDisableSecureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u3092\u7121\u52B9\u306B\u3059\u308B\u3068\u3001\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u5373\u6642\u306B\u518D\u8D77\u52D5\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmRestartInstanceEnableSecureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u3092\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u5373\u6642\u306B\u518D\u8D77\u52D5\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.security.adminsWithEmptyPW=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u304C\u30AA\u30F3\u306B\u306A\u3063\u3066\u3044\u308B\u305F\u3081\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u7A7A\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
msg.JS.security.emptyPswdEncryptionAlgorithm=\u30D1\u30B9\u30EF\u30FC\u30C9\u6697\u53F7\u5316\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u6307\u5B9A\u3057\u306A\u3044\u3068\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4E0A\u306E\u30EA\u30B9\u30AF\u304C\u3042\u308A\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.recoverTransactions.enterLogDir=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30ED\u30B0\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u5024\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044

## This is shown in a popup box.
msg.JS.resources.addResources.xmlFileMsg=XML\u30D5\u30A1\u30A4\u30EB\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002

msg.seeServerLog=\u8A73\u7D30\u306Fserver.log\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
msg.command.warning=\u30B3\u30DE\u30F3\u30C9\u304C\u6210\u529F\u3057\u307E\u3057\u305F\u304C\u3001\u8B66\u544A\u304C\u3042\u308A\u307E\u3059
msg.error.noSuchProvider=\u305D\u306E\u3088\u3046\u306A\u30D7\u30ED\u30D0\u30A4\u30C0\u306F\u3042\u308A\u307E\u305B\u3093
msg.error.save.monitor.modules=\u30E2\u30CB\u30BF\u30FC\u30FB\u30EC\u30D9\u30EB\u306E\u66F4\u65B0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\n  \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8="{0}" ; \u30DA\u30A4\u30ED\u30FC\u30C9="{1}"

# Security
#
security.Security=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3
security.SecurityPageHelp=\u30B5\u30FC\u30D0\u30FC\u5168\u4F53\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
security.SecurityManager=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3
security.SecurityManagerHelp=\u300CJVM\u8A2D\u5B9A\u300D\u3067\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0\u3057\u3066\u3001\u30C9\u30E1\u30A4\u30F3\u3067\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30CD\u30FC\u30B8\u30E3\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
security.AuditLogging=\u76E3\u67FB\u30ED\u30AE\u30F3\u30B0
security.AuditLoggingHelp=\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u308B\u3001\u300C\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u300D\u8A2D\u5B9A\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u3059\u3079\u3066\u306E\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30ED\u30FC\u30C9\u3068\u5B9F\u884C\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
security.DefaultRealm=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30EC\u30EB\u30E0
security.DefaultRealmHelp=\u3059\u3079\u3066\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u8A8D\u8A3C\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30EC\u30EB\u30E0
security.DefaultPrincipal=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
security.DefaultPrincipalHelp=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u304C\u63D0\u4F9B\u3055\u308C\u306A\u3044\u5834\u5408\u306B\u30B5\u30FC\u30D0\u30FC\u304C\u4F7F\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D(\u82F1\u6570\u5B57\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30C0\u30C3\u30B7\u30E5\u3001\u307E\u305F\u306F\u30C9\u30C3\u30C8\u6587\u5B57\u306E\u307F\u3067\u69CB\u6210\u3055\u308C\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059)
security.DefaultPrincipalPassword=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
security.DefaultPrincipalPasswordHelp=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306B\u5024\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306B\u5FC5\u9808
security.Jacc=JACC
security.JaccHelp=JACC\u30A4\u30F3\u30D5\u30E9\u30B9\u30C8\u30E9\u30AF\u30C1\u30E3\u306E\u69CB\u6210\u306B\u4F7F\u7528\u3059\u308B<tt>jacc-provider</tt>\u8981\u7D20\u306E\u540D\u524D
security.AuditModules=\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB
security.AuditModulesHelp=\u76E3\u67FB\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u76E3\u67FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30EA\u30B9\u30C8(\u8907\u6570\u3092\u9078\u629E\u3059\u308B\u3068\u304D\u306F\u3001Ctrl\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059)
security.RoleMapping=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30ED\u30FC\u30EB\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
security.RoleMappingHelp=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30ED\u30FC\u30EB\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u56FA\u6709\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u73FE\u5728\u30C7\u30D7\u30ED\u30A4\u4E2D\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u306F\u5F71\u97FF\u3057\u307E\u305B\u3093
security.MappedPrincipalClass=\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u30AF\u30E9\u30B9
security.MappedPrincipalClassHelp=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3068\u30ED\u30FC\u30EB\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306B\u4F7F\u7528\u3055\u308C\u308Bjava.security.Principal\u5B9F\u88C5\u30AF\u30E9\u30B9\u3092\u30AB\u30B9\u30BF\u30DE\u30A4\u30BA\u3057\u307E\u3059
security.AuditModule.auditOn=\u76E3\u67FB\u30AA\u30F3
security.secureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406
security.secureAdmin.newPageTitleHelp=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3059\u308B\u3068\u3001DAS\u304A\u3088\u3073\u3059\u3079\u3066\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u542B\u3080\u30C9\u30E1\u30A4\u30F3\u5168\u4F53\u306B\u5F71\u97FF\u304C\u3042\u308A\u307E\u3059\u3002
security.secureAdmin.adminalias=\u7BA1\u7406\u30A8\u30A4\u30EA\u30A2\u30B9:
security.secureAdmin.adminaliasHelp=DAS\u306ESSL/TLS\u8A3C\u660E\u66F8\u3092\u53C2\u7167\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306F\u3001\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304CDAS\u306B\u5BFE\u3059\u308B\u8A8D\u8A3C\u3092\u884C\u3046\u305F\u3081\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
security.secureAdmin.instancealias=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30A8\u30A4\u30EA\u30A2\u30B9: 
security.secureAdmin.instancealiasHelp=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306ESSL/TLS\u8A3C\u660E\u66F8\u3092\u53C2\u7167\u3059\u308B\u30A8\u30A4\u30EA\u30A2\u30B9\u3002\u3053\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u306F\u3001DAS\u304C\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u5BFE\u3059\u308B\u8A8D\u8A3C\u3092\u884C\u3046\u305F\u3081\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
security.secureLabel=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406:


## Realms
realm.NewPageTitle=\u65B0\u898F\u30EC\u30EB\u30E0
realm.NewPageHelp=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3(\u8A8D\u8A3C)\u30EC\u30EB\u30E0\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u6709\u52B9\u306A\u30EC\u30EB\u30E0\u306E\u30BF\u30A4\u30D7\u306F\u3001PAM\u3001OSGi\u3001File\u3001Certificate\u3001LDAP\u3001JDBC\u3001Digest\u3001Oracle Solaris\u3001\u304A\u3088\u3073Custom\u3067\u3059\u3002
realm.PageTitle=\u30EC\u30EB\u30E0
realm.PageHelp=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3(\u8A8D\u8A3C)\u30EC\u30EB\u30E0\u3092\u4F5C\u6210\u3001\u5909\u66F4\u3001\u307E\u305F\u306F\u524A\u9664\u3057\u307E\u3059\u3002
realm.TableTitle=\u30EC\u30EB\u30E0
realm.colClassname=\u30AF\u30E9\u30B9\u540D
realm.Classname=\u30AF\u30E9\u30B9\u540D:
realm.EditPageTitle=\u30EC\u30EB\u30E0\u306E\u7DE8\u96C6
realm.EditPageTitleHelp=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3(\u8A8D\u8A3C)\u30EC\u30EB\u30E0\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002
realm.ClassnameHelp=\u30C9\u30ED\u30C3\u30D7\u30C0\u30A6\u30F3\u30FB\u30EA\u30B9\u30C8\u304B\u3089\u30EC\u30EB\u30E0\u30FB\u30AF\u30E9\u30B9\u540D\u3092\u9078\u629E\u3059\u308B\u304B\u3001\u30AB\u30B9\u30BF\u30E0\u30FB\u30AF\u30E9\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059
realm.specificProps=\u3053\u306E\u30AF\u30E9\u30B9\u306B\u56FA\u6709\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
realm.realmName=\u30EC\u30EB\u30E0\u540D:
realm.jaax=JAAS\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8:
realm.jaaxHelp=\u3053\u306E\u30EC\u30EB\u30E0\u3067\u4F7F\u7528\u3059\u308B\u30ED\u30B0\u30A4\u30F3\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u8B58\u5225\u5B50
realm.keyFile=\u9375\u30D5\u30A1\u30A4\u30EB:
realm.keyFileHelp=\u30B5\u30FC\u30D0\u30FC\u304C\u3053\u306E\u30EC\u30EB\u30E0\u306E\u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u3001\u30B0\u30EB\u30FC\u30D7\u3001\u304A\u3088\u3073\u30D1\u30B9\u30EF\u30FC\u30C9\u60C5\u5831\u3092\u683C\u7D0D\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u30D5\u30EB\u30D1\u30B9\u3068\u540D\u524D
realm.asgroup=\u30B0\u30EB\u30FC\u30D7\u306E\u5272\u5F53\u3066:
realm.asgroupHelp=\u30B0\u30EB\u30FC\u30D7\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8
realm.directory=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA:
realm.directoryHelp=\u30B5\u30FC\u30D0\u30FC\u306ELDAP URL
realm.baseDn=\u30D9\u30FC\u30B9DN:
realm.baseDnHelp=\u30E6\u30FC\u30B6\u30FC\u30FB\u30C7\u30FC\u30BF\u306E\u4F4D\u7F6E\u306ELDAP\u30D9\u30FC\u30B9DN
realm.jndi=JNDI:
realm.jndiHelp=\u3053\u306E\u30EC\u30EB\u30E0\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BJDBC\u30EA\u30BD\u30FC\u30B9\u306EJNDI\u540D
realm.userTable=\u30E6\u30FC\u30B6\u30FC\u8868:
realm.userTableHelp=\u3053\u306E\u30EC\u30EB\u30E0\u306E\u627F\u8A8D\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30B9\u30C8\u3092\u683C\u7D0D\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u8868\u306E\u540D\u524D
realm.userName=\u30E6\u30FC\u30B6\u30FC\u540D\u5217:
realm.userNameHelp=\u30E6\u30FC\u30B6\u30FC\u540D\u306E\u30EA\u30B9\u30C8\u3092\u683C\u7D0D\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u8868\u5185\u306E\u5217\u306E\u540D\u524D
realm.pswd=\u30D1\u30B9\u30EF\u30FC\u30C9\u5217:
realm.pswdHelp=\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u683C\u7D0D\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u8868\u5185\u306E\u5217\u306E\u540D\u524D
realm.groupTable=\u30B0\u30EB\u30FC\u30D7\u8868:
realm.groupTableHelp=\u3053\u306E\u30EC\u30EB\u30E0\u306E\u30B0\u30EB\u30FC\u30D7\u306E\u30EA\u30B9\u30C8\u3092\u683C\u7D0D\u3059\u308B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u8868\u306E\u540D\u524D
realm.groupTableUserName=\u30B0\u30EB\u30FC\u30D7\u8868\u30E6\u30FC\u30B6\u30FC\u540D\u5217:
realm.groupTableUserNameHelp=\u3053\u306E\u30EC\u30EB\u30E0\u306E\u30B0\u30EB\u30FC\u30D7\u306E\u30EA\u30B9\u30C8\u3092\u683C\u7D0D\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u8868\u5185\u306E\u5217\u306E\u540D\u524D
realm.groupName=\u30B0\u30EB\u30FC\u30D7\u540D\u5217:
realm.groupNameHelp=\u30B0\u30EB\u30FC\u30D7\u540D\u306E\u30EA\u30B9\u30C8\u3092\u683C\u7D0D\u3059\u308B\u30B0\u30EB\u30FC\u30D7\u8868\u5185\u306E\u5217\u306E\u540D\u524D
realm.dbUser=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30E6\u30FC\u30B6\u30FC:
realm.dbUserHelp=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u304B\u308F\u308A\u306B\u3001\u30EC\u30EB\u30E0\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30E6\u30FC\u30B6\u30FC\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059
realm.dbPswd=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9:
realm.dbPswdHelp=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u304B\u308F\u308A\u306B\u3001\u30EC\u30EB\u30E0\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30FB\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3057\u307E\u3059
realm.digest=\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0:
realm.digestHelp=\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0(\u30C7\u30D5\u30A9\u30EB\u30C8\u306FSHA-256); GlassFish\u306E3.1\u3088\u308A\u524D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306FMD5\u3067\u3057\u305F
realm.pswdEnc=\u30D1\u30B9\u30EF\u30FC\u30C9\u6697\u53F7\u5316\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0:
realm.pswdEncHelp=\u3053\u308C\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u5185\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u6697\u53F7\u5316\u7528\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u793A\u3057\u307E\u3059\u3002\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u7A7A\u306E\u307E\u307E\u306B\u3059\u308B\u3068\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30EA\u30B9\u30AF\u304C\u3042\u308A\u307E\u3059\u3002
realm.encoding=\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0:
realm.encodingHelp=\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0(\u4F7F\u7528\u53EF\u80FD\u306A\u5024\u306FHex\u307E\u305F\u306FBase64)
realm.charset=\u6587\u5B57\u30BB\u30C3\u30C8:
realm.charsetHelp=\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30FB\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3067\u4F7F\u7528\u3059\u308B\u6587\u5B57\u30BB\u30C3\u30C8
realm.internalError=\u5185\u90E8\u30A8\u30E9\u30FC\u3002\u30EC\u30EB\u30E0\u540D\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 

## Audit Modules
auditModule.TableTitle=\u30E2\u30B8\u30E5\u30FC\u30EB
auditModule.PageTitle=\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB
auditModule.PageHelp=\u3059\u3079\u3066\u306E\u8A8D\u8A3C\u304A\u3088\u3073\u8A8D\u53EF\u30C7\u30B7\u30B8\u30E7\u30F3\u306E\u76E3\u67FB\u8A3C\u8DE1\u3092\u958B\u767A\u3059\u308B\u306B\u306F\u3001\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
auditModule.Classname=\u30AF\u30E9\u30B9\u540D:
auditModule.ClassnameHelp=\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30AF\u30E9\u30B9\u306E\u540D\u524D
auditModule.EditPageTitle=\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u7DE8\u96C6
auditModule.EditPageTitleHelp=\u3059\u3079\u3066\u306E\u8A8D\u8A3C\u304A\u3088\u3073\u8A8D\u53EF\u30C7\u30B7\u30B8\u30E7\u30F3\u306E\u76E3\u67FB\u8A3C\u8DE1\u3092\u958B\u767A\u3057\u307E\u3059\u3002
auditModule.NewPageTitle=\u65B0\u898F\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB
auditModule.NewPageTitleHelp=\u3059\u3079\u3066\u306E\u8A8D\u8A3C\u304A\u3088\u3073\u8A8D\u53EF\u30C7\u30B7\u30B8\u30E7\u30F3\u306E\u76E3\u67FB\u8A3C\u8DE1\u3092\u958B\u767A\u3059\u308B\u306B\u306F\u3001\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002


## Manage Users
manageUsers.UserID=\u30E6\u30FC\u30B6\u30FCID:
manageUsers.UserIDHelp=\u540D\u524D\u306F255\u6587\u5B57\u4EE5\u5185\u3067\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30C0\u30C3\u30B7\u30E5\u3001\u307E\u305F\u306F\u30C9\u30C3\u30C8\u306E\u5404\u6587\u5B57\u306E\u307F\u3092\u542B\u3081\u3089\u308C\u307E\u3059
manageUsers.GroupList=\u30B0\u30EB\u30FC\u30D7\u30FB\u30EA\u30B9\u30C8:
manageUsers.GroupListHelp=\u8907\u6570\u306E\u30B0\u30EB\u30FC\u30D7\u306F\u30B3\u30ED\u30F3\u3067\u533A\u5207\u308A\u307E\u3059
manageUsers.NewPassword=\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9:
manageUsers.ConfirmNewPassword=\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u78BA\u8A8D:
manageUsers.TablePageTitle=\u30D5\u30A1\u30A4\u30EB\u30FB\u30E6\u30FC\u30B6\u30FC
manageUsers.TablePageHelp=\u73FE\u5728\u9078\u629E\u3057\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30EC\u30EB\u30E0\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002
manageUsers.TableTitle=\u30D5\u30A1\u30A4\u30EB\u30FB\u30E6\u30FC\u30B6\u30FC
manageAdminUsers.TableTitle=\u7BA1\u7406\u30E6\u30FC\u30B6\u30FC
manageUsers.UserIdCol=\u30E6\u30FC\u30B6\u30FCID
manageUsers.EditPageTitle=\u30D5\u30A1\u30A4\u30EB\u30FB\u30EC\u30EB\u30E0\u30FB\u30E6\u30FC\u30B6\u30FC\u306E\u7DE8\u96C6
manageUsers.EditPageTitleHelp=\u73FE\u5728\u9078\u629E\u3057\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30EC\u30EB\u30E0\u306E\u65E2\u5B58\u306E\u30E6\u30FC\u30B6\u30FC\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
manageUsers.NewPageTitle=\u65B0\u898F\u30D5\u30A1\u30A4\u30EB\u30FB\u30EC\u30EB\u30E0\u30FB\u30E6\u30FC\u30B6\u30FC
manageUsers.NewPageTitleHelp=\u73FE\u5728\u9078\u629E\u3057\u3066\u3044\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30EC\u30EB\u30E0\u306E\u65B0\u898F\u30E6\u30FC\u30B6\u30FC\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
msg.error.cannotDeleteCurrent=\u73FE\u5728\u306E\u7BA1\u7406\u30E6\u30FC\u30B6\u30FC\u306F\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002



## Message Security Configuration
headings.NewMsgSecurity=\u65B0\u898F\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u69CB\u6210
msgSecurity.NewMsgSecurityInfo=\u7279\u5B9A\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u304C\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u3059\u3079\u3066\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u3092\u69CB\u6210\u3057\u307E\u3059\u3002
msgSecurity.TableTitle=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u69CB\u6210
msgSecurity.ListPageTitle=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u69CB\u6210
msgSecurity.ListPageHelp=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u69CB\u6210\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30EC\u30A4\u30E4\u30FC\u3067Web\u30B5\u30FC\u30D3\u30B9\u306E\u547C\u51FA\u3057\u3068\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u30A8\u30F3\u30C9\u30C4\u30FC\u30A8\u30F3\u30C9\u3067\u8A8D\u8A3C\u3067\u304D\u307E\u3059\u3002
msgSecurity.colAuthLayer=\u8A8D\u8A3C\u30EC\u30A4\u30E4\u30FC
msgSecurity.colDefaultProv=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0
msgSecurity.colDefaultClientProv=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0
msgSecurity.EditMsgSecurity=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u69CB\u6210\u306E\u7DE8\u96C6
msgSecurity.EditMsgSecurityInfo=\u30B5\u30FC\u30D0\u30FC\u304A\u3088\u3073\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u69CB\u6210\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u9078\u629E\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001null\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u304C\u69CB\u6210\u3055\u308C\u307E\u3059\u3002
msgSecurity.msgSecurityTab=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3
msgSecurity.msgSecurityTab.tooltip=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3
msgSecurity.providersTab=\u30D7\u30ED\u30D0\u30A4\u30C0
msgSecurity.providersTab.tooltip=\u300C\u30D7\u30ED\u30D0\u30A4\u30C0\u300D\u30BF\u30D6
msgSecurity.authLayerLabel=\u8A8D\u8A3C\u30EC\u30A4\u30E4\u30FC:
msgSecurity.defaultProviderLabel=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0:
msgSecurity.defaultProviderHelp=\u30B5\u30FC\u30D0\u30FC\u5074\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30EC\u30A4\u30E4\u30FC\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u3092\u6709\u52B9\u306B\u3057\u307E\u3059
msgSecurity.defaultClProviderLabel=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0:
msgSecurity.defaultClProviderHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30EC\u30A4\u30E4\u30FC\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u3092\u6709\u52B9\u306B\u3057\u307E\u3059

## Providers
msgSecProvider.TableTitle=\u30D7\u30ED\u30D0\u30A4\u30C0\u69CB\u6210
msgSecProvider.ListPageTitle=\u30D7\u30ED\u30D0\u30A4\u30C0\u69CB\u6210
msgSecProvider.ListPageHelp=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u69CB\u6210\u3057\u307E\u3059\u3002
msgSecProvider.colProvId=\u30D7\u30ED\u30D0\u30A4\u30C0ID
msgSecProvider.colProvType=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FB\u30BF\u30A4\u30D7
msgSecProvider.defaultProviderCol=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0
msgSecProvider.colClassName=\u30AF\u30E9\u30B9\u540D
msgProvider.EditPageTitle=\u30D7\u30ED\u30D0\u30A4\u30C0\u69CB\u6210\u306E\u7DE8\u96C6
msgProvider.EditPageTitleHelp=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002
msgSecProvider.providerConfLabel=\u30D7\u30ED\u30D0\u30A4\u30C0\u69CB\u6210
msgSecProvider.providerTypeLabel=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FB\u30BF\u30A4\u30D7:
msgSecProvider.providerTypeHelp=\u8A8D\u8A3C\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u30BF\u30A4\u30D7\u3092\u69CB\u6210\u3057\u3066\u3044\u307E\u3059
msgSecProvider.ProviderIdLabel=\u30D7\u30ED\u30D0\u30A4\u30C0ID:
msgSecProvider.classNameLabel=\u30AF\u30E9\u30B9\u540D:
msgSecProvider.classNameHelp=\u30D7\u30ED\u30D0\u30A4\u30C0\u306EJava\u5B9F\u88C5\u30AF\u30E9\u30B9\u3002\u4F8B: <tt>com.sun.xml.wss.provider.ClientSecurityAuthModule</tt>\u307E\u305F\u306F<tt>com.sun.xml.wss.provider.ServerSecurityAuthModule</tt>
msgSecProvider.requestPolicyLabel=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30DD\u30EA\u30B7\u30FC
msgSecProvider.authSourceLabel=\u8A8D\u8A3C\u5143:
msgSecProvider.authSourceRequestHelp=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u9069\u7528\u3055\u308C\u308B\u8A8D\u8A3C\u306E\u30BF\u30A4\u30D7
msgSecProvider.authRecepientLabel=\u8A8D\u8A3C\u5148:
msgSecProvider.authRecepientHelp=\u8A8D\u8A3C\u3092\u5B9F\u884C\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u3068\u304D
msgSecProvider.responsePolicyLabel=\u30EC\u30B9\u30DD\u30F3\u30B9\u30FB\u30DD\u30EA\u30B7\u30FC
msgSecProvider.authSourceResponseHelp=\u30EC\u30B9\u30DD\u30F3\u30B9\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u9069\u7528\u3055\u308C\u308B\u8A8D\u8A3C\u306E\u30BF\u30A4\u30D7
msgSecProvider.NewPageTitle=\u65B0\u898F\u30D7\u30ED\u30D0\u30A4\u30C0\u69CB\u6210
msgSecProvider.NewPageTitleHelp=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u69CB\u6210\u3092\u6307\u5B9A\u3057\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30EC\u30A4\u30E4\u30FC\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
msgSecProvider.defaultProviderLabel=\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0:
msgSecProvider.defaultProviderLabeHelp=\u30D7\u30ED\u30D0\u30A4\u30C0\u304C\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u3069\u3061\u3089\u304B\u307E\u305F\u306F\u305D\u306E\u4E21\u65B9\u3067\u3042\u308B\u304B\u304C\u3001\u30D7\u30ED\u30D0\u30A4\u30C0\u30FB\u30BF\u30A4\u30D7\u306B\u3088\u3063\u3066\u6C7A\u5B9A\u3055\u308C\u307E\u3059\u3002
msgSecProvider.ProviderIdHelp=\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u53C2\u7167\u6642\u306B\u4F7F\u7528\u3059\u308B\u540D\u524D

## Jacc Providers
common.Jacc=JACC
jacc.table.nameCol=\u540D\u524D
jacc.colPolicyProvider=\u30DD\u30EA\u30B7\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0
jacc.TableTitle=JACC\u30D7\u30ED\u30D0\u30A4\u30C0
jacc.PageTitle=JACC\u30D7\u30ED\u30D0\u30A4\u30C0
jacc.PageHelp=Java Authorization Contract for Containers (JACC)\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002
## JACC Providers (1)
jacc.NewPageTitle=\u65B0\u898FJACC\u30D7\u30ED\u30D0\u30A4\u30C0
jacc.NewPageHelp=\u65B0\u898FJACC\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
jacc.NameHelp=JACC\u30D7\u30ED\u30D0\u30A4\u30C0\u540D\u3002\u540D\u524D\u306B\u542B\u3081\u308B\u3053\u3068\u304C\u3067\u304D\u308B\u306E\u306F\u3001\u82F1\u6570\u5B57\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30C0\u30C3\u30B7\u30E5\u3001\u307E\u305F\u306F\u30C9\u30C3\u30C8\u306E\u5404\u6587\u5B57\u306E\u307F\u3067\u3059
jacc.PolicyConfig=\u30DD\u30EA\u30B7\u30FC\u69CB\u6210:
jacc.PolicyConfigHelp=\u30DD\u30EA\u30B7\u30FC\u69CB\u6210\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9
jacc.PolicyProvider=\u30DD\u30EA\u30B7\u30FC\u30FB\u30D7\u30ED\u30D0\u30A4\u30C0:
jacc.PolicyProviderHelp=\u30DD\u30EA\u30B7\u30FC\u30FB\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9
jacc.EditTitle=JACC\u30D7\u30ED\u30D0\u30A4\u30C0\u306E\u7DE8\u96C6
jacc.EditPageHelp=\u65E2\u5B58\u306EJACC\u30D7\u30ED\u30D0\u30A4\u30C0\u3092\u7DE8\u96C6\u3057\u307E\u3059\u3002

#
# Log Viewer
#
logViewer.colLogLevel=\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB

logViewer.PageTitle=\u30ED\u30B0\u30FB\u30D3\u30E5\u30FC\u30A2
logViewer.PageHelp=\u57FA\u672C\u304A\u3088\u3073\u8A73\u7D30\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u8868\u793A\u3001\u691C\u7D22\u3001\u304A\u3088\u3073\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3057\u307E\u3059\u3002\u3053\u3053\u3067\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u3067\u304D\u308B\u30ED\u30B0\u306E\u30EC\u30D9\u30EB\u306B\u3064\u3044\u3066\u306F\u3001\u300C\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u300D\u30DA\u30FC\u30B8\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
logViewer.searchCriteriaLabel=\u691C\u7D22\u57FA\u6E96
logViewer.dateRangeLabel=\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7:
logViewer.dateRangeLabelHelp=\u6700\u65B0\u306E\u3001\u307E\u305F\u306F\u7279\u5B9A\u306E\u65E5\u4ED8\u3068\u6642\u9593\u306E\u7BC4\u56F2\u3092\u6307\u5B9A\u3057\u307E\u3059
logViewer.dateDisabled=\u6700\u65B0
logViewer.dateEnabled=\u7279\u5B9A\u7BC4\u56F2:
logViewer.dateLabel=\u65E5\u4ED8
logViewer.timeLabel=\u6642\u9593
logViewer.fromDateLabel=\u958B\u59CB:
logViewer.fromDateHelp=\u4F8B: {0}
logViewer.fromTimeHelp=\u4F8B: {0}
logViewer.toDateLabel=\u7D42\u4E86:
logViewer.toDateHelp=\u4F8B: {0}
logViewer.toTimeHelp=\u4F8B: {0}
logViewer.levelLabel=\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB:
logViewer.levelLabelHelp=\u30ED\u30B0\u30FB\u30A8\u30F3\u30C8\u30EA\u306F\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u5185\u306B\u683C\u7D0D\u3055\u308C\u305F\u3082\u306E\u306B\u9650\u5B9A\u3055\u308C\u307E\u3059\u3002\u300C\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u300D\u30DA\u30FC\u30B8\u3067\u9069\u5207\u306A\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u3092\u8A2D\u5B9A\u3057\u3001\u30C7\u30FC\u30BF\u304C\u78BA\u5B9F\u306B\u30ED\u30B0\u3055\u308C\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
logViewer.modifySearch=\u691C\u7D22\u306E\u5909\u66F4
logViewer.PaginationText=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u30FB\u30EC\u30B3\u30FC\u30C9\u756A\u53F7{0}\u304B\u3089{1}  
logViewer.RecordsBefore={0}\u3088\u308A\u524D\u306E\u30EC\u30B3\u30FC\u30C9\u6570
logViewer.RecordsAfter={0}\u3088\u308A\u5F8C\u306E\u30EC\u30B3\u30FC\u30C9\u6570
logViewer.moduleLabel=\u30ED\u30AC\u30FC:
logViewer.moduleLabelHelp=\u8868\u793A\u3059\u308B1\u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30ED\u30B0\u3092\u9078\u629E
logViewer.moduleHelp=\u8907\u6570\u3092\u9078\u629E\u3059\u308B\u3068\u304D\u306F\u3001Ctrl\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF
logViewer.customLoggerLabel=\u30AB\u30B9\u30BF\u30E0\u30FB\u30ED\u30AC\u30FC:
logViewer.customLoggerLabelHelp=\u8868\u793A\u3059\u308B\u30AB\u30B9\u30BF\u30E0\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30ED\u30B0\u3092\u6307\u5B9A
logViewer.customLoggerHelp=\u8907\u6570\u306E\u5024\u3092\u5225\u500B\u306E\u884C\u306B\u5165\u529B\u3059\u308B
logViewer.anySearch=\u30C6\u30AD\u30B9\u30C8\u691C\u7D22:
logViewer.anySearchHelp=\u6307\u5B9A\u3055\u308C\u305F\u30C6\u30AD\u30B9\u30C8\u3092\u542B\u3080\u30ED\u30B0\u30FB\u30A8\u30F3\u30C8\u30EA\u306E\u307F\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u691C\u7D22\u3067\u306F\u5927\u6587\u5B57\u3068\u5C0F\u6587\u5B57\u304C\u533A\u5225\u3055\u308C\u307E\u3059\u3002
logViewer.numberToDisplayLabel=\u8868\u793A:
logViewer.numberToDisplayLabelHelp=\u8868\u793A\u3059\u308B\u30ED\u30B0\u30FB\u30A8\u30F3\u30C8\u30EA\u306E\u6570\u3092\u9078\u629E\u3057\u307E\u3059\u3002
logViewer.numberToDisplayLabelRight=\u30DA\u30FC\u30B8\u5F53\u305F\u308A\u306E\u30A8\u30F3\u30C8\u30EA\u6570
logViewer.searchButton=\u691C\u7D22
logViewer.title=\u30ED\u30B0\u30FB\u30D3\u30E5\u30FC\u30A2\u306E\u7D50\u679C
logViewer.dateTimeLabel=\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7
logViewer.loggerLabel=\u30ED\u30AC\u30FC
logViewer.messageLabel=\u30E1\u30C3\u30BB\u30FC\u30B8
logViewer.nvpLabel=\u540D\u524D\u3068\u5024\u306E\u30DA\u30A2
logViewer.priorMatches=\u524D\u65B9\u4E00\u81F4\u691C\u7D22\u3092\u7D9A\u884C
logViewer.nextMatches=\u5F8C\u65B9\u4E00\u81F4\u691C\u7D22\u3092\u7D9A\u884C
logViewer.emptyTable=\u4E00\u81F4\u3059\u308B\u30EC\u30B3\u30FC\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u691C\u7D22\u3092\u3082\u3046\u4E00\u5EA6\u3084\u308A\u76F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
logViewer.summary=\u30ED\u30B0\u30FB\u30D3\u30E5\u30FC\u30A2\u306E\u8981\u7D04
logViewer.optionsJumpMessage=\u691C\u7D22\u306E\u5909\u66F4
logViewer.topJumpMessage=\u5148\u982D\u306B\u623B\u308B
logViewer.moreInfoLinkText=(\u8A73\u7D30)
logViewer.truncateMessageLabel=\u904E\u5EA6\u306B\u9577\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5236\u9650
logViewer.truncateMessageHelp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u5168\u6587\u306F\u8A73\u7D30\u30DA\u30FC\u30B8\u3067\u78BA\u8A8D\u3067\u304D\u307E\u3059
logViewer.serverNameLabel=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D:
logViewer.advancedSearch=\u8A73\u7D30\u691C\u7D22
logViewer.basicSearch=\u57FA\u672C\u691C\u7D22
logViewer.searchResults=\u691C\u7D22\u7D50\u679C
logViewer.instanceLabel=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9:
logViewer.recordNumberLabel=\u30EC\u30B3\u30FC\u30C9\u756A\u53F7
logViewer.logFile=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB:
logViewer.advancedOptions=\u8A73\u7D30\u30AA\u30D7\u30B7\u30E7\u30F3
logViewer.prevButtonMessage={0}\u3088\u308A\u524D\u306E\u30EC\u30B3\u30FC\u30C9\u6570
logViewer.nextButtonMessage={0}\u3088\u308A\u5F8C\u306E\u30EC\u30B3\u30FC\u30C9\u6570
logViewer.nodeAgentNotRunning=\u30ED\u30B0\u3092\u8868\u793A\u3059\u308B\u306B\u306F\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{0}\u304C\u7A3C\u50CD\u3057\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
logViewer.noSevereMessages=\u3088\u308A\u91CD\u5EA6\u306E\u9AD8\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3053\u308C\u4EE5\u4E0A\u542B\u3081\u306A\u3044
logViewer.NoRecordsFound=\u30EC\u30B3\u30FC\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093
logViewer.Prev=\u524D
logViewer.Next=\u6B21

logViewerRaw.PageTitle=raw\u30ED\u30B0\u30FB\u30D3\u30E5\u30FC\u30A2
logViewerRaw.PageHelp=\u57FA\u672C\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u8868\u793A\u3057\u307E\u3059\u3002

domainLogs.PageTitle=\u30C9\u30E1\u30A4\u30F3\u30FB\u30ED\u30B0
domainLogs.PageHelp=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u53CE\u96C6\u3059\u308B\u5BFE\u8C61\u306E\u30AF\u30E9\u30B9\u30BF\u307E\u305F\u306F\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u9078\u629E\u3057\u307E\u3059\u3002
domainLogs.tab=\u30C9\u30E1\u30A4\u30F3\u30FB\u30ED\u30B0
domainLogs.tabTip=\u30AF\u30E9\u30B9\u30BF\u307E\u305F\u306F\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u53CE\u96C6\u3057\u307E\u3059\u3002


logDetail.PageTitle=\u30ED\u30B0\u30FB\u30A8\u30F3\u30C8\u30EA\u306E\u8A73\u7D30
logDetail.recordDetailLabel=\u8A73\u7D30
logDetail.timeStampLabel=\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7
logDetail.levelLabel=\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB
logDetail.loggerLabel=\u30ED\u30AC\u30FC
logDetail.nvpLabel=\u540D\u524D\u3068\u5024\u306E\u30DA\u30A2
logDetail.recordNumberLabel=\u30EC\u30B3\u30FC\u30C9\u756A\u53F7
logDetail.messageIDLabel=\u30E1\u30C3\u30BB\u30FC\u30B8ID
logDetail.messageLabel=\u30E1\u30C3\u30BB\u30FC\u30B8\u5168\u6587
logDetail.closeButton=\u9589\u3058\u308B
logDetail.diagnosticCausesLabel=\u8A3A\u65AD\u306E\u539F\u56E0
logDetail.diagnosticChecksLabel=\u8A3A\u65AD\u30C1\u30A7\u30C3\u30AF
logDetail.diagnosticURILabel=URI

log.levelLabel=\u30EC\u30D9\u30EB:
log.addLogger=\u30ED\u30AC\u30FC\u306E\u8FFD\u52A0
log.deleteLogger=\u30ED\u30AC\u30FC\u306E\u524A\u9664

#
# Logging
#
log.LoggingGeneralTab=\u4E00\u822C
log.Logging=\u30ED\u30AE\u30F3\u30B0
log.LogLevels=\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB
log.LogLevelsTab=\u300C\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u300D\u30BF\u30D6
log.LoggingSettings=\u30ED\u30AC\u30FC\u306E\u8A2D\u5B9A
log.LoggingSettingsHelp=GlassFish Server\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u307E\u3059
log.LoggingSettingsHelp2=GlassFish Server\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u307E\u3059\u3002\u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30AE\u30F3\u30B0\u60C5\u5831\u3092\u8868\u793A\u3059\u308B\u306B\u306F\u3001\u300C<a href="#{request.contextPath}/web/configuration/accessLog.jsf?configName=server-config">\u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30B0</a>\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
log.LogFile=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB:
log.LogFileHelp=\u7D76\u5BFE\u30D1\u30B9\u3092\u4F7F\u7528\u3057\u3066\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D\u3092\u5909\u66F4\u3059\u308B\u304B\u3001\u30D5\u30A1\u30A4\u30EB\u3092\u518D\u914D\u7F6E\u3057\u307E\u3059
log.WriteSystemLog=\u30B7\u30B9\u30C6\u30E0\u30FB\u30ED\u30B0\u306B\u66F8\u8FBC\u307F:
log.WriteSystemlogHelp=\u30ED\u30B0\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u751F\u6210\u3068\u7BA1\u7406\u306B\u306F\u3001UNIX\u306Esyslog\u30B5\u30FC\u30D3\u30B9\u3092\u4F7F\u7528\u3057\u307E\u3059
log.LogtoConsole=\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u30ED\u30B0\u3092\u8A18\u9332:
log.LogtoConsoleHelp=\u30ED\u30B0\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30B7\u30B9\u30C6\u30E0\u30FB\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u66F8\u304D\u8FBC\u3080
log.Handler=\u30ED\u30B0\u30FB\u30CF\u30F3\u30C9\u30E9:
log.HandlerHelp=\u30ED\u30B0\u3092\u5225\u306E\u5B9B\u5148\u306B\u8A18\u9332\u3059\u308B\u305F\u3081\u306E\u30AB\u30B9\u30BF\u30E0\u30FB\u30ED\u30B0\u30FB\u30CF\u30F3\u30C9\u30E9\u3092\u6307\u5B9A\u3057\u307E\u3059
log.Filter=\u30ED\u30B0\u30FB\u30D5\u30A3\u30EB\u30BF:
log.FilterHelp=\u30ED\u30B0\u30FB\u30EC\u30B3\u30FC\u30C9\u306E\u30AB\u30B9\u30BF\u30E0\u30FB\u30D5\u30A3\u30EB\u30BF\u30EA\u30F3\u30B0\u306B\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30B0\u30FB\u30D5\u30A3\u30EB\u30BF\u3092\u6307\u5B9A\u3057\u307E\u3059
log.FileRotationLimit=\u30D5\u30A1\u30A4\u30EB\u30FB\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u5236\u9650:
log.FileRotationLimitHelp=\u30D5\u30A1\u30A4\u30EB\u30FB\u30B5\u30A4\u30BA\u306E\u5236\u9650\u306B\u9054\u3057\u305F\u3068\u304D\u306B\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3057\u307E\u3059\u3002\u65B0\u898F\u30ED\u30B0\u306E\u9818\u57DF\u3092\u78BA\u4FDD\u3059\u308B\u305F\u3081\u306B\u6700\u3082\u53E4\u3044\u30ED\u30B0\u304C\u524A\u9664\u3055\u308C\u307E\u3059
log.FileRotationTimeLimit=\u30D5\u30A1\u30A4\u30EB\u30FB\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u306E\u5236\u9650\u6642\u9593:
log.FileRotationTimeLimitHelp=0\u306B\u8A2D\u5B9A\u3055\u308C\u305F\u5834\u5408\u3001\u30ED\u30B0\u30FB\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u5236\u9650\u3067\u6307\u5B9A\u3055\u308C\u305F\u30B5\u30A4\u30BA\u306B\u57FA\u3065\u3044\u3066\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3057\u307E\u3059
log.RetainErrorStats=\u30A8\u30E9\u30FC\u7D71\u8A08\u306E\u4FDD\u6301
log.LogLevelsPageTitle=\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB
log.LogLevelsPageTitleHelp=\u5404\u30ED\u30AC\u30FC\u306E\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u76EE\u7684\u306E\u30ED\u30AC\u30FC\u540D\u306E\u6A2A\u306B\u3042\u308B\u300C\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u300D\u30EA\u30B9\u30C8\u304B\u3089\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB\u3092\u9078\u629E\u3057\u307E\u3059\u3002\u307E\u305F\u306F\u3001\u8907\u6570\u306E\u30ED\u30AC\u30FC\u3092\u9078\u629E\u3057\u3001\u8868\u306E\u4E0A\u90E8\u306B\u3042\u308B\u300C\u30EC\u30D9\u30EB\u300D\u30C9\u30ED\u30C3\u30D7\u30C0\u30A6\u30F3\u30FB\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002
log.FlushFrequency=\u30D5\u30E9\u30C3\u30B7\u30E5\u306E\u983B\u5EA6:
log.FlushFrequencyHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u306B1\u5EA6\u306B\u66F8\u304D\u8FBC\u3080\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5927\u6570
log.rotationOnDateChange=\u65E5\u4ED8\u5909\u66F4\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3:
log.rotationOnDateChangeHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u6BCE\u65E5\u5348\u524D0\u6642\u306B\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3
log.MaxHistoryFiles=\u6700\u5927\u5C65\u6B74\u30D5\u30A1\u30A4\u30EB\u6570:
log.MaxHistoryFilesHelp=\u4FDD\u6301\u3059\u308B\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u6700\u5927\u6570\u3002\u3059\u3079\u3066\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u6E08\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u4FDD\u6301\u3059\u308B\u306B\u306F\u30010\u3092\u5165\u529B\u3057\u307E\u3059\u3002
log.multiLineMode=\u8907\u6570\u884C\u30E2\u30FC\u30C9:
log.multiLineModeHelp=\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30D8\u30C3\u30C0\u30FC\u306E\u5F8C\u306E\u65B0\u3057\u3044\u884C\u304B\u3089\u30ED\u30B0\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u672C\u6587\u3092\u958B\u59CB\u3059\u308B
log.ConsoleLogFormat=\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8:
log.ConsoleLogFormatHelp=\u30B3\u30F3\u30BD\u30FC\u30EB\u3078\u306E\u30ED\u30AE\u30F3\u30B0\u306E\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
log.FileLogFormat=\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u30ED\u30AE\u30F3\u30B0\u30FB\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8:
log.FileLogFormatHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30ED\u30AE\u30F3\u30B0\u306E\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8
log.excludeFields=\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u9664\u5916\u30D5\u30A3\u30FC\u30EB\u30C9:
log.excludeFieldsHelp=\u3053\u308C\u3089\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u30ED\u30B0\u30FB\u30EC\u30B3\u30FC\u30C9\u3067\u9664\u5916\u3059\u308B

log.LoggerLevelTableTitle=\u30ED\u30AC\u30FC\u306E\u8A2D\u5B9A
log.LoggerNameCol=\u30ED\u30AC\u30FC\u540D
log.LoggerLeveCol=\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB

log.logGeneralTab=\u4E00\u822C
log.logLevelTab=\u30B5\u30FC\u30D0\u30FC\u306E\u30ED\u30B0\u30FB\u30EC\u30D9\u30EB
log.accessLogTab=\u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30B0

log.Button.logRotation=\u30ED\u30B0\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3
log.Button.logRotationTip=\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B

log.Button.accessLogRotation=\u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30B0\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3
log.Button.accessLogRotationTip=\u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B

inst.jvmReport=JVM\u30EC\u30DD\u30FC\u30C8


jvm.jvmReportPageName=JVM\u30EC\u30DD\u30FC\u30C8
jvm.jvmReportEEPageName={0}\u306EJVM\u30EC\u30DD\u30FC\u30C8
jvmReport.viewLabel=\u8868\u793A:
jvmReport.Summary=\u8981\u7D04
jvmReport.Memory=\u30E1\u30E2\u30EA\u30FC
jvmReport.ClLoading=\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9
jvmReport.ThDump=\u30B9\u30EC\u30C3\u30C9\u30FB\u30C0\u30F3\u30D7

lifecycleModules.title=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB
lifecycleModules.titleHelp=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u306B\u304A\u3051\u308B1\u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30A4\u30D9\u30F3\u30C8\u306B\u3088\u3063\u3066\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u305F\u3068\u304D\u306B\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3057\u307E\u3059\u3002\u53EF\u80FD\u306A\u30C8\u30EA\u30AC\u30FC\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u306F\u3001\u521D\u671F\u5316\u3001\u8D77\u52D5\u3001\u30B5\u30FC\u30D3\u30B9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3059\u308B\u6E96\u5099\u3001\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3067\u3059\u3002\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306FJava\u4ED5\u69D8\u306E\u4E00\u90E8\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u304C\u3001GlassFish Server\u306E\u62E1\u5F35\u6A5F\u80FD\u3067\u3059\u3002
lifecycleModule.editPageTitle=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u7DE8\u96C6
lifecycleModule.editPageTitleHelp=\u65E2\u5B58\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
lifecycleModule.newPageTitle=\u65B0\u898F\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB
lifecycleModule.newPageTitleHelp=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u306B\u304A\u3051\u308B1\u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30A4\u30D9\u30F3\u30C8\u306B\u3088\u3063\u3066\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u305F\u3068\u304D\u306B\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3057\u307E\u3059\u3002\u53EF\u80FD\u306A\u30C8\u30EA\u30AC\u30FC\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u306F\u3001\u521D\u671F\u5316\u3001\u8D77\u52D5\u3001\u30B5\u30FC\u30D3\u30B9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3059\u308B\u6E96\u5099\u3001\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3067\u3059\u3002
lifecycleModule.targetPageTitle=\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8
lifecycleModule.targetPageTitleHelp=\u3053\u306E\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u4F7F\u7528\u3067\u304D\u308B\u30BF\u30FC\u30B2\u30C3\u30C8(\u30AF\u30E9\u30B9\u30BF\u304A\u3088\u3073\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9)\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002

lifecycleModule.classname=\u30AF\u30E9\u30B9\u540D:
lifecycleModule.classnameHelp=\u540D\u524D\u306B\u542B\u3081\u308B\u3053\u3068\u304C\u3067\u304D\u308B\u306E\u306F\u3001\u82F1\u6570\u5B57\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30C0\u30C3\u30B7\u30E5\u3001\u307E\u305F\u306F\u30C9\u30C3\u30C8\u306E\u5404\u6587\u5B57\u306E\u307F\u3067\u3059\u3002
lifecycleModule.classPath=\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9:
lifecycleModule.classPathHelp=\u30B5\u30FC\u30D0\u30FC\u306E\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306B\u3059\u3067\u306B\u30AF\u30E9\u30B9\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306F\u7A7A\u767D\u306B\u3067\u304D\u307E\u3059\u3002
lifecycleModule.loadOrder=\u30ED\u30FC\u30C9\u9806\u5E8F:
lifecycleModule.loadOrderHelp=\u30B5\u30FC\u30D0\u30FC\u306E\u8D77\u52D5\u6642\u306B\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u30ED\u30FC\u30C9\u3055\u308C\u308B\u9806\u5E8F\u3002\u6574\u6570\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u6570\u5024\u304C\u5C0F\u3055\u3044\u30E2\u30B8\u30E5\u30FC\u30EB\u307B\u3069\u5148\u306B\u30ED\u30FC\u30C9\u3055\u308C\u307E\u3059\u3002
lifecycleModule.onLoadFailure=\u30ED\u30FC\u30C9\u969C\u5BB3\u6642:
lifecycleModule.preventStart=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u8D77\u52D5\u3057\u306A\u3044
lifecycleModule.onLoadFailureHelp=\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u305F\u5834\u5408\u306F\u3001\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u8D77\u52D5\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002


button.DeleteProfiler=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306E\u524A\u9664
button.CreateProfiler=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306E\u4F5C\u6210
button.enableSecureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u306E\u6709\u52B9\u5316
button.disableSecureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u306E\u7121\u52B9\u5316
button.secureAdmin=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406...

#
# JVM Settings
#
jvm.GeneralTitle=JVM\u306E\u5168\u822C\u7684\u306A\u8A2D\u5B9A
jvm.GeneralPageHelp=Java\u4EEE\u60F3\u30DE\u30B7\u30F3(JVM)\u306E\u5168\u822C\u7684\u306A\u69CB\u6210\u306E\u8A2D\u5B9A\u3092\u5909\u66F4\u3057\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u8A2D\u5B9A\u306E\u3046\u3061\u3001\u4E00\u90E8\u306FJava Platform Debugger Architecture (JPDA)\u30C7\u30D0\u30C3\u30AC\u3068\u306E\u5BFE\u8A71\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002
jvm.JavaHomeLabel=Java\u30DB\u30FC\u30E0:
jvm.JavaHomeHelp=Java Development Kit\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30D1\u30B9
jvm.JavacOptionsLabel=Javac\u30AA\u30D7\u30B7\u30E7\u30F3:
jvm.JavacOptionsHelp=Javac\u30B3\u30F3\u30D1\u30A4\u30E9\u306B\u6E21\u3055\u308C\u308B\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3
jvm.DebugLabel=\u30C7\u30D0\u30C3\u30B0:
jvm.DebugHelp=JPDA\u30D9\u30FC\u30B9\u306E\u30C7\u30D0\u30C3\u30AC\u7528\u306B\u6E96\u5099\u3055\u308C\u305F\u30C7\u30D0\u30C3\u30B0\u30FB\u30E2\u30FC\u30C9\u3067\u30B5\u30FC\u30D0\u30FC\u3092\u8D77\u52D5\u3057\u307E\u3059
jvm.DebugOptionsLabel=\u30C7\u30D0\u30C3\u30B0\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3:
jvm.DebugOptionsHelp=\u30C7\u30D0\u30C3\u30B0\u3092\u6709\u52B9\u306B\u3057\u305F\u5834\u5408\u306BJVM\u306B\u6E21\u3055\u308C\u308BJPDA\u30AA\u30D7\u30B7\u30E7\u30F3
jvm.RMICompileOptionsLabel=RMI\u30B3\u30F3\u30D1\u30A4\u30EB\u30FB\u30AA\u30D7\u30B7\u30E7\u30F3:
jvm.RMICompileOptionsHelp=<tt>-keepgenerated</tt>\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u30B9\u30BF\u30D6\u304A\u3088\u3073\u30BF\u30A4\u7528\u306B\u751F\u6210\u3055\u308C\u305F\u30BD\u30FC\u30B9\u304C\u4FDD\u5B58\u3055\u308C\u307E\u3059
jvm.BytecodePreprocessorLabel=\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u30FB\u30D7\u30EA\u30D7\u30ED\u30BB\u30C3\u30B5:
jvm.BytecodePreprocessorHelp=\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u30FB\u30D7\u30EA\u30D7\u30ED\u30BB\u30C3\u30B7\u30F3\u30B0\u306E\u30D1\u30E9\u30E1\u30FC\u30BF
jvm.PathSettingsTitle=JVM\u30D1\u30B9\u8A2D\u5B9A
jvm.PathSettingsPageHelp=JVM(Java\u4EEE\u60F3\u30DE\u30B7\u30F3)\u306E\u30D1\u30B9\u8A2D\u5B9A\u3092\u5909\u66F4\u3057\u307E\u3059\u3002

jvm.unsupportedSectionHelp=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u5C5E\u6027\u3067\u3059
jvm.SystemClasspath=\u30B7\u30B9\u30C6\u30E0\u30FB\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9:
jvm.SystemClasspathHelp=\u30B7\u30B9\u30C6\u30E0\u30FB\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306B\u8FFD\u52A0\u3059\u308B(v3\u3067\u306F\u672A\u30B5\u30DD\u30FC\u30C8)
jvm.EnvironmentClasspath=\u74B0\u5883\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9:
jvm.EnvironmentClasspathHelp=CLASSPATH\u74B0\u5883\u5909\u6570\u3092\u7121\u8996\u3059\u308B(v3\u3067\u306F\u672A\u30B5\u30DD\u30FC\u30C8)
jvm.ServerClasspath=\u30B5\u30FC\u30D0\u30FC\u30FB\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9:
jvm.ServerClasspathHelp=GlassFish Server\u306E\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9(v3\u3067\u306F\u672A\u30B5\u30DD\u30FC\u30C8)
jvm.ClasspathPrefix=\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306E\u63A5\u982D\u8F9E:
jvm.ClasspathPrefixHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306E\u5148\u982D\u306B\u8FFD\u52A0\u3059\u308B(v3\u3067\u306F\u672A\u30B5\u30DD\u30FC\u30C8)
jvm.ClasspathSuffix=\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306E\u63A5\u5C3E\u8F9E:
jvm.ClasspathSuffixHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9\u306B\u8FFD\u52A0\u3059\u308B(v3\u3067\u306F\u672A\u30B5\u30DD\u30FC\u30C8)
jvm.NativeLibraryPathPrefix=\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9\u306E\u63A5\u982D\u8F9E:
jvm.NativeLibraryPathPrefixHelp=\u4EEE\u60F3\u30DE\u30B7\u30F3\u3068\u30B5\u30FC\u30D0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9\u306E\u524D\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059
jvm.NativeLibraryPathSuffix=\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9\u306E\u63A5\u5C3E\u8F9E:
jvm.NativeLibraryPathSuffixHelp=\u4EEE\u60F3\u30DE\u30B7\u30F3\u3068\u30B5\u30FC\u30D0\u30FC\u306B\u95A2\u9023\u3059\u308B\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9\u306E\u5F8C\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3059

jvm.JvmSettings=JVM\u8A2D\u5B9A
jvm.PathSettings=\u30D1\u30B9\u8A2D\u5B9A
jvm.PathSettingsTab=\u300C\u30D1\u30B9\u8A2D\u5B9A\u300D\u30BF\u30D6
jvm.Options=JVM\u30AA\u30D7\u30B7\u30E7\u30F3
jvm.OptionsTab=\u300CJVM\u30AA\u30D7\u30B7\u30E7\u30F3\u300D\u30BF\u30D6
jvm.Profiler=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9
jvm.ProfilerTab=\u300C\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u300D\u30BF\u30D6
jvm.ProfilerName=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u540D:
jvm.Classpath=\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9:
jvm.ClasspathHelp=\u30B5\u30FC\u30D0\u30FC\u3001\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u3001\u307E\u305F\u306F\u4E21\u65B9\u306E\u5B9F\u884C\u306B\u5FC5\u9808\u306E\u30AF\u30E9\u30B9\u30FB\u30D1\u30B9
jvm.NativeLibraryPath=\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9:
jvm.NativeLibraryPathHelp=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u56FA\u6709\u306E\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E9\u30A4\u30D6\u30E9\u30EA\u30FB\u30D1\u30B9
jvm.ProfilerPageName=JVM\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u8A2D\u5B9A
jvm.ProfilerPageHelp=\u30B5\u30FC\u30C9\u30D1\u30FC\u30C6\u30A3\u88FD\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306E\u8A2D\u5B9A\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306B\u56FA\u6709\u306EJVM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u306B\u3059\u308B\u3068\u304D\u306B\u306F\u3001\u300CJVM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
jvm.ProfilerDeleted=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306F\u6B63\u5E38\u306B\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002
jvm.ProfilerCreated=\u30D7\u30ED\u30D5\u30A1\u30A4\u30E9\u306F\u6B63\u5E38\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002



#
# JVM Options
#
jvmOptions.Title=JVM\u30AA\u30D7\u30B7\u30E7\u30F3
jvmOptions.PageHelp=\u30B5\u30FC\u30D0\u30FC\u306EJVM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002\u7A7A\u767D\u3092\u542B\u3080\u5024\u306F\u4E8C\u91CD\u5F15\u7528\u7B26\u3067\u56F2\u3080\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059("<i>value string</i>")\u3002
jvmOptions.TableTitle=\u30AA\u30D7\u30B7\u30E7\u30F3
jvmOptions.AddJvmOption=JVM\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u8FFD\u52A0
msg.jvmOptionInvalid=JVM\u30AA\u30D7\u30B7\u30E7\u30F3{0}\u306F\u3001"-"\u3067\u59CB\u307E\u3063\u3066\u3044\u306A\u3044\u305F\u3081\u7121\u52B9\u3067\u3059



reg.whyRegisterList=\u6709\u7528\u306A\u53C2\u7167\u5148:<br> <ul><li>\u30B9\u30AF\u30EA\u30FC\u30F3\u30AD\u30E3\u30B9\u30C8\u3068\u30C1\u30E5\u30FC\u30C8\u30EA\u30A2\u30EB</li><li>\u30CB\u30E5\u30FC\u30B9\u3068\u30A4\u30D9\u30F3\u30C8</li><li>\u30B5\u30DD\u30FC\u30C8\u3068\u30C8\u30EC\u30FC\u30CB\u30F3\u30B0</li><li>\u305D\u306E\u4ED6
reg.sample=\u30B5\u30F3\u30D7\u30EB
reg.PageTitle=\u88FD\u54C1\u306E\u767B\u9332
reg.PageTitleHelp=<a href="https://reg.sun.com/whyregister?program=sdn" target="_blank">\u767B\u9332\u3059\u308B\u7406\u7531</a> \u30D1\u30C3\u30C1\u60C5\u5831\u3068\u30D0\u30B0\u66F4\u65B0\u3001\u30B9\u30AF\u30EA\u30FC\u30F3\u30AD\u30E3\u30B9\u30C8\u3068\u30C1\u30E5\u30FC\u30C8\u30EA\u30A2\u30EB\u3001\u30B5\u30DD\u30FC\u30C8\u3068\u30C8\u30EC\u30FC\u30CB\u30F3\u30B0\u306A\u3069\u3092\u53D7\u3051\u53D6\u308C\u307E\u3059\u3002<br>\u88FD\u54C1\u3092\u767B\u9332\u3059\u308B\u306B\u306F\u3001Sun Online Account\u304C\u5FC5\u8981\u3067\u3059\u3002Sun Online Account\u304C\u307E\u3060\u306A\u3044\u5834\u5408\u306F\u3001\u88FD\u54C1\u306E\u767B\u9332\u6642\u306B\u30A2\u30AB\u30A6\u30F3\u30C8\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
reg.whyRegister=\u767B\u9332\u3059\u308B\u7406\u7531
reg.hasAccount=Sun Online Account\u307E\u305F\u306FSun Developer Network(SDN)Account\u3092\u3059\u3067\u306B\u6301\u3063\u3066\u3044\u307E\u3059
reg.userName=\u30E6\u30FC\u30B6\u30FC\u540D:
reg.userNameHelp=\u4F8B: <tt>Jim123</tt>\u307E\u305F\u306F<tt>jim@company.com</tt>
reg.pswd=\u30D1\u30B9\u30EF\u30FC\u30C9:
reg.resetPswdHelp=\u30E6\u30FC\u30B6\u30FC\u540D\u307E\u305F\u306F\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u304A\u5FD8\u308C\u3067\u3059\u304B\u3002<a href="https://reg.sun.com/accounthelp?goto=http%3A%2F%2Fforum.java.sun.com%2Findex.jspa" target="_blank">\u3053\u3053\u304B\u3089\u5165\u624B\u3057\u3066\u304F\u3060\u3055\u3044\u3002</a>
reg.pswdHelp=6\u6587\u5B57\u4EE5\u4E0A\u3067\u3001\u5927\u6587\u5B57\u3068\u5C0F\u6587\u5B57\u304C\u533A\u5225\u3055\u308C\u307E\u3059
reg.doNotHaveAccount=Sun\u30AA\u30F3\u30E9\u30A4\u30F3\u30FB\u30A2\u30AB\u30A6\u30F3\u30C8\u3092\u6301\u3063\u3066\u3044\u307E\u305B\u3093\u3002\u30B5\u30A4\u30F3\u30FB\u30A2\u30C3\u30D7\u3057\u307E\u3059\u3002
reg.emailAdr=\u96FB\u5B50\u30E1\u30FC\u30EB\u30FB\u30A2\u30C9\u30EC\u30B9:
reg.emailAdrHelp=\u96FB\u5B50\u30E1\u30FC\u30EB\u30FB\u30A2\u30C9\u30EC\u30B9\u304C<b>\u30E6\u30FC\u30B6\u30FC\u540D</b>\u306B\u306A\u308A\u307E\u3059
reg.retypePswd=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u518D\u5165\u529B:
reg.screenName=\u30B9\u30AF\u30EA\u30FC\u30F3\u540D:
reg.screenNameHelp=\u30B9\u30AF\u30EA\u30FC\u30F3\u540D\u306F\u3001\u30D5\u30A9\u30FC\u30E9\u30E0\u306A\u3069\u306ESun\u30B3\u30DF\u30E5\u30CB\u30C6\u30A3\u30FB\u30B5\u30A4\u30C8\u306B\u8868\u793A\u3055\u308C\u308B\u516C\u5F0F\u306E\u8B58\u5225\u540D\u3067\u3001<br>3\u304B\u308930\u6587\u5B57\u3067\u6307\u5B9A\u3057\u307E\u3059(.\u3001-\u3001_\u306F\u4F7F\u7528\u53EF\u80FD)
reg.personalInfo=\u500B\u4EBA\u60C5\u5831
reg.firstName=\u540D:
reg.lastName=\u59D3:
reg.companyName=\u4F1A\u793E:
reg.country=\u56FD/\u5730\u57DF:
reg.proxy=\u30D7\u30ED\u30AD\u30B7\u30FB\u30DB\u30B9\u30C8:
reg.proxyHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30DE\u30B7\u30F3\u306E\u30D7\u30ED\u30AD\u30B7\u30FB\u30DB\u30B9\u30C8
reg.port=\u30D7\u30ED\u30AD\u30B7\u30FB\u30DD\u30FC\u30C8:
reg.pleaseReg=\u767B\u9332\u3057\u3066\u304F\u3060\u3055\u3044
reg.yourPrivacy=\u30D7\u30E9\u30A4\u30D0\u30B7\u306B\u3064\u3044\u3066
reg.privacy=Sun Microsystems,Inc.\u306F\u304A\u5BA2\u69D8\u306E\u30D7\u30E9\u30A4\u30D0\u30B7\u3092\u5C0A\u91CD\u3057\u307E\u3059\u3002\u3053\u306E\u30D5\u30A9\u30FC\u30E0\u3088\u308A\u3054\u8A18\u5165\u3044\u305F\u3060\u3044\u305F\u304A\u5BA2\u69D8\u306E\u500B\u4EBA\u60C5\u5831\u306F\u3001Sun\u304C\u59D4\u8A17\u3057\u3066\u30C7\u30FC\u30BF\u3092\u51E6\u7406\u3059\u308B\u59D4\u8A17\u696D\u8005\u3092\u9664\u304D\u3001\u304A\u5BA2\u69D8\u306E\u540C\u610F\u306A\u3057\u306B\u3044\u304B\u306A\u308B\u7B2C\u4E09\u8005\u3068\u3082\u5171\u6709\u3055\u308C\u307E\u305B\u3093\u3002
reg.privacy2=\u3054\u4E0D\u660E\u306A\u70B9\u304C\u3042\u308B\u5834\u5408\u306F\u3001\u300C<a href="http://www.sun.com/privacy" target="_blank">Sun\u30D7\u30E9\u30A4\u30D0\u30B7\u30FB\u30DD\u30EA\u30B7\u30FC</a>\u300D\u3092\u53C2\u7167\u3059\u308B\u304B\u3001<a href="mailto:privacy@sun.com">privacy@Sun.com</a>\u306B\u304A\u554F\u3044\u5408\u305B\u304F\u3060\u3055\u3044\u3002
reg.agree=\u300C\u767B\u9332\u3059\u308B\u300D\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001<a href="http://www.sun.com/termsofuse.jsp" target="_blank">Sun Online Account\u5229\u7528\u898F\u7D04</a>\u306B\u540C\u610F\u3057\u305F\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002</a>
reg.error.noRegService=\u767B\u9332\u30B5\u30FC\u30D3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u3067\u30A8\u30E9\u30FC\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002


support.PageTitle=GlassFish\u30CB\u30E5\u30FC\u30B9
support.PageTitleHelp=
support.techDays=Tech Days\u767B\u9332\u66F4\u65B0\u60C5\u5831
support.techDaysDesc=\u5B9F\u7528\u7684\u306A\u60C5\u5831\u3001\u30BD\u30EA\u30E5\u30FC\u30B7\u30E7\u30F3\u4E8B\u4F8B\u304A\u3088\u3073\u30CF\u30F3\u30BA\u30AA\u30F3\u30FB\u30C8\u30EC\u30FC\u30CB\u30F3\u30B0\u3092\u5165\u624B\u3067\u304D\u307E\u3059\u3002\u5404\u90FD\u5E02\u306E<a href="http://developers.sun.com/events/techdays/blogs.jsp" target="_blank">\u30D6\u30ED\u30B0\u30FB\u30EC\u30DD\u30FC\u30C8</a>\u3092\u8AAD\u3080\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
support.newsBlogs=\u30CB\u30E5\u30FC\u30B9/\u30D6\u30ED\u30B0
support.events=\u30A4\u30D9\u30F3\u30C8
support.techTips=\u30C6\u30AF\u30CB\u30AB\u30EB\u30FB\u30D2\u30F3\u30C8
support.sunDevNews=Sun\u958B\u767A\u8005\u5411\u3051\u30CB\u30E5\u30FC\u30B9
support.moreDevEvents=\u305D\u306E\u4ED6\u306E\u958B\u767A\u8005\u5411\u3051\u30A4\u30D9\u30F3\u30C8...
support.moreTechTips=\u305D\u306E\u4ED6\u306E\u6280\u8853\u8A18\u4E8B\u304A\u3088\u3073\u30D2\u30F3\u30C8...
support.moreIssues=\u5148\u9031\u306E\u4FEE\u6B63\u3055\u308C\u305F\u554F\u984C\u3092\u3059\u3079\u3066\u8868\u793A
support.morePodCast=\u305D\u306E\u4ED6\u306EGlassFish\u30DD\u30C3\u30C9\u30AD\u30E3\u30B9\u30C8...
support.moreDeveloperNews=\u305D\u306E\u4ED6\u306E\u958B\u767A\u8005\u5411\u3051\u30CB\u30E5\u30FC\u30B9...
support.moreEnterpriseArticles=\u305D\u306E\u4ED6\u306E\u4F01\u696D\u5411\u3051Java\u306E\u8A18\u4E8B...
support.javeEENewsAndArticles=Java EE\u30CB\u30E5\u30FC\u30B9\u3068\u8A18\u4E8B...
support.moreStories=\u305D\u306E\u4ED6\u306E\u53C2\u7167\u5148...
support.moreAquarium=Aquarium\u304B\u3089\u306E\u305D\u306E\u4ED6\u306E\u60C5\u5831...
support.learning=\u5B66\u7FD2/\u53C2\u7167
support.podcast=GlassFish\u30DD\u30C3\u30C9\u30AD\u30E3\u30B9\u30C8
support.service=\u30B5\u30FC\u30D3\u30B9\u3068\u30B5\u30DD\u30FC\u30C8
support.coreTechTips=\u30B3\u30A2Java\u306E\u30C6\u30AF\u30CB\u30AB\u30EB\u30FB\u30D2\u30F3\u30C8
support.entTechTips=\u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BAJava\u306E\u30C6\u30AF\u30CB\u30AB\u30EB\u30FB\u30D2\u30F3\u30C8
support.gfIssues=GlassFish\u306E\u554F\u984C
support.bugList=\u5148\u9031\u4FEE\u6B63\u3055\u308C\u305F\u30D0\u30B0\u306E\u30EA\u30B9\u30C8
support.supportAndService=GlassFish Server\u306E\u30B5\u30DD\u30FC\u30C8\u3068\u30B5\u30FC\u30D3\u30B9
support.s1=\u67D4\u8EDF\u6027\u3068\u30B5\u30DD\u30FC\u30C8\u304C\u5168\u4E16\u754C\u306724\u6642\u9593365\u65E5\u624B\u306B\u5165\u308A\u307E\u3059\u3002Sun\u306E\u5145\u5B9F\u3057\u305F\u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BA\u30FB\u30B5\u30DD\u30FC\u30C8\u3092\u3044\u3064\u3067\u3082\u5FC5\u8981\u306A\u3068\u304D\u306B\u3054\u5229\u7528\u304F\u3060\u3055\u3044\u3002
support.training=\u30C8\u30EC\u30FC\u30CB\u30F3\u30B0\u3068\u8A8D\u5B9A\u8CC7\u683C
support.t1=\u30D7\u30ED\u30B0\u30E9\u30DE\u3084\u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BA\u30FB\u30A2\u30FC\u30AD\u30C6\u30AF\u30C8\u5411\u3051\u306E\u30C8\u30EC\u30FC\u30CB\u30F3\u30B0\u3084\u5404\u7A2ESun\u8A8D\u5B9A\u8CC7\u683C\u30B3\u30FC\u30B9\u3001\u6E96\u5099\u65B9\u6CD5\u3001\u304A\u3088\u3073\u30AD\u30E3\u30F3\u30DA\u30FC\u30F3\u30FB\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u3064\u3044\u3066\u78BA\u8A8D\u3057\u307E\u3059\u3002
support.devSupportService=\u958B\u767A\u8005\u30B5\u30DD\u30FC\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9
support.d1=Sun\u306E\u958B\u767A\u8005\u5411\u3051\u30B5\u30DD\u30FC\u30C8\u30FB\u30B5\u30FC\u30D3\u30B9\u306F\u3001\u30CF\u30A6\u30C4\u30FC\u306B\u95A2\u3059\u308B\u30D8\u30EB\u30D7\u3001\u88FD\u54C1\u30B5\u30DD\u30FC\u30C8\u3001\u304A\u3088\u3073\u30AB\u30B9\u30BF\u30E0\u30FB\u30BD\u30EA\u30E5\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
support.forum=GlassFish\u30D5\u30A9\u30FC\u30E9\u30E0
support.forum1=\u30D5\u30A9\u30FC\u30E9\u30E0\u306E\u76EE\u7684\u306F\u3001Java EE SDK\u306E\u6700\u65B0\u7248\u306E\u30B3\u30DF\u30E5\u30CB\u30C6\u30A3\u958B\u767A\u3067\u3042\u308BGlassFish\u30D7\u30ED\u30B8\u30A7\u30AF\u30C8\u306B\u3064\u3044\u3066\u8B70\u8AD6\u3059\u308B\u3053\u3068\u3067\u3059\u3002
support.issueTracker=GlassFish\u306E\u554F\u984C\u306E\u30C8\u30E9\u30C3\u30AB
support.issueTracker1=\u554F\u984C\u3084\u6B20\u9665\u3092\u691C\u7D22\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u5177\u4F53\u7684\u306A\u554F\u984C\u3092\u5831\u544A\u3057\u307E\u3059\u3002
support.adoption=\u63A1\u7528\u4E8B\u4F8B
support.GlassFishBusiness=\u30D3\u30B8\u30CD\u30B9\u5411\u3051GlassFish
support.moreBusiness=\u305D\u306E\u4ED6\u306E\u30D3\u30B8\u30CD\u30B9\u30FB\u30CB\u30E5\u30FC\u30B9...

# the following links is used in the support page.  If there is localized site for these link, replace them.
# otherwise, leave it as is.
support.aquariumLink=http://blogs.sun.com/theaquarium/
support.eventsLink=http://developers.sun.com/events/
support.tipsLink=http://java.sun.com/developer/TechTips/
support.javaeeLink=http://java.sun.com/javaee
support.devNewsLink=http://blogs.sun.com/SDNProgramNews/
support.businessLink=http://blogs.sun.com/GlassFishForBusiness/
support.appServerSubscriptionLink=http://www.sun.com/service/applicationserversubscriptions/
support.trainingLink=http://java.sun.com/javaee/support/training/
support.devSupportLink=http://java.sun.com/javaee/support/
support.forumLink=http://forums.java.net/jive/forum.jspa?forumID=56&start=0
support.issueLink=https://glassfish.dev.java.net/issues/query.cgi
support.storyLink=http://blogs.sun.com/stories/
support.podcastLink=http://blogs.sun.com/glassfishpodcast/


## Monitoring
monitoring.webContainer.PageHelp=\u300C<a href="#{request.contextPath}/common/monitor/monitoringPage.jsf?configName=#{pageSession.configName}">\u30E2\u30CB\u30BF\u30FC\u306E\u69CB\u6210</a>\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u300C\u4F4E\u300D\u307E\u305F\u306F\u300C\u9AD8\u300D\u306E\u3044\u305A\u308C\u304B\u3092\u9078\u629E\u3057\u3066\u3001\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u307E\u305F\u306F\u30B5\u30FC\u30D3\u30B9\u306E\u30E2\u30CB\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u8A73\u7D30\u306F<a href="#{request.contextPath}/common/help/help.jsf?contextRef=/resource/#{pluginId}#{olhLink}" onclick="admingui.help.launchHelp(this);return false;" target="help_window" title="\u65B0\u898F\u30BF\u30D6\u307E\u305F\u306F\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u30AA\u30F3\u30E9\u30A4\u30F3\u30FB\u30D8\u30EB\u30D7\u3092\u8868\u793A">\u30AA\u30F3\u30E9\u30A4\u30F3\u30FB\u30D8\u30EB\u30D7</a>\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
## for the following translation, the word "OFF", "LOW" and "HIGH", please match the translated strings as above.
monitoring.PageHelp=\u300C\u4F4E\u300D\u307E\u305F\u306F\u300C\u9AD8\u300D\u3092\u9078\u629E\u3057\u3066\u3001\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u307E\u305F\u306F\u30B5\u30FC\u30D3\u30B9\u306E\u30E2\u30CB\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30E2\u30CB\u30BF\u30FC\u6A5F\u80FD\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001\u300C\u30E2\u30CB\u30BF\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9\u300D\u3068\u300C\u30E2\u30CB\u30BF\u30FCMBean\u300D\u306E\u4E21\u65B9\u3092\u6709\u52B9\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
## for the following translation, the word "OFF", "LOW" and "HIGH", please match the translated strings as above.
monitoring.webContainer.disableMonitoringMsg=\u3059\u3079\u3066\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30E2\u30CB\u30BF\u30FC\u30FB\u30EC\u30D9\u30EB\u304COFF\u3067\u3059\u3002\u4F7F\u7528\u3067\u304D\u308B\u7D71\u8A08\u304C\u3042\u308A\u307E\u305B\u3093\u3002


monitoring.Title=\u30E2\u30CB\u30BF\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9
tree.monitorData=\u30E2\u30CB\u30BF\u30FC\u30FB\u30C7\u30FC\u30BF
monitoring=\u30E2\u30CB\u30BF\u30FC
monitoringTab=\u300C\u30E2\u30CB\u30BF\u30FC\u300D\u30BF\u30D6
monitoring.webContainer.NoStats=\u4F7F\u7528\u3067\u304D\u308B\u7D71\u8A08\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u30E2\u30CB\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3059\u308B\u3088\u3046\u306B\u69CB\u6210\u3057\u307E\u3059\u3002
monitoring.webContainer.instanceNotRunningMsg=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u4F7F\u7528\u3067\u304D\u308B\u7D71\u8A08\u304C\u3042\u308A\u307E\u305B\u3093\u3002
webContainer=Web\u30B3\u30F3\u30C6\u30CA
httpService=HTTP\u30B5\u30FC\u30D3\u30B9
jvm=JVM
server=\u30B5\u30FC\u30D0\u30FC
serverTab=\u300C\u30B5\u30FC\u30D0\u30FC\u300D\u30BF\u30D6
resources=\u30EA\u30BD\u30FC\u30B9
resourcesTab=\u300C\u30EA\u30BD\u30FC\u30B9\u300D\u30BF\u30D6
resources.addResources=\u30EA\u30BD\u30FC\u30B9\u306E\u8FFD\u52A0
resources.addResourcesPageTitleHelp=\u9078\u629E\u3057\u305F\u3059\u3079\u3066\u306E\u30BF\u30FC\u30B2\u30C3\u30C8\u306B\u5BFE\u3057\u3066\u3001\u30D5\u30A1\u30A4\u30EB\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u30EA\u30BD\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
resources.addResources.target=\u30BF\u30FC\u30B2\u30C3\u30C8:
resources.addResources.targetHelp=\u30C9\u30ED\u30C3\u30D7\u30C0\u30A6\u30F3\u30FB\u30EA\u30B9\u30C8\u304B\u3089\u30BF\u30FC\u30B2\u30C3\u30C8\u3092\u9078\u629E\u3057\u307E\u3059\u3002
resources.addResources.chooseLocalXmlFile=GlassFish Server\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u306A\u30ED\u30FC\u30AB\u30EBXML\u30D5\u30A1\u30A4\u30EB
resources.addResources.chooseXmlUploadFile=\u30B5\u30FC\u30D0\u30FC\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3055\u308C\u308BXML\u30D5\u30A1\u30A4\u30EB
resources.addResources.successfulMsg=\u30EA\u30BD\u30FC\u30B9\u304C\u6B63\u5E38\u306B\u8FFD\u52A0\u3055\u308C\u307E\u3057\u305F\u3002
appMonitor=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30E2\u30CB\u30BF\u30FC
serverMonitor=\u30B5\u30FC\u30D0\u30FC\u306E\u30E2\u30CB\u30BF\u30FC
resourcesMonitor=\u30EA\u30BD\u30FC\u30B9\u306E\u30E2\u30CB\u30BF\u30FC
monitoring.connectionPool=\u63A5\u7D9A\u30D7\u30FC\u30EB
monitoring.resource=\u30EA\u30BD\u30FC\u30B9
monitoring.application=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
monitoring.webContainer.pageTitle=Web\u30B3\u30F3\u30C6\u30CA\u306E\u30E2\u30CB\u30BF\u30FC
monitoring.httpService.pageTitle=HTTP\u30B5\u30FC\u30D3\u30B9\u306E\u30E2\u30CB\u30BF\u30FC
monitoring.jvm.pageTitle=JVM\u30E2\u30CB\u30BF\u30FC
monitoring.requestStatistics=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u7D71\u8A08
monitoring.sessionStatistics=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u7D71\u8A08
monitoring.servletStatistics=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u7D71\u8A08
monitoring.jspStatistics=JSP\u306E\u7D71\u8A08
monitoring.requestStatisticsHttp=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u7D71\u8A08
monitoring.requestStatisticsWeb=Web\u30B3\u30F3\u30C6\u30CA: \u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u7D71\u8A08
monitoring.sessionStatisticsWeb=Web\u30B3\u30F3\u30C6\u30CA: \u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u7D71\u8A08
monitoring.servletStatisticsWeb=Web\u30B3\u30F3\u30C6\u30CA: \u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u7D71\u8A08
monitoring.jspStatisticsWeb=Web\u30B3\u30F3\u30C6\u30CA: JSP\u306E\u7D71\u8A08
monitoring.jRubyStatisticsHttp=JRuby: HTTP\u30B5\u30FC\u30D3\u30B9\u306E\u7D71\u8A08
monitoring.jRubyStatisticsRuntime=JRuby: \u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u7D71\u8A08
monitoring.jRubyStatistics=JRuby\u306E\u7D71\u8A08
monitoring.jRubyProbeStatistics=JRuby: \u30B3\u30F3\u30C6\u30CA\u306E\u7D71\u8A08
monitoring.WorkManagement=\u4F5C\u696D\u7BA1\u7406
monitoring.WorkManagementStats=\u4F5C\u696D\u7BA1\u7406\u306E\u7D71\u8A08
monitoring.Connector=\u4F5C\u696D\u7BA1\u7406

#this is the link that user can click on to view the statistics
monitoring.View=\u8868\u793A

monitoring.Login=\u30ED\u30B0\u30A4\u30F3
monitoring.LoginStats=\u30ED\u30B0\u30A4\u30F3\u306E\u7D71\u8A08
monitoring.ConnectionQueueStatistics=\u63A5\u7D9A\u30AD\u30E5\u30FC\u306E\u7D71\u8A08
monitoring.ThreadPoolStatistics=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u306E\u7D71\u8A08
monitoring.VirtualServer=\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC
monitoring.NetworkListener=\u30EA\u30B9\u30CA\u30FC
monitoring.FileCacheStats=\u30D5\u30A1\u30A4\u30EB\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u7D71\u8A08
monitoring.KeepAliveStats=\u30AD\u30FC\u30D7\u30A2\u30E9\u30A4\u30D6\u306E\u7D71\u8A08
monitoring.ConnectionQueueStats=\u63A5\u7D9A\u30AD\u30E5\u30FC\u306E\u7D71\u8A08
monitoring.ConnectionsStats=\u63A5\u7D9A\u30DE\u30CD\u30FC\u30B8\u30E3\u306E\u7D71\u8A08
monitoring.jAppStatistics=Jersey\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u7D71\u8A08
monitoring.jGlobalStatistics=Jersey\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u306A\u7D71\u8A08
monitoring.HTTPListener=HTTP\u30EA\u30B9\u30CA\u30FC
monitoring.jvmStatistics= JVM\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u72B6\u6CC1(\u30D0\u30A4\u30C8)
monitoring.jvm.init.tooltip=\u8D77\u52D5\u6642\u306E\u30E1\u30E2\u30EA\u30FC\u7BA1\u7406\u306E\u305F\u3081\u306BJVM\u304COS\u304B\u3089\u30EA\u30AF\u30A8\u30B9\u30C8\u3059\u308B\u521D\u671F\u30E1\u30E2\u30EA\u30FC
monitoring.jvm.used.tooltip=\u73FE\u5728\u4F7F\u7528\u4E2D\u306E\u30E1\u30E2\u30EA\u30FC\u91CF
monitoring.jvm.committed.tooltip=JVM\u3067\u306E\u4F7F\u7528\u304C\u4FDD\u8A3C\u3055\u308C\u3066\u3044\u308B\u30E1\u30E2\u30EA\u30FC\u91CF
monitoring.jvm.max.tooltip=\u30E1\u30E2\u30EA\u30FC\u7BA1\u7406\u306B\u4F7F\u7528\u3067\u304D\u308B\u30E1\u30E2\u30EA\u30FC\u306E\u6700\u5927\u91CF
monitoring.jvm.classLoadingJvm=JVM: \u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306E\u7D71\u8A08
monitoring.jvm.classLoading=\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9
monitoring.jvm.compilation=\u30B3\u30F3\u30D1\u30A4\u30EB
monitoring.jvm.compilationJvm=JVM: \u30B3\u30F3\u30D1\u30A4\u30EB\u306E\u7D71\u8A08
monitoring.jvm.garbageCollectorsStats=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u306E\u7D71\u8A08
monitoring.jvm.garbageCollectors=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF
monitoring.jvm.garbageCollectorsJvm=JVM: \u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u306E\u7D71\u8A08
monitoring.jvm.operatingSystemJvm=JVM: \u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0\u306E\u7D71\u8A08
monitoring.jvm.operatingSystem=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0
monitoring.jvm.memory=\u30E1\u30E2\u30EA\u30FC(\u30D0\u30A4\u30C8)
monitoring.jvm.memoryJvm=JVM: \u30E1\u30E2\u30EA\u30FC\u306E\u7D71\u8A08 
monitoring.jvm.runtime=\u30E9\u30F3\u30BF\u30A4\u30E0
monitoring.jvm.runtimeJvm=JVM: \u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u7D71\u8A08
monitoring.realm=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30EC\u30EB\u30E0\u306E\u7D71\u8A08
monitoring.ConnectionManagers=\u63A5\u7D9A\u30DE\u30CD\u30FC\u30B8\u30E3\u306E\u7D71\u8A08
monitoring.ThreadPools=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u306E\u7D71\u8A08
monitoring.ORB=ORB\u306E\u7D71\u8A08
monitoring.ThreadSystem=JVM: \u30B9\u30EC\u30C3\u30C9\u30FB\u30B7\u30B9\u30C6\u30E0\u306E\u7D71\u8A08
monitoring.ThreadInfo=\u30B9\u30EC\u30C3\u30C9\u60C5\u5831\u306E\u7D71\u8A08
monitoring.EJB=EJB\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u7D71\u8A08
monitoring.EJBMethod=EJB\u30E1\u30BD\u30C3\u30C9\u306E\u7D71\u8A08
monitoring.EJBPool=EJB\u30D7\u30FC\u30EB\u306E\u7D71\u8A08
monitoring.EJBCache=EJB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u7D71\u8A08
monitoring.EJBTimer=EJB\u30BF\u30A4\u30DE\u30FC\u306E\u7D71\u8A08
monitoring.AppScopedResource=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u5BFE\u8C61\u7BC4\u56F2\u3068\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u7D71\u8A08
monitoring.virtualServerStatistics=\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u7D71\u8A08
monitoring.JDBC=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u7D71\u8A08
monitoring.ConnectorConnectionPool=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u7D71\u8A08
monitoring.webSecurity=Web\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8
monitoring.webSecurityStats=Web\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u7D71\u8A08
monitoring.transaction=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D3\u30B9\u306E\u7D71\u8A08
monitoring.ejb=EJB\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u306E\u7D71\u8A08
monitoring.webServicesStats=Web\u30B5\u30FC\u30D3\u30B9\u306E\u7D71\u8A08
monitoring.deployLifeCycleStats=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30E9\u30A4\u30D5\u30B5\u30A4\u30AF\u30EB\u306E\u7D71\u8A08
monitoring.startTimeCol=\u958B\u59CB\u6642\u9593
monitoring.lastTimeCol=\u6700\u7D42\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u6642\u9593
monitoring.DetailsCol=\u8A73\u7D30
monitoring.DescCol=\u8AAC\u660E
monitoring.runTimesCol=\u30E9\u30F3\u30BF\u30A4\u30E0
monitoring.ThresholdsCol=\u3057\u304D\u3044\u5024
monitoring.queueSizeCol=\u30AD\u30E5\u30FC\u30FB\u30B5\u30A4\u30BA
monitoring.MaxTime=\u6700\u5927\u6642\u9593
monitoring.MinTime=\u6700\u5C0F\u6642\u9593
monitoring.Level=\u30EC\u30D9\u30EB:
monitoring.DTrace=DTrace:
monitoring.DTraceHelp=Solaris(TM) DTrace\u30C4\u30FC\u30EB\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002\u3053\u306E\u30C4\u30FC\u30EB\u306FOracle GlassFish Server DTrace Monitoring\u3067\u4F7F\u7528\u3067\u304D\u307E\u3059
monitoring.statistics=\u7D71\u8A08
monitoring.Http=HTTP\u30B5\u30FC\u30D3\u30B9:
monitoring.Web=Web\u30B3\u30F3\u30C6\u30CA:
monitoring.Jvm=JVM:
monitoring.ThreadPool=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB:

monitoring.Low=\u4F4E
monitoring.High=\u9AD8
monitoring.Off=\u30AA\u30D5

monitoring.MonitorCompNameCol=\u30E2\u30B8\u30E5\u30FC\u30EB
monitoring.MonitorCompLevelCol=\u30E2\u30CB\u30BF\u30FC\u30FB\u30EC\u30D9\u30EB
monitoring.MonitorLevelTableTitle=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u30FB\u30EC\u30D9\u30EB\u306E\u8A2D\u5B9A
monitoring.monService=\u30E2\u30CB\u30BF\u30FC\u30FB\u30B5\u30FC\u30D3\u30B9:
monitoring.monServiceHelp=GlassFish Server\u306E\u30E2\u30CB\u30BF\u30FC\u306E\u6709\u52B9\u5316
monitoring.monMbeans=\u30E2\u30CB\u30BF\u30FCMBean:
monitoring.monMbeansHelp=\u30E2\u30CB\u30BF\u30FC\u306B\u5FC5\u8981\u306A\u3059\u3079\u3066\u306EMBean\u306E\u30C7\u30D7\u30ED\u30A4
monitoringInfo.pageHelp=GlassFish Server\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30E2\u30CB\u30BF\u30FC\u60C5\u5831\u3092\u8868\u793A\u304A\u3088\u3073\u7BA1\u7406\u3057\u307E\u3059\u3002

#monitoring Service page, Module  name
monitoring.module.Jvm=Jvm
monitoring.module.Http=HTTP\u30B5\u30FC\u30D3\u30B9
monitoring.module.TransactionService=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D3\u30B9
monitoring.module.JmsConnector=JMS/\u30B3\u30CD\u30AF\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
monitoring.module.Orb=ORB (Object Request Broker)
monitoring.module.Web=Web\u30B3\u30F3\u30C6\u30CA
monitoring.module.Ejb=EJB\u30B3\u30F3\u30C6\u30CA
monitoring.module.Jdbc=JDBC\u63A5\u7D9A\u30D7\u30FC\u30EB
monitoring.module.Connector=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB
monitoring.module.ConnectorService=\u30B3\u30CD\u30AF\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
monitoring.module.JmsService=JMS\u30B5\u30FC\u30D3\u30B9
monitoring.module.WebServices=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30B3\u30F3\u30C6\u30CA
monitoring.module.Jpa=Java\u6C38\u7D9A\u6027
monitoring.module.Security=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3
monitoring.module.Jersey=Jersey (RESTful Web\u30B5\u30FC\u30D3\u30B9)
monitoring.module.ThreadPool=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB
monitoring.module.Deployment=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8


tree.monitoring=\u30E2\u30CB\u30BF\u30FC
tree.monitoring.tooltip=\u30E2\u30B8\u30E5\u30FC\u30EB\u30FB\u30E2\u30CB\u30BF\u30FC\u30FB\u30EC\u30D9\u30EB

monitoring.servletInstanceStatistics=\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u7D71\u8A08
monitoring.Sfull=EJB\u30B9\u30C6\u30FC\u30C8\u30D5\u30EB\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3Bean\u306E\u7D71\u8A08
monitoring.Sless=EJB\u30B9\u30C6\u30FC\u30C8\u30EC\u30B9\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3Bean\u306E\u7D71\u8A08
monitoring.Component=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8
monitoring.Application=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
monitoring.MDB=EJB\u30E1\u30C3\u30BB\u30FC\u30B8\u30C9\u30EA\u30D6\u30F3Bean\u306E\u7D71\u8A08
monitoring.ORBInStatistics=ORB\u30A4\u30F3\u30D0\u30A6\u30F3\u30C9\u306E\u7D71\u8A08
monitoring.ORBOutStatistics=ORB\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u306E\u7D71\u8A08
monitoring.EntityBean=EJB\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3Bean\u306E\u7D71\u8A08
monitoring.SingletonBean=EJB\u30B7\u30F3\u30B0\u30EB\u30C8\u30F3Bean\u306E\u7D71\u8A08
monitoring.jmsStats=JMS\u30B5\u30FC\u30D3\u30B9\u306E\u7D71\u8A08

endpoint.PageTitle=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u60C5\u5831
endpoint.PageTitleHelp=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A73\u7D30\u3092\u8868\u793A\u3057\u307E\u3059\u3002
endpoint.appName=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540D:
endpoint.endpointName=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u540D:
endpoint.address=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u30FB\u30A2\u30C9\u30EC\u30B9URI:
endpoint.deploymentType=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7:
endpoint.description=\u8AAC\u660E:
endpoint.implClass=\u5B9F\u88C5\u30AF\u30E9\u30B9\u540D:
endpoint.implType=\u5B9F\u88C5\u30BF\u30A4\u30D7:
endpoint.name=\u540D\u524D:
endpoint.namespace=\u540D\u524D\u7A7A\u9593:
endpoint.portName=\u30DD\u30FC\u30C8\u540D:
endpoint.serviceName=\u30B5\u30FC\u30D3\u30B9\u540D:
endpoint.tester=\u30C6\u30B9\u30BF\u30FC:
endpoint.wsdl=WSDL:
endpoint.viewWsdl=WSDL\u306E\u8868\u793A
endpoint.testButton=\u30C6\u30B9\u30C8

appClientLaunch.PageTitleHelp=\u30B5\u30FC\u30D0\u30FC\u307E\u305F\u306F\u30EA\u30B9\u30CA\u30FC\u304C\u7A3C\u50CD\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30EA\u30F3\u30AF\u306F\u6A5F\u80FD\u3057\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
appClientLaunch.PageTitle=\u300C\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8D77\u52D5\u300D\u30DA\u30FC\u30B8
appClientLaunch.application=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3:
appClientLaunch.module=\u30E2\u30B8\u30E5\u30FC\u30EB:
appClientLaunch.linkLabel=\u30EA\u30F3\u30AF:
appClientLaunch.argLabel=\u5F15\u6570:
appClientLaunch.argHelp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u8D77\u52D5\u3059\u308B\u305F\u3081\u306BURL\u306B\u8FFD\u52A0\u3059\u308B\u5F15\u6570\u3002\u4F8B: <tt>arg=first&arg=second</tt>



# Domain Attrs
#

domain.DomainAttrsPageTitle=\u30C9\u30E1\u30A4\u30F3\u5C5E\u6027
domain.DomainAttrsPageTitleHelp=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u306B\u30AB\u30B9\u30BF\u30E0\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306B\u30C9\u30E1\u30A4\u30F3\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u5C5E\u6027\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002

domain.AppsConfigPageTitle=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u69CB\u6210
domain.AppsConfigPageHelp=\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u52A0\u3048\u3089\u308C\u305F\u5909\u66F4\u306E\u691C\u51FA\u3068\u3001\u5909\u66F4\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u518D\u30ED\u30FC\u30C9\u304C\u884C\u308F\u308C\u308B\u3088\u3046\u306B\u3001\u518D\u30ED\u30FC\u30C9\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002\u307E\u305F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u6709\u52B9\u306B\u3057\u3001\u69CB\u6210\u3057\u307E\u3059\u3002\u8FFD\u52A0\u306E\u8A2D\u5B9A\u3092\u6307\u5B9A\u3059\u308B\u3068\u304D\u306F\u300C\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8FFD\u52A0\u300D\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
domain.Reload=\u518D\u30ED\u30FC\u30C9:
domain.ReloadHelp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u52D5\u7684\u518D\u30ED\u30FC\u30C9\u306E\u6709\u52B9\u5316\u3002
domain.ReloadPollInterval=\u518D\u30ED\u30FC\u30C9\u306E\u30DD\u30FC\u30EA\u30F3\u30B0\u9593\u9694:
domain.ReloadPollIntervalHelp=\u518D\u30ED\u30FC\u30C9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u78BA\u8A8D\u3059\u308B\u983B\u5EA6\u3002
domain.AdminTimeout=\u7BA1\u7406\u30BB\u30C3\u30B7\u30E7\u30F3\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
domain.AdminTimeoutHelp=<tt>0</tt>\u3092\u6307\u5B9A\u3059\u308B\u3068\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306F\u767A\u751F\u3057\u307E\u305B\u3093\u3002
domain.AutoDeploySettings=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u8A2D\u5B9A
domain.AutoDeploy=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4:
domain.AutoDeployHelp=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002
domain.AutoDeployPollInterval=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u306E\u30DD\u30FC\u30EA\u30F3\u30B0\u9593\u9694:
domain.AutoDeployPollIntervalHelp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u78BA\u8A8D\u983B\u5EA6;\u3053\u306E\u9593\u9694\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3084\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30ED\u30FC\u30C9\u6642\u9593\u306B\u5F71\u97FF\u3057\u307E\u305B\u3093\u3002
domain.AutoDeployTimeout=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u306E\u518D\u8A66\u884C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
domain.AutoDeployTimeoutHelp=\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30A4\u30BA\u306F\u5B89\u5B9A\u3057\u3066\u3044\u3066\u3082\u958B\u3051\u306A\u304F\u306A\u3063\u305F\u3068\u304D\u304B\u3089\u969C\u5BB3\u3092\u5831\u544A\u3059\u308B\u307E\u3067\u306E\u6642\u9593\u3002
domain.AutoDeployDirectory=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA:
domain.AutoDeployDirectoryHelp=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30E2\u30CB\u30BF\u30FC\u3059\u308B\u305F\u3081\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002
domain.LogRoot=\u30ED\u30B0\u30FB\u30EB\u30FC\u30C8:
domain.LogRootHelp=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30A2\u30AF\u30BB\u30B9\u3068\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u5834\u6240\u3002
domain.Verifier=\u30D9\u30EA\u30D5\u30A1\u30A4\u30A2:
domain.VerifierHelp=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u524D\u306B\u8A73\u7D30\u306A\u691C\u8A3C\u3092\u5B9F\u884C\u3057\u307E\u3059\u3002
domain.Precompile=\u30D7\u30EA\u30B3\u30F3\u30D1\u30A4\u30EB:
domain.PrecompileHelp=JSP\u3092\u30D7\u30EA\u30B3\u30F3\u30D1\u30A4\u30EB\u3057\u3001\u751F\u6210\u3055\u308C\u305F\u30AF\u30E9\u30B9\u30FB\u30D5\u30A1\u30A4\u30EB\u306E\u307F\u3092\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002
domain.AppRoot=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30EB\u30FC\u30C8:
domain.AppRootHelp=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30C7\u30D7\u30ED\u30A4\u5143\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002
domain.Locale=\u30ED\u30B1\u30FC\u30EB:
domain.LocaleHelp=OS\u306E\u30ED\u30B1\u30FC\u30EB\u8A2D\u5B9A\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
domain.AdminPasswordTitle=\u65B0\u898F\u7BA1\u7406\u8005\u30D1\u30B9\u30EF\u30FC\u30C9
domain.AdminPasswordTitleHelp=\u73FE\u5728\u306E\u7BA1\u7406\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
domain.Userid=\u30E6\u30FC\u30B6\u30FCID:
domain.GroupList=\u30B0\u30EB\u30FC\u30D7\u30FB\u30EA\u30B9\u30C8:
domain.NewPassword=\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9:
domain.ConfirmNewPassword=\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u78BA\u8A8D:
domain.Full=\u5B8C\u5168
domain.Parsing=\u89E3\u6790\u4E2D
domain.None=\u306A\u3057
domain.deployXmlValidation=XML\u691C\u8A3C:
domain.deployXmlValidationHelp=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u8A18\u8FF0\u5B50\u306E\u691C\u8A3C\u306E\u30BF\u30A4\u30D7\u3002
domain.loadOnStartup=DAS\u8D77\u52D5\u5F8C\u306B\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30ED\u30FC\u30C9:
domain.loadOnStartupHelp=\u30B5\u30FC\u30D0\u30FC\u8D77\u52D5\u5F8C\u306B\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u3067\u4F7F\u7528\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u306B\u5F71\u97FF\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u304C\u3001\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u306E\u30A2\u30AF\u30BB\u30B9\u6642\u9593\u304C\u901F\u304F\u306A\u308A\u307E\u3059\u3002
domain.loadOnStartupDefault=\u4F7F\u7528\u72B6\u6CC1\u30D9\u30FC\u30B9
domain.loadOnStartupAlways=\u5E38\u6642
domain.loadOnStartupNever=\u306A\u3057

configurations.PageTitle=\u69CB\u6210
configurations.NewPageTitle=\u65B0\u898F\u69CB\u6210
configurations.PageTitleHelp=\u69CB\u6210\u3092\u7BA1\u7406\u3057\u3066\u3001\u69CB\u6210\u3092\u4F7F\u7528\u3057\u3066\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30B5\u30FC\u30D0\u30FC\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u307E\u305F\u306F\u30AF\u30E9\u30B9\u30BF\u3092\u8868\u793A\u3057\u307E\u3059\u3002
configurations.TableTitle=\u69CB\u6210
configurations.instanceCol=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
configurations.SystemPropertiesTitle=\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3


Monitor.ApplicationsTab=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3
Monitor.ApplicationsTab.tooltip=\u300C\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u300D\u30BF\u30D6
Monitor.ResourcesTab=\u30EA\u30BD\u30FC\u30B9
Monitor.ResourcesTab.tooltip=\u300C\u30EA\u30BD\u30FC\u30B9\u300D\u30BF\u30D6
Monitor.MonitoringTab=\u30E2\u30CB\u30BF\u30FC
Monitor.MonitoringTab.tooltip=\u300C\u30E2\u30CB\u30BF\u30FC\u300D\u30BF\u30D6
GeneralTab=\u4E00\u822C
PropertiesTab=\u30D7\u30ED\u30D1\u30C6\u30A3

status.image.RUNNING=<img src="/theme/com/sun/webui/jsf/suntheme/images/alerts/ok_small.gif" alt="\u7A3C\u50CD\u4E2D" title="\u7A3C\u50CD\u4E2D"/>
status.image.NOT_RUNNING=<img src="/theme/com/sun/webui/jsf/suntheme/images/alerts/failed_small.gif" alt="\u505C\u6B62" title="\u505C\u6B62"/>
status.image.REQUIRES_RESTART=<img src="/theme/com/sun/webui/jsf/suntheme/images/alerts/degraded_small.gif" alt="\u518D\u8D77\u52D5\u304C\u5FC5\u8981" title="\u518D\u8D77\u52D5\u304C\u5FC5\u8981"/>
status.image.UNKNOWN=

status.RUNNING=\u7A3C\u50CD\u4E2D
status.REQUIRES_RESTART=\u518D\u8D77\u52D5\u304C\u5FC5\u8981
status.UNKNOWN=\u4E0D\u660E
status.NO_RESPONSE=\u30EC\u30B9\u30DD\u30F3\u30B9\u306A\u3057
status.NOT_RUNNING=\u505C\u6B62
status.STARTING=\u8D77\u52D5\u4E2D


resourcesTarget.pageTitle=\u30EA\u30BD\u30FC\u30B9
resourcesTarget.pageTitleHelp=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u65B0\u898F\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u5316\u3001\u7121\u52B9\u5316\u3001\u307E\u305F\u306F\u4F5C\u6210\u3057\u307E\u3059\u3002

jmsPhysDestinations.tab=JMS\u7269\u7406\u5B9B\u5148

## in launching web App and Web Services page
application.Links=\u30EA\u30F3\u30AF:
webServiceTestLinks.PageTitle=Web\u30B5\u30FC\u30D3\u30B9\u306E\u30C6\u30B9\u30C8\u30FB\u30EA\u30F3\u30AF
webServiceTestLinks.PageTitleHelp=\u30B5\u30FC\u30D0\u30FC\u307E\u305F\u306F\u30EA\u30B9\u30CA\u30FC\u304C\u7A3C\u50CD\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30EA\u30F3\u30AF\u304C\u6A5F\u80FD\u3057\u306A\u3044\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30C6\u30B9\u30C8\u30FB\u30D5\u30A9\u30FC\u30E0\u306E\u8D77\u52D5\u5F8C\u306B\u3053\u306E\u753B\u9762\u306B\u623B\u308B\u306B\u306F\u3001\u30D6\u30E9\u30A6\u30B6\u306E\u300C\u623B\u308B\u300D\u30DC\u30BF\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044

webServiceWsdlLinks.PageTitle=WSDL\u306E\u8868\u793A
webServiceWsdlLinks.PageTitleHelp=\u30B5\u30FC\u30D0\u30FC\u307E\u305F\u306F\u30EA\u30B9\u30CA\u30FC\u304C\u7A3C\u50CD\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30EA\u30F3\u30AF\u304C\u6A5F\u80FD\u3057\u306A\u3044\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30C6\u30B9\u30C8\u30FB\u30D5\u30A9\u30FC\u30E0\u306E\u8D77\u52D5\u5F8C\u306B\u3053\u306E\u753B\u9762\u306B\u623B\u308B\u306B\u306F\u3001\u30D6\u30E9\u30A6\u30B6\u306E\u300C\u623B\u308B\u300D\u30DC\u30BF\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044

LOG_INIT_SESSION=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB: \u30BB\u30C3\u30B7\u30E7\u30F3\u5C5E\u6027\u3092\u521D\u671F\u5316\u3057\u3066\u3044\u307E\u3059...
LOG_MSG_WARNING_NO_ADMIN_LISTENER_PORT=getDeploymentFacility: \u7BA1\u7406\u30EA\u30B9\u30CA\u30FC\u30FB\u30DD\u30FC\u30C8\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093(\u30C7\u30D5\u30A9\u30EB\u30C8\u306F4848)


## for the following LOG_xxx , do not translate 'endpoint'  'attrs', 'parent', 'attrsMap', 'longAdd'  etc.
LOG_REST_REQUEST_INFO=restRequest: endpoint={0}\nattrs={1}\nmethod={2}
LOG_REQUEST_RESULT=RestResponse.getResponse()\u306B\u3088\u308A{0}\u304C\u4E0E\u3048\u3089\u308C\u307E\u3059\u3002endpoint=''{1}''; attrs=''{2}''
LOG_UPDATE_ENTITY_FAILED=updateEntity\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002parent=''{0}''; attrs=''{1}''
LOG_BUILD_MULTI_VALUE_MAP_ERROR=\u30AD\u30FC("{0}")\u3092\u5024("{1}")\u3068\u4E00\u7DD2\u306B\u8FFD\u52A0\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
LOG_EXCEPTION_OCCURED=\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F:
LOG_SAVE_INSTANCE_WEIGHT_ERROR=saveInstanceWeight\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint=''{0}'' ; attrsMap=''{1}''
LOG_NODE_ACTION_ERROR=nodeAction\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint = ''{0}/{1}\n attrsMap={2}
LOG_CREATE_CLUSTER=createCluster\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint={0}\nattrsMap={1}
LOG_CREATE_CLUSTER_INSTANCE=\u30AF\u30E9\u30B9\u30BF{0}\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u4F5C\u6210\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint={1}\nattrsMap={2}
LOG_DELETE_INSTANCE=deleteInstance\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint={0}; attrsMap={1}
LOG_LIST_INSTANCES=listInstances\u3067\u306E\u30A8\u30E9\u30FC: \nendpoint={0}"\nattrs={1}
LOG_GET_CLUSTERNAME_FOR_INSTANCE=getClusterNameForInstance\u3067\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
LOG_ERROR_INSTANCE_ACTION=instanceAction\u3067\u306E\u30A8\u30E9\u30FC ; \nendpoint={0}; attrsMap={1}
LOG_LONGADD_ERROR=longAdd\u306E\u4F8B\u5916\u3001{0}\u3001{1}\u30010\u3092\u8FD4\u3057\u307E\u3059
LOG_IGNORE_DUP_PROP=\u7121\u8996\u3055\u308C\u305F\u91CD\u8907\u30D7\u30ED\u30D1\u30C6\u30A3\u540D: {0}
log.successfullyUploadedTmp=\u4E00\u6642\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u306B\u6210\u529F:
log.writeToTmpFile=\u4E00\u6642\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u3093\u3067\u3044\u307E\u3059...
log.afterWriteToTmpFile=\u4E00\u6642\u30D5\u30A1\u30A4\u30EB\u3078\u306E\u66F8\u8FBC\u307F\u5F8C...
log.inUploadFileToTmpDir=upLoadFileToTempDir\u5185


pswdAlias.tab=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9
pswdAlias.tabTip=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9
pswdAliases.title=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9
pswdAliases.titleHelp=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u306B\u3088\u308A\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u6697\u53F7\u5316\u3055\u308C\u305F\u5F62\u5F0F\u3067\u30C9\u30E1\u30A4\u30F3\u306E\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u683C\u7D0D\u3055\u308C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u304B\u308F\u308A\u306B\u4F7F\u7528\u3059\u308B\u30AF\u30EA\u30A2\u30C6\u30AD\u30B9\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u304C\u63D0\u4F9B\u3055\u308C\u307E\u3059\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30D5\u30A1\u30A4\u30EB\u3068\u30C9\u30E1\u30A4\u30F3\u69CB\u6210\u30D5\u30A1\u30A4\u30EB\u3067\u306F\u3001${alias=<i>alias-name</i>}\u306E\u5F62\u5F0F\u3092\u4F7F\u7528\u3057\u3066\u6697\u53F7\u5316\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u53C2\u7167\u3057\u307E\u3059\u3002
pswdAliasNew.title=\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9
pswdAliasNew.titleHelp=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6697\u53F7\u5316\u3055\u308C\u305F\u5F62\u5F0F\u3067\u30C9\u30E1\u30A4\u30F3\u306E\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u683C\u7D0D\u3059\u308B\u305F\u3081\u306E\u65B0\u898F\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
pswdAlias.aliasName=\u30A8\u30A4\u30EA\u30A2\u30B9\u540D:
pswdAlias.aliasNameHelp=\u30C9\u30E1\u30A4\u30F3\u5185\u306E\u3059\u3079\u3066\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u4E2D\u3067\u4E00\u610F\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
pswdAlias.password=\u30D1\u30B9\u30EF\u30FC\u30C9:
pswdAlias.passwordHelp=\u6697\u53F7\u5316\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9
pswdAlias.confirmPassword=\u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u78BA\u8A8D:
pswdAlias.confirmPasswordHelp=\u6697\u53F7\u5316\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u6B63\u3057\u304F\u5165\u529B\u3055\u308C\u305F\u3053\u3068\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306B\u6BD4\u8F03\u3055\u308C\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
pswdAliasEdit.title=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u7DE8\u96C6
pswdAliasEdit.titleHelp=\u65E2\u5B58\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
pswdAliases.tableTitle=\u30D1\u30B9\u30EF\u30FC\u30C9\u30FB\u30A8\u30A4\u30EA\u30A2\u30B9
pswdAlias.nameCol=\u30A8\u30A4\u30EA\u30A2\u30B9\u540D

instanceProperties.PropertiesTitle=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3
instanceProperties.SystemPropertiesTitle=\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3

#Recover Transactions
recoverTransactionsTitle=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30EA\u30AB\u30D0\u30EA
recoverTransactionsTitleHelp=\u672A\u5B8C\u4E86\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30EA\u30AB\u30D0\u30EA\u3057\u307E\u3059\u3002
destServer=\u5B9B\u5148\u30B5\u30FC\u30D0\u30FC:
destServerHelp=\u9078\u629E\u3055\u308C\u305F\u30B5\u30FC\u30D0\u30FC\u304C\u30EA\u30AB\u30D0\u30EA\u3092\u5B9F\u884C\u3057\u307E\u3059\u3002
txnLogDir=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30ED\u30B0\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA:
txnLogDirHelp=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30ED\u30B0\u3092\u683C\u7D0D\u3059\u308B\u305F\u3081\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u5B9B\u5148\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
recoverTransactions.selfRecover=\u30EA\u30AB\u30D0\u30EA\u306F\u3001\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u81EA\u4F53\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u307E\u3059:
recoverTransactions.instanceName=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D:
msg.recoverTransactionsSuccessful=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306F\u6B63\u5E38\u306B\u30EA\u30AB\u30D0\u30EA\u3055\u308C\u307E\u3057\u305F\u3002

log.error.wsException=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u60C5\u5831\u53D6\u5F97\u306E\u4F8B\u5916:
log.error.appTarget=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8\u53D6\u5F97\u306E\u4F8B\u5916:
log.error.getRefEndpoints=getRefEndpoints\u306E\u4F8B\u5916:
log.error.initSession=InitSessionAttributes()\u306E\u4F8B\u5916:
log.error.prepareAlert=prepareAlert()\u306E\u4F8B\u5916:
log.error.getClusters=getClusters()\u306E\u4F8B\u5916\u3002
log.error.getInstances=getInstances()\u306E\u4F8B\u5916\u3002
log.error.getTargetEndpoint=getTargetEndpoint()\u306E\u4F8B\u5916\u3002
log.error.getDeployedAppsInfo=getDeployedAppsInfo()\u306E\u4F8B\u5916\u3002
log.error.getSubComponents=getSubComponents()\u306E\u4F8B\u5916\u3002
log.error.getGroupNames=getGroupNames()\u306E\u4F8B\u5916\u3002 
log.error.getSubComponentDetail=getSubComponentDetail()\u306E\u4F8B\u5916\u3002
log.error.getLifecyclesInfo=getLifecyclesInfo()\u306E\u4F8B\u5916\u3002
log.error.getURLs=getURLs()\u306E\u4F8B\u5916\u3002
log.error.updateJDBCPoolWizardStep1=updateJDBCPoolWizardStep1()\u306E\u4F8B\u5916\u3002
log.error.getWebStatsUrl=getWebStatsUrl()\u306E\u4F8B\u5916\u3002
log.error.getStatsUrl=getStatsUrl()\u306E\u4F8B\u5916\u3002
log.error.convertScheduleToString=convertScheduleToString()\u306E\u4F8B\u5916\u3002
log.error.sortMonths=sortMonths()\u306E\u4F8B\u5916\u3002
log.error.decodeString=decodeString()\u306E\u4F8B\u5916\u3002
log.error.roundTo2DecimalPoint=roundTo2DecimalPoint()\u306E\u4F8B\u5916\u3002
log.error.dateFormat=getFormattedDateTime()\u306E\u4F8B\u5916\u3002

rest.invalid_method=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u7121\u52B9\u306AHTTP\u30E1\u30BD\u30C3\u30C9\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F: {0}




