#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

TODO=
TBD=TBD
versionImage.description=Consola de Administraci\u00F3n de GlassFish Server 
productImage.URL=/resource/images/PrimaryProductName.png
productImage.height=23
productImage.width=386
login.productImage.URL=/images/LoginProductName.png
login.productImage.height=42
login.productImage.width=380

## this is the copyright message in the bottom of the login page.
copyright.shortMessage=Copyright \u00A9 2005, 2013, Oracle y/o sus filiales. Todos los derechos reservados. Oracle y Java son marcas registradas de Oracle y/o sus filiales. Todos los dem\u00E1s nombres pueden ser marcas comerciales de sus respectivos propietarios.

copyright.fullPage=Copyright \u00A9 2005,2013, Oracle y/o sus filiales. Todos los derechos reservados. <br><br> Oracle y Java son marcas comerciales registradas de Oracle y/o sus filiales. Todos los dem\u00E1s nombres pueden ser marcas comerciales de sus respectivos propietarios. <br><br>Intel e Intel Xeon son marcas comerciales o marcas comerciales registradas de Intel Corporation. Todas las marcas comerciales de SPARC se utilizan con licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. AMD, Opteron, el logotipo de AMD y el logotipo de AMD Opteron son marcas comerciales o marcas comerciales registradas de Advanced Micro Devices. UNIX es una marca comercial registrada de The Open Group. <br><br>Este software y la documentaci\u00F3n relacionada est\u00E1n sujetos a un contrato de licencia que incluye restricciones de uso y revelaci\u00F3n, y se encuentran protegidos por la legislaci\u00F3n sobre la propiedad intelectual. A menos que figure expl\u00EDcitamente en el contrato de licencia o est\u00E9 permitido por la ley, no se podr\u00E1 utilizar, copiar, reproducir, traducir, emitir, modificar, conceder licencias, transmitir, distribuir, exhibir, representar, publicar ni mostrar ninguna parte, de ninguna forma, por ning\u00FAn medio. Queda prohibida la ingenier\u00EDa inversa, desensamblaje o descompilaci\u00F3n de este software, excepto en la medida en que sean necesarios para conseguir interoperabilidad seg\u00FAn lo especificado por la legislaci\u00F3n aplicable.<br><br>La informaci\u00F3n contenida en este documento puede someterse a modificaciones sin previo aviso y no se garantiza que se encuentre exenta de errores. Si detecta alg\u00FAn error, le agradeceremos que nos lo comunique por escrito. <br><br>Si este software o la documentaci\u00F3n relacionada se entrega al Gobierno de EE.UU. o a cualquier entidad que adquiera licencias en nombre del Gobierno de EE.UU. se aplicar\u00E1 la siguiente disposici\u00F3n: <br>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are \u201Ccommercial computer software\u201D pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.<br><br>Este software o hardware se ha desarrollado para uso general en diversas aplicaciones de gesti\u00F3n de la informaci\u00F3n. No se ha dise\u00F1ado ni est\u00E1 destinado para utilizarse en aplicaciones de riesgo inherente, incluidas las aplicaciones que pueden causar da\u00F1os personales. Si utiliza este software o hardware en aplicaciones de riesgo, usted ser\u00E1 responsable de tomar todas las medidas apropiadas de prevenci\u00F3n de fallos, copia de seguridad, redundancia o de cualquier otro tipo para garantizar la seguridad en el uso de este software o hardware. Oracle Corporation y sus filiales declinan toda responsabilidad derivada de los da\u00F1os causados por el uso de este software o hardware en aplicaciones de riesgo. <br><br>Este software o hardware y la documentaci\u00F3n pueden ofrecer acceso a contenidos, productos o servicios de terceros o informaci\u00F3n sobre los mismos. Ni Oracle Corporation ni sus filiales ser\u00E1n responsables de ofrecer cualquier tipo de garant\u00EDa sobre el contenido, los productos o los servicios de terceros y renuncian expl\u00EDcitamente a ello. Oracle Corporation y sus filiales no se har\u00E1n responsables de las p\u00E9rdidas, los costos o los da\u00F1os en los que se incurra como consecuencia del acceso o el uso de contenidos, productos \
o servicios de terceros.

shutdown.pageTitle=Cierre de DAS
shutdown.RestartContinue=Haga clic <a href="../../">aqu\u00ED</a> para volver a la p\u00E1gina de conexi\u00F3n una vez que se haya iniciado el servidor.
shutdown.RestartHeading=Se ha iniciado el proceso de cierre de este dominio de servidor de aplicaciones.
shutdown.RestartInstructions1=El dominio se puede reiniciar mediante el comando <tt>asadmin start-domain</tt>. Para reiniciar el dominio:
shutdown.RestartStep1=Con\u00E9ctese a la m\u00E1quina en la que se ha instalado el dominio.
shutdown.RestartStep2=Ejecute <tt>&lt;appserver-installation-directory&gt;/bin/asadmin list-domains</tt> para asegurarse de que se ha completado el proceso de cierre del dominio
shutdown.RestartStep3=Ejecute el comando <tt>&lt;appserver-installation-directory&gt;/bin/asadmin start-domain</tt> con los par\u00E1metros adecuados.


restart.RestartHeading=Se ha iniciado el proceso de reinicio de este dominio de servidor de aplicaciones.
restart.RestartContinue=Haga clic <a href="{0}">aqu\u00ED</a> para volver a la p\u00E1gina de conexi\u00F3n una vez que se haya iniciado el servidor. Esto puede tardar algunos segundos.
restart.pageTitle=Reinicio de DAS

# Tree Node Name 
peTree=\u00C1rbol
tree.commonTasks=Tareas Comunes
tree.registration=Registro
tree.domain=Dominio
tree.appServer=GlassFish Server
tree.applications=Aplicaciones
tree.enterpriseApps=Aplicaciones de Empresa
tree.lifecycle=M\u00F3dulos de Ciclo de Vida
tree.resources=Recursos

tree.jdbcResources=Recursos de JDBC
tree.jdbcResources.toolTip=Recursos de JDBC
tree.connectionPools=Pools de Conexiones
tree.connectionPools.tooltip=Pools de Conexiones
tree.jmsResources=Recursos de JMS
tree.jmsResources.tooltip=Recursos de JMS
tree.connectionFactories=F\u00E1bricas de Conexiones
tree.connectionFactories.tooltip=F\u00E1bricas de Conexiones
tree.destinationResources=Recursos de Destino
tree.destinationResources.tooltip=Recursos de Destino
tree.javaMailSessions=Sesiones JavaMail
tree.javaMailSessions.tooltip=Sesiones JavaMail
tree.jndi=JNDI
tree.jndi.tooltip=JNDI
tree.customResources=Recursos Personalizados
tree.customResources.tooltip=Recursos Personalizados
tree.externalResources=Recursos Externos
tree.externalResources.tooltip=Recursos Externos
tree.connectors=Conectores
tree.connectors.tooltip=Conectores
tree.connectorResources=Recursos de Conectores
tree.connectorResources.tooltip=Recursos de Conectores
tree.connectorConnectionPools=Pools de Conexiones de Conectores
tree.connectorConnectionPools.tooltip=Pools de Conexiones de Conectores
tree.adminObjectResources=Recursos de Objeto de Administraci\u00F3n
tree.adminObjectResources.tooltip=Recursos de Objeto de Administraci\u00F3n
tree.resourceAdapterConfigs.tooltip=Configuraciones del Adaptador de Recursos
tree.resourceAdapterConfigs=Configuraciones del Adaptador de Recursos
tree.ContextServices=Servicios de Contexto
tree.ManagedThreadFactories=F\u00E1bricas de Threads Gestionadas
tree.ManagedExecutorServices=Servicios de Ejecutor Gestionados
tree.ManagedScheduledExecutorServices=Servicios de Ejecutor Programados y Gestionados

tree.workSecurityMaps=Asignaciones de Seguridad de Trabajo
tree.workSecurityMaps.tooltip=Asignaciones de Seguridad de Trabajo
tree.configuration=Configuraci\u00F3n
tree.configurations=Configuraciones
tree.jvmSettings=Configuraci\u00F3n de JVM
tree.jvmSettings.tooltip=Configuraci\u00F3n de JVM
tree.loggerSettings=Configuraci\u00F3n de Registrador
tree.loggerSettings.tooltip=Configuraci\u00F3n de Registrador

tree.ejbContainer=Contenedor EJB
tree.ejbContainer.tooltip=Contenedor EJB
tree.javaMessageService=Java Message Service
tree.javaMessageService.tooltip=Java Message Service
tree.jmsHosts=Hosts JMS
tree.jmsHosts.tooltip=Hosts JMS
tree.physicalDestinations=Destinos F\u00EDsicos
tree.security=Seguridad
tree.security.tooltip=Seguridad
tree.availabilityService=Servicio de Disponibilidad
tree.availabilityService.tooltip=Servicio de Disponibilidad
tree.realms=Dominios
tree.jaccProviders=Proveedores JACC
tree.auditModules=M\u00F3dulos de Auditor\u00EDa
tree.msgSecurityConfigs=Seguridad de Mensajes

tree.iiopListeners=Listeners IIOP

tree.adminService=Servicio de Administraci\u00F3n
tree.adminService.tooltip=Servicio de Administraci\u00F3n
tree.connectorService=Servicio de Conector
tree.connectorService.tooltip=Servicio de Conector

tree.systemProps=Propiedades del Sistema
tree.systemProps.tooltip=Propiedades del Sistema
tree.accessLog=Log de Acceso

tree.clusters=Clusters
tree.standaloneInstances=Instancias Independientes

display.Navigation=Mostrar \u00C1rbol de Navegaci\u00F3n
display.contentArea=\u00C1rea de Contenido

skipto.content=Pasar a \u00C1rea de Contenido

loginButtonTooltip=Conectar a Consola de Administraci\u00F3n de GlassFish
loginPageTitle=Conexi\u00F3n
masthead.Home=P\u00E1gina Inicial
masthead.Version=Acerca de...
masthead.Help=Ayuda

# this is link that user clicks on to logout from the console
masthead.Logout=Desconectar

logoutTooltip=Desconectar de la consola de administraci\u00F3n de GlassFish
helpWindowTitle=Ventana de Ayuda
helpWindowTOC=Tabla de Contenido
helpWindowIndex=\u00CDndice
homeLinkTooltip=Volver a la P\u00E1gina Inicial de la Aplicaci\u00F3n
versionTooltip=Mostrar versi\u00F3n del producto. (Abre una nueva ventana)
helpWindowTooltip=Ayuda en pantalla en una ventana nueva
mastHeadDescription=Consola de Administraci\u00F3n de GlassFish v3
masthead.restartRequired=Es Necesario Reiniciar
masthead.restartStatusMsg=Ir a la p\u00E1gina para parar e iniciar el servidor
masthead.userInfoLabel=Usuario:
masthead.serverInfoLabel=Servidor:
masthead.domainInfoLabel=Dominio:

error.checkServerLog=Para obtener m\u00E1s informaci\u00F3n, consulte el log del servidor

msg.longRunningProcess=Se ha detectado un proceso que lleva mucho tiempo ejecut\u00E1ndose. Espere...

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them
msg.JS.confirmStartInstance=\u00BFDesea iniciar la instancia de GlassFish Server?
msg.JS.confirmStopInstance=\u00BFDesea parar la instancia de GlassFish Server?
msg.JS.confirmRestartInstance=\u00BFDesea reiniciar la instancia de GlassFish Server?
msg.JS.confirmStopInstances=\u00BFDesea parar las instancias de GlassFish Server seleccionadas?
msg.JS.confirmStartInstances=\u00BFDesea iniciar las instancias de GlassFish Server seleccionadas?
msg.JS.confirmStartCluster=\u00BFDesea iniciar el cluster?
msg.JS.confirmStartClusters=\u00BFDesea iniciar los clusters seleccionados?
msg.JS.confirmStopCluster=\u00BFDesea parar el cluster?
msg.JS.confirmStopClusters=\u00BFDesea parar los clusters seleccionados?

msg.JS.confirmLogout=Desconectar de la Consola de Administraci\u00F3n de GlassFish Server


## The following will be shown in a popup window, followed by the label name on the screen.  This label name would have been translated.
## eg, if we have a text box named "User Name : ________"  and expect the user to fill that in, but user didn't, a popup will be shown to user
## when user submits the page, it will say:   Enter a value for User Name
## and focus will be on that field.
msg.JS.selectValue=Seleccione un valor para:
## see above comment
msg.JS.enterValue=Introduzca un valor para:
## see above comment
msg.JS.enterNumericValue=Introduzca un valor num\u00E9rico para: 
## see above comment
msg.JS.enterIntegerValue=Introduzca un valor entero positivo para:
## see above comment
msg.JS.enterPortValue=Introduzca un n\u00FAmero de puerto v\u00E1lido para:
## see above comment
msg.JS.resources.resName=La barra invertida no se permite para:
## see above comment
msg.JS.Error.securityMappingCannotBeEmpty=Debe especificar un valor para:


msg.JS.manageUser.passwordNotMatch=Los valores de contrase\u00F1a no coinciden. Vuelva a introducir las contrase\u00F1as.
msg.JS.manageUser.setEmptyAdminPassword=Defina una contrase\u00F1a vac\u00EDa para el usuario administrador actual. \u00BFDesea continuar?
msg.JS.manageUser.setEmptyPassword=Defina una contrase\u00F1a vac\u00EDa para el usuario especificado. \u00BFDesea continuar?
msg.JS.realm.needClassName=Introduzca el nombre de clase del dominio o seleccione uno de los nombres predefinidos en la lista desplegable.
msg.JS.confirmDeleteResources=Se suprimir\u00E1n los recursos seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeletePools=Se suprimir\u00E1n los recursos que dependen de los pools de conexiones seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteJmsHosts=Se suprimir\u00E1n los hosts JMS seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteCallFlowData=\u00BFDesea suprimir las solicitudes seleccionadas?
msg.JS.confirmClearCallFlowData=\u00BFDesea borrar todos los datos del flujo de llamadas?
msg.JS.confirmDeleteThreadPools=Se suprimir\u00E1n los pools de threads seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeleteHttpListener=Se suprimir\u00E1n los listeners HTTP seleccionados. \u00BFDesea continuar?
msg.JS.confirmDeletePhysicalDestinations=Se suprimir\u00E1n los destinos seleccionados. \u00BFDesea continuar?

msg.JS.confirmUndeploy=Se anular\u00E1 el despliegue de las aplicaciones seleccionadas. \u00BFDesea continuar?
msg.JS.deploy.confirmNoTarget=No se ha seleccionado ning\u00FAn destino de despliegue. \u00BFDesea continuar?
msg.JS.deploy.selectType=Seleccione un tipo de despliegue.
msg.JS.confirmDeleteMgmtRules=Se suprimir\u00E1n las reglas de gesti\u00F3n seleccionadas. \u00BFDesea continuar?
msg.JS.confirmDeleteInstance=Se suprimir\u00E1n las instancias seleccionadas. \u00BFDesea continuar?
msg.JS.confirmDeleteCluster=\u00BFDesea suprimir los clusters seleccionados y sus instancias?
msg.JS.confirmRemoveTarget=Se suprimir\u00E1n las aplicaciones seleccionadas de este destino. \u00BFDesea continuar?
msg.JS.confirmDeleteNodeAgent=\u00BFDesea suprimir los agentes de nodo seleccionados?
msg.JS.confirmDeleteSecurityMaps=\u00BFDesea suprimir las asignaciones de seguridad seleccionadas?
msg.JS.confirmDeleteLoadBalancers=\u00BFDesea suprimir los equilibradores de carga seleccionados?
msg.JS.deploy.confirmType=El archivo seleccionado no coincide con el tipo de aplicaci\u00F3n. \u00BFDesea continuar con el despliegue?
msg.JS.redeploy.typeUnmatch=El archivo seleccionado no coincide con el tipo de aplicaci\u00F3n. Selecci\u00F3nelo de nuevo.
msg.JS.redeploy.fileReqd=Seleccione un archivo para desplegarlo o volverlo a desplegar.
msg.JS.confirmStop=\u00BFDesea parar la instancia de GlassFish Server?
msg.JS.clearDataConfirm=\u00BFDesea restablecer todas las estad\u00EDsticas del servidor seleccionado?
msg.JS.improperEmail=La direcci\u00F3n de correo electr\u00F3nico tiene un formato incorrecto

msg.JS.ssl.errSecurityChecked=Debe introducir un apodo de certificado para activar la seguridad.
msg.JS.ssl.errClientChecked=Debe introducir un apodo de certificado para activar la autenticaci\u00F3n de cliente.
msg.JS.ssl.errSslTlsCert=Debe introducir el apodo del certificado, ya que SSL3 y/o TLS est\u00E1n activados.
msg.JS.ssl.errCiphersSelected=Debe seleccionar SSL3 / TLS para guardar los cifrados


msg.EmptyOverrideValue=El valor de sustituci\u00F3n no puede estar vac\u00EDo. Introduzca un n\u00FAmero v\u00E1lido.
msg.EmptyWeight=El peso no puede estar en blanco. Introduzca un n\u00FAmero v\u00E1lido.
msg.saveSuccessful=Se han guardado correctamente los nuevos valores.
msg.PingSucceed=Ping realizado correctamente
msg.PingError=Se ha devuelto un error sin motivo conocido al hacer ping.
msg.FlushSucceed=Vaciado correcto
msg.FlushError=El vaciado ha devuelto un error sin motivo conocido.
msg.JmsPingSucceed=Ping realizado correctamente: el servicio JMS se est\u00E1 ejecutando
msg.Error=Se ha producido un error
msg.updatesAvailable=<b>Hay {0} nuevas actualizaciones disponibles.
msg.updateAvailable=<b>Hay 1 nueva actualizaci\u00F3n disponible.
msg.newModulesAvailable=<b>Hay {0} nuevo software disponible.
msg.newModuleAvailable=<b>Hay 1 nuevo software disponible.
msg.updatesAndNewModulesAvailable=<b>Hay {0} nuevas actualizaciones y {1} nuevo software disponibles.
msg.updateAndNewModulesAvailable=<b>Hay 1 nueva actualizaci\u00F3n y {0} nuevo software disponibles.
msg.runUpdateCenter=<br/>Ejecute el cliente de Update Center ({0}) para la descarga e instalaci\u00F3n.</b>
msg.enableSuccessful=Se han activado las aplicaciones seleccionadas en todos los destinos.
msg.disableSuccessful=Se han desactivado las aplicaciones seleccionadas en todos los destinos.
msg.enableResourceSuccessful=Se han activado los recursos seleccionados.
msg.disableResourceSuccessful=Se han desactivado los recursos seleccionados.
msg.enableSuccessfulPE=Se han activado las aplicaciones seleccionadas.
msg.disableSuccessfulPE=Se han desactivado las aplicaciones seleccionadas.
msg.enableSuccessfulLifecycle=Se han activado los m\u00F3dulos de ciclo de vida seleccionados.
msg.disableSuccessfulLifecycle=Se han desactivado los m\u00F3dulos de ciclo de vida seleccionados.
msg.enableResourceSuccessfulPE=Se han activado los recursos seleccionados.
msg.disableResourceSuccessfulPE=Se han desactivado los recursos seleccionados.
msg.NoSuchLifecycle=No se ha encontrado el ciclo de vida con el nombre especificado. Puede que el recurso se haya suprimido.
msg.NoSuchCluster=No se ha encontrado el recurso de cluster especificado. Puede que el cluster se haya suprimido.
msg.NoSuchConfig=No se ha encontrado el recurso de configuraci\u00F3n especificado. Puede que la configuraci\u00F3n se haya suprimido.
msg.NoSuchInstance=No se ha encontrado la instancia especificada. Puede que la instancia se haya suprimido.
msg.NoSuchJDBCResource=No se ha encontrado el recurso JDBC con el nombre especificado. Puede que el recurso se haya suprimido.
msg.noSuchJDBCConnectionPool=No se ha encontrado el pool de conexiones JDBC con el nombre especificado. Puede que el recurso se haya suprimido.
msg.NoSuchConnectorResource=No se ha encontrado el recurso del conector especificado. Puede que el recurso se haya suprimido.
msg.NoSuchConnectorConnectionPool=No se ha encontrado el pool de conexiones del conector especificado. Puede que el pool se haya suprimido.
msg.NoSuchMailResource=No se ha encontrado el recurso de JavaMail especificado. Puede que el recurso se haya suprimido.
msg.NoSuchCustomResource=No se ha encontrado el recurso personalizado especificado. Puede que el recurso se haya suprimido.
msg.NoSuchExternalResource=No se ha encontrado el recurso externo especificado. Puede que el recurso se haya suprimido.
msg.NoSuchResource=No se ha encontrado el recurso especificado. Puede que el recurso se haya suprimido.
msg.NoAMXGmsSupport=No existe soporte al crear un servicio de gesti\u00F3n de grupos
msg.deploy.connectorModule=El m\u00F3dulo del conector est\u00E1 desplegado.
msg.duplicatePropTableKey=Se ha encontrado m\u00E1s de una propiedad con el mismo nombre: {0}
msg.error.checkLog=Para obtener m\u00E1s informaci\u00F3n, consulte el log del servidor.
msg.MaxTime=Tiempo M\u00E1ximo
msg.MinTime=Tiempo M\u00EDnimo
msg.TotalTime=Tiempo Total
msg.AppName=Nombre de Aplicaci\u00F3n
msg.Address=Direcci\u00F3n
msg.DepType=Tipo de Despliegue
msg.EndPointName=Nombre de Punto Final
msg.ImplType=Tipo Despliegue
msg.ImplClass=Clase Despliegue
msg.NameSpace=Espacio de Nombres
msg.PortName=Nombre de Puerto
msg.ServiceName=Nombre de Servicio

#This is the label of a form field.  This field shows the link to a tester page that contains different urls to test the deployed
# web services.
msg.Tester=Probador

msg.WSDL=WSDL
msg.ClassName=Nombre de Clase
msg.JrubyVersion=Versi\u00F3n
msg.Environment=Entorno
msg.HWaterMark=Marca de Agua M\u00E1xima
msg.LWaterMark=Marca de Agua M\u00EDnima

## do not translate the word NULL. 
msg.deploy.nullArchiveError=Error interno de GUI: la ruta de acceso del archivo es NULL.

msg.deploy.UndeployError=Se ha producido un error durante la anulaci\u00F3n del despliegue de:
msg.loadBalancer.NoSuchLB=El equilibrador de carga {0} no existe
msg.loadBalancer.TestConnectionSuccess=La conexi\u00F3n de prueba se ha realizado correctamente.
msg.loadBalancer.TestConnectionFailed=Fallo en la conexi\u00F3n de prueba.
msg.loadBalancer.ApplyLBSuccessful=Los cambios se han aplicado correctamente.

msg.requiredMsgNodeAgent=Se debe especificar un agente del nodo para la instancia.
msg.cluster.creationError=El nombre de cluster {0} no es \u00FAnico. Hay una configuraci\u00F3n, un agente de nodo, un cluster o una instancia de servidor con este nombre.
msg.compareDate=Introduzca una fecha v\u00E1lida para generar el informe de diagn\u00F3stico. La fecha puede ser la fecha actual o una anterior.  
msg.upgradeSuccess=Se ha actualizado correctamente a un perfil de cluster.

# begin Common Tasks keys
commonTasks.title=Consola de GlassFish: Tareas Comunes

#it is on purpose to leave this blank so that Woodstock will not supply a default one that doesn't apply.
commonTasks.help=
commonTasks.welcome=Bienvenido a GlassFish Application Server
commonTasks.group.tasks=Tareas Comunes
commonTasks.group.docs=Documentaci\u00F3n
commonTasks.group.enterpriseTasks=Tareas de Empresa
commonTasks.group.Deployment=Despliegue
commonTasks.group.Other=Otras Tareas
commonTasks.group.Monitoring=Supervisi\u00F3n
commonTasks.group.Administration=Administraci\u00F3n
commonTasks.group.Resources=Recursos

commonTasks.group.UpdateCenter=Update Center


commonTasks.task.searchLog=Buscar Archivos Log
commonTasks.task.searchLog.infoText=Busque los archivos log de las instancias del servidor de aplicaciones.
commonTasks.task.searchLog.infoTitle=Buscar Archivos Log
commonTasks.task.searchLog.infoLinkText=M\u00E1s informaci\u00F3n sobre la b\u00FAsqueda de archivos log
commonTasks.task.searchLog.toolTip=Buscar Archivos Log

commonTasks.task.listApp=Lista de Aplicaciones Desplegadas
commonTasks.task.listApp.infoTitle=Lista de Aplicaciones Desplegadas
commonTasks.task.listApp.infoLinkText=M\u00E1s informaci\u00F3n sobre las aplicaciones desplegadas
commonTasks.task.listApp.toolTip=Lista de Aplicaciones Desplegadas

commonTasks.task.deployEAR=Desplegar una Aplicaci\u00F3n 
commonTasks.task.deployEAR.infoText=(TBD) Una aplicaci\u00F3n de empresa se empaqueta en un archivo EAR, un tipo de archivo de almacenamiento que contiene cualquiera de los m\u00F3dulos independientes Java EE, como archivos WAR y EJB JAR. Para obtener m\u00E1s informaci\u00F3n, consulte la ayuda en pantalla.
commonTasks.task.deployEAR.infoTitle=Desplegar una Aplicaci\u00F3n 
commonTasks.task.deployEAR.infoLinkText=M\u00E1s informaci\u00F3n sobre el despliegue de aplicaciones de empresa
commonTasks.task.deployEAR.toolTip=Desplegar Aplicaci\u00F3n de Empresa 

commonTasks.task.deployWAR=Desplegar Aplicaci\u00F3n Web (.war)
commonTasks.task.deployWAR.infoText=Se incluye una aplicaci\u00F3n web en un archivo WAR; un tipo de archivo de almacenamiento que contiene componentes como, por ejemplo, servlet y p\u00E1ginas JSP.
commonTasks.task.deployWAR.infoTitle=Desplegar Aplicaci\u00F3n Web (.war)
commonTasks.task.deployWAR.infoLinkText=M\u00E1s informaci\u00F3n sobre el despliegue de aplicaciones web (.war)
commonTasks.task.deployWAR.toolTip=Desplegar Aplicaci\u00F3n Web (.war)

commonTasks.task.deployCustomMBean=Desplegar MBean Personalizado
commonTasks.task.deployCustomMBean.infoText=Un MBean personalizado se empaqueta en un archivo JAR. 
commonTasks.task.deployCustomMBean.infoTitle=Desplegar MBean Personalizado (.jar)
commonTasks.task.deployCustomMBean.infoLinkText=M\u00E1s informaci\u00F3n sobre el despliegue de un MBean personalizado (.jar)
commonTasks.task.deployCustomMBean.toolTip=Desplegar MBean Personalizado (.war)


commonTasks.task.deployJbi=Desplegar Ensamblaje del Servicio de Java Business Integration (JBI)
commonTasks.task.deployJbi.infoText=El ensamblaje del servicio de JBI se empaqueta en un archivo Jar o Zip.
commonTasks.task.deployJbi.infoTitle=Desplegar Ensamblaje del Servicio de Java Business Integration (JBI)
commonTasks.task.deployJbi.infoLinkText=M\u00E1s informaci\u00F3n sobre el despliegue del ensamblaje de servicio de JBI
commonTasks.task.deployJbi.toolTip=Desplegar Ensamblaje del Servicio de Java Business Integration (JBI)

commonTasks.task.jdbcResource=Crear nuevo recurso JDBC
commonTasks.task.jdbcResource.toolTip=Crear nuevo recurso JDBC

commonTasks.task.connPool=Crear Nuevo Pool de Conexiones JDBC
commonTasks.task.connPool.infoText=Un pool de conexiones se utiliza para proporcionar acceso de base de datos a las aplicaciones desplegadas.
commonTasks.task.connPool.infoTitle=Crear Nuevo Pool de Conexiones JDBC
commonTasks.task.connPool.infoLinkText=M\u00E1s informaci\u00F3n sobre la creaci\u00F3n de un pool de conexiones JDBC nuevo
commonTasks.task.connPool.toolTip=Crear Pool de Conexiones JDBC

commonTasks.task.monitor=Ver Datos de Supervisi\u00F3n
commonTasks.task.monitor.infoText= Supervise determinados aspectos del servidor de aplicaciones.
commonTasks.task.monitor.infoTitle=Ver Datos de Supervisi\u00F3n
commonTasks.task.monitor.infoLinkText=M\u00E1s informaci\u00F3n sobre la supervisi\u00F3n de datos
commonTasks.task.monitor.toolTip=Ver Datos de Supervisi\u00F3n

commonTasks.task.configMonitor=Configurar Supervisi\u00F3n
commonTasks.task.configMonitor.infoText=Configurar supervisi\u00F3n
commonTasks.task.configMonitor.infoTitle=Configurar Supervisi\u00F3n
commonTasks.task.configMonitor.infoLinkText=M\u00E1s informaci\u00F3n sobre la configuraci\u00F3n de supervisi\u00F3n
commonTasks.task.configMonitor.toolTip=Configurar Supervisi\u00F3n


commonTasks.task.uc.getStart=Gu\u00EDa de Introducci\u00F3n
commonTasks.task.uc.getStart.toolTip=Gu\u00EDa de Introducci\u00F3n de Update Center
commonTasks.task.uc.startLink=http://wiki.updatecenter.java.net/Wiki.jsp?page=GettingStarted
commonTasks.task.uc.toolTip=Comprobar si hay nuevas actualizaciones o software disponibles

commonTasks.task.glassfishNews=Noticias de GlassFish

commonTasks.task.aquarium=Noticias de GlassFish
commonTasks.task.aquarium.toolTip=Noticias de la Comunidad GlassFish
commonTasks.task.aquariumLink=http://blogs.oracle.com/theaquarium

commonTasks.task.support=Soporte
commonTasks.task.support.toolTip=Soporte de GlassFish
commonTasks.task.supportLink=https://shop.oracle.com/pls/ostore/f?p=100:4:994801121276918:::RIR:IR_ROWFILTER:GlassFish

commonTasks.task.qstart=Gu\u00EDa de Inicio R\u00E1pido
commonTasks.task.qstart.toolTip=Gu\u00EDa de Inicio R\u00E1pido
commonTasks.task.qstart.infoText=Pasos b\u00E1sicos para iniciar el servidor de aplicaciones, as\u00ED como empaquetar y desplegar las aplicaciones. Tambi\u00E9n proporciona informaci\u00F3n sobre la consola de administraci\u00F3n y las herramientas de l\u00EDnea de comandos.
commonTasks.task.qstart.infoTitle=Gu\u00EDa de Inicio R\u00E1pido
commonTasks.task.qstart.infoLinkText=M\u00E1s informaci\u00F3n sobre la Gu\u00EDa de Inicio R\u00E1pido

commonTasks.task.adminGuide=Gu\u00EDa de Administraci\u00F3n
commonTasks.task.adminGuide.toolTip=Gu\u00EDa de Administraci\u00F3n
commonTasks.task.adminGuide.infoText=C\u00F3mo configurar, administrar y supervisar GlassFish Server.
commonTasks.task.adminGuide.infoTitle=Gu\u00EDa de Administraci\u00F3n
commonTasks.task.adminGuide.infoLinkText=M\u00E1s informaci\u00F3n sobre la Gu\u00EDa de Administraci\u00F3n


commonTasks.task.devGuide=Gu\u00EDa de Desarrollo de Aplicaciones
commonTasks.task.devGuide.toolTip=Gu\u00EDa de Desarrollo de Aplicaciones
commonTasks.task.devGuide.infoText=C\u00F3mo crear y ejecutar aplicaciones de Java EE en el entorno de GlassFish Server. Entre los temas se incluyen las herramientas para desarrolladores, la seguridad, la depuraci\u00F3n y la creaci\u00F3n de m\u00F3dulos de ciclo de vida.
commonTasks.task.devGuide.infoTitle=Gu\u00EDa del Desarrollador
commonTasks.task.devGuide.infoLinkText=M\u00E1s informaci\u00F3n sobre la Gu\u00EDa de Desarrollo de Aplicaciones


commonTasks.task.deployGuide=Gu\u00EDa de Despliegue de Aplicaciones
commonTasks.task.deployGuide.toolTip=Gu\u00EDa de Despliegue de Aplicaciones
commonTasks.task.deployGuide.infoText=C\u00F3mo desplegar aplicaciones y componentes de aplicaciones en GlassFish Server. Incluye informaci\u00F3n acerca de los descriptores de despliegue.
commonTasks.task.deployGuide.infoTitle=Gu\u00EDa de Despliegue de Aplicaciones
commonTasks.task.deployGuide.infoLinkText=M\u00E1s Informaci\u00F3n sobre la Gu\u00EDa de Despliegue de Aplicaciones

commonTasks.task.docpage=Juego de documentaci\u00F3n de Open Source Edition
commonTasks.task.docpage.toolTip=Juego de documentaci\u00F3n de Open Source Edition

# change the doc link to the localized copy if there is any
commonTasks.doc.qstart=http://glassfish.java.net/docs/4.0/quick-start-guide.pdf
commonTasks.doc.adminGuide=http://glassfish.java.net/docs/4.0/administration-guide.pdf
commonTasks.doc.devGuide=http://glassfish.java.net/docs/4.0/application-development-guide.pdf
commonTasks.doc.deployGuide=http://glassfish.java.net/docs/4.0/application-deployment-guide.pdf
commonTasks.doc.docpage=http://glassfish.java.net/docs/index.html


commonTasks.task.adminPassword=Cambiar Contrase\u00F1a de Administrador
commonTasks.task.adminPassword.toolTip=Cambiar Contrase\u00F1a de Administrador
commonTasks.task.pswdAliases=Mostrar alias de contrase\u00F1a
commonTasks.task.pswdAliases.toolTip=Mostrar alias de contrase\u00F1a


# end Common Tasks keys

#This is used as a label for dropdown, and show some other info to user.
#Please translate this 'true' and 'false' to other locale.
common.true=true
common.false=false


common.AdminConsole=Consola de Administraci\u00F3n
common.Enabled=Activada
common.LbEnabled=Equilibrador de Carga Activado
common.Ignore=Ignorar
common.ClassLoader=Classloader
common.Configuration=Configuraci\u00F3n
common.ConfigurationLabel=Configuraci\u00F3n:
common.ConfigurationName=Nombre de Configuraci\u00F3n: 
common.Naming=Nomenclatura
common.Security=Seguridad
common.Jts=JTS
common.Jta=JTA
common.JBI=JBI
common.Jaxws=JAXWS
common.Admin=Administraci\u00F3n
common.Deployment=Despliegue
common.Saaj=SAAJ
common.Corba=CORBA
common.Jms=JMS
common.Connector=Conector
common.Persistence=Persistencia
common.WebContainer=Contenedor Web
common.Jacc=JACC
common.ThreadPool=Pool de Threads
common.EjbContainer=Contenedor EJB
common.AuditModules=M\u00F3dulos de Auditor\u00EDa
common.MdbContainer=Contenedor de Beans Controlados por Mensajes
common.TransactionService=Servicio de Transacci\u00F3n
common.NodeAgent=Agente de Nodo
common.Synchronization=Sincronizaci\u00F3n
common.GMS=Servicio de Gesti\u00F3n de Grupos
common.Root=Ra\u00EDz
common.SelfManagement=Autogesti\u00F3n
common.Server=Servidor
common.General=General
common.GeneralTab=Separador General
common.Generate=Generar
common.GeneralSettings=Configuraci\u00F3n General
common.jndiName=Nombre JNDI:
common.poolName=Nombre de Pool:
common.description=Descripci\u00F3n:
common.description.header=Descripci\u00F3n
common.status=Estado:
common.status.header=Estado
common.Name=Nombre:
common.name.header=Nombre
common.Required=Necesario
common.Weeks=Semanas
common.Days=D\u00EDas
common.Hours=Horas
common.Minutes=Minutos
common.Seconds=Segundos
common.Milliseconds=Milisegundos
common.Connections=Conexiones
common.Bytes=Bytes
common.NumBeans=N\u00FAmero de Beans
common.Cluster=Cluster
common.Instance=Instancia
common.resource.deploymentOrder=Orden de Despliegue:
common.resource.deploymentOrderHelp=Especifica el orden de carga del recurso al iniciar el servidor. Los n\u00FAmeros inferiores se cargan en primer lugar.

# this is used as the tab name or a section of the screen, to indicate for configurating some advanced attributes of an object.
common.Advanced=Avanzada

common.resType=Tipo de Recurso:
common.resourceAdapter=Adaptador de Recursos:
common.type.header=Tipo
common.TypeLabel=Tipo:
common.JavaWebStart=Java Web Start:
common.Availability=Disponibilidad:
common.location=Ubicaci\u00F3n:
common.Libraries=Bibliotecas:
common.DescriptorTab=Descriptor
common.TargetTab=Destino
common.Resources=Recursos
common.TimeStamp=Registro de Hora
common.ResponseTime=Tiempo de Respuesta (ms)
common.Response=Respuesta
common.Size=Tama\u00F1o
common.ClientHost=Host de Cliente
common.User=Usuario
common.AllItems=Todos los Elementos
common.Success=Correcto
common.Actions=Acciones
common.Action=Acci\u00F3n
common.NA=N/A

common.SubModules=Subm\u00F3dulos
common.Application=Aplicaci\u00F3n
common.AdditionalProperties=Propiedades Adicionales
common.PropertyName=Nombre
common.PropertyValue=Valor
common.ConfidentialPropertyValue=Valor Confidencial
common.ConfirmConfidentialPropertyValue=Confirmar Valor Confidencial
common.NtwkAddress=Direcci\u00F3n de Red
common.listPort=Puerto de Listener
common.defVirtualServer=Servidor Virtual por Defecto
common.username=Nombre de Usuario:
common.password=Contrase\u00F1a:
common.instanceName=Nombre de Instancia:
common.Status=Estado
common.newDropDown=-- Nuevo --
common.moreActionDropDown=-- M\u00E1s Acciones --
common.filterDropDown=Filtro:
common.viewDropDown=Ver:
common.showAll= -- Mostrar Todo --
common.ResourceName=Nombre de Recurso
common.Type=Tipo
common.Links=Enlaces:
common.Summary=Resumen
common.Properties=Propiedades
common.AdditonalProperties=Propiedades Adicionales
common.SettingsTab=Configuraci\u00F3n
common.configMonitor=Configurar Supervisi\u00F3n
common.resourcesTable.colLogicalJndiName=Nombre de JNDI L\u00F3gico
common.logicalJndiName=Nombre de JNDI L\u00F3gico:

#not used in current implementation
#common.LBActionDropDown=-- Load Balancer Actions --

common.Component=Componente
common.property.select.title=Seleccionar/Anular Selecci\u00F3n de Propiedad
common.Description=Descripci\u00F3n
common.JdbcConnectionPools=Pools de Conexiones JDBC
common.select=Seleccionar/Anular Selecci\u00F3n
#
# Buttons
#
button.Save=Guardar
button.SaveAs=Guardar como...
button.SaveWithReload=Guardar y Volver a Cargar
button.LoadDefaults=Cargar Valores por Defecto
button.ViewLogFiles=Ver Archivos Log
button.OK=Aceptar
button.Cancel=Cancelar
button.Next=Siguiente
button.Ping=Ping
button.Processing=En proceso...

#this is button name in a wizard.  Pressing this "Previous" button goes back to the previous screen.
button.Previous=Anterior

button.Finish=Finalizar
button.Refresh=Refrescar
button.Reset=Restablecer
button.Close=Cerrar
button.ClearData=Borrar Datos
button.Deploy=Desplegar...
button.Undeploy=Anular Despliegue
button.Enable=Activar
button.Disable=Desactivar
button.New=Nuevo...
button.Delete=Suprimir
button.AddProperty=Agregar Propiedad
button.DeleteProperties=Suprimir Propiedades
button.ChooseFolder=Seleccionar Carpeta
button.ChooseFile=Seleccionar Archivo
button.Browse=Examinar...
button.BrowseFolder=Examinar Carpetas...
button.BrowseFile=Examinar Archivos...
button.Flush=Vaciar
button.ManageUsers=Gestionar Usuarios
button.ViewTree=Ver \u00C1rbol
button.ManageTarget=Gestionar Destinos...
button.Add=Agregar
button.Remove=Eliminar
button.Start=Iniciar
button.Stop=Parar
button.Restart=Reiniciar
button.Back=Atr\u00E1s
button.Search=Buscar
button.TestConnection=Conexi\u00F3n de Prueba
button.LbExport=Exportar Ahora...
button.LbApply=Aplicar Cambios Ahora
button.startLB=Activar Equilibrio de Carga
button.quiesce=Desactivar
button.hideChart=Ocultar Gr\u00E1fico
button.displayChart=Mostrar Gr\u00E1fico
button.backToCallFlow=Volver a Flujo de Llamadas
button.backToMessages=Volver a los Mensajes
button.UnInstall=Eliminar
button.Install=Instalar
button.Accept=Aceptar
button.Decline=Rechazar
button.changeLevel=Cambiar Nivel

#
# Token Tab
#
appServer.tokenTab=Separador Propiedades del Sistema
appServer.tokenTitle=Propiedades del Sistema
appServer.tokenTitleHelp=Una propiedad del sistema define un valor com\u00FAn para una configuraci\u00F3n a nivel del servidor. Puede hacer referencia a una propiedad del sistema en un campo de texto agregando el s\u00EDmbolo del d\u00F3lar y encerr\u00E1ndola entre corchetes angulares.

#
# Headings
#
headings.Diagnostics=Diagn\u00F3stico
headings.Advanced=Avanzado
headings.AppConfig=Configuraci\u00F3n de Aplicaciones
headings.AppConfigTab=Separador Configuraci\u00F3n de Aplicaciones
headings.DomainAttributes=Atributos de Dominio
headings.DomainAttributesTab=Separador Atributos de Dominio
headings.AdminPassword=Contrase\u00F1a de Administrador
headings.AdminPasswordTab=Separador Contrase\u00F1a de Administrador

# Server Instance General page
instance.GeneralTitle=Informaci\u00F3n General
button.stopInstance=Parar Instancia
button.startInstance=Iniciar Instancia
button.logViewer=Ver Archivos Log
button.logViewerRaw=Ver Log No Procesado
button.collectLogFiles=Recopilar Logs
button.rotateLog=Rotar Log
button.jndiBrowsing=Exploraci\u00F3n JNDI
button.recoverTrans=Recuperar Transacci\u00F3n...
button.upgradeProfile=Agregar Soporte de Clusters...

inst.serverName=Nombre:
inst.httpPortsLabel=Puerto(s) HTTP:
inst.iiopPortsLabel=Puerto(s) IIOP:
inst.JVMLabel=JVM:
inst.configLabel=Configuraci\u00F3n:
inst.configDirLabel=Directorio de Configuraci\u00F3n:
inst.installDirLabel=Directorio de Instalaci\u00F3n:
inst.versionLabel=Versi\u00F3n Instalada:
inst.debugLabel=Depurar:
inst.upTimeLabel=Tiempo de Actividad:
inst.notEnabled=No Activado
inst.debugEnabled=Activado en Puerto: 
inst.ConfigPropsPageTitle=Propiedades Espec\u00EDficas de Configuraci\u00F3n de la Instancia
inst.ConfigPropsPageHelp=Los valores por defecto se definen en la configuraci\u00F3n enlazada con esta instancia. Para restablecer el valor por defecto, elimine el valor de sustituci\u00F3n y haga clic en Guardar. Si no se especifica otro valor, se utilizar\u00E1 el valor por defecto.
inst.ConfigPropTab=Propiedades de Configuraci\u00F3n
inst.ConfigsPropsTableTitle=Propiedades de Configuraci\u00F3n: Valores por Defecto y de Sustituci\u00F3n
inst.InstPropTab=Propiedades de la Instancia
inst.PropTableTitle=Propiedades de Configuraci\u00F3n: Valores por Defecto y de Sustituci\u00F3n
inst.ColDefaultValue=Valor por Defecto
inst.ColOverrideValue=Valor de Sustituci\u00F3n
inst.tab.ConfigProperties=Propiedades del Sistema
inst.tab.InstanceProperties=Propiedades de la Instancia
inst.PropsPageTitle=Propiedades Espec\u00EDficas de Instancia
inst.PropsPageTitleHelp=Agregue o cambie las propiedades de esta instancia.
inst.PropsTableTitle=Propiedades de la Instancia

#Restart
restart.RestartHelpText=El reinicio del indicador se\u00F1ala que se han modificado uno o varios valores de configuraci\u00F3n y que se debe reiniciar el servidor de aplicaciones para poder aplicar los nuevos valores.<br /><br />
restart.showRestartReasonList=Ver los motivos por los que se necesita reiniciar
restart.tooltip=Reiniciar el servidor par\u00E1ndolo y volvi\u00E9ndolo a iniciar

### Applications

applications.enterpriseAppsToolTip=Aplicaciones de Empresa
applications.webAppsToolTip=Aplicaciones Web
applications.ejbModulesToolTip=M\u00F3dulos EJB
applications.connectorModulesToolTip=M\u00F3dulos del Conector
applications.lifecycleModulesToolTip=M\u00F3dulos de Ciclo de Vida
applications.appclientModulesToolTip=M\u00F3dulos de Cliente de Aplicaciones

ComponentTable.tableTitle=M\u00F3dulos y Componentes
ComponentTable.colModule=Nombre de M\u00F3dulo
ComponentTable.colName=Nombre de Componente
ComponentTable.colType=Tipo
ComponentTable.colAction=Acci\u00F3n
ComponentTable.colApp=Nombre de Aplicaci\u00F3n
ComponentTable.downloadClientStub=Descargar Stubs de Cliente
ComponentTable.viewEndPoint=Ver Punto Final

appScopedResourcesTable.tableTitle=Recursos
appScopedResourcesTable.colResourceName=Nombre de Recurso

TargetTable.colVirtualServer=Servidores Virtuales
TargetTable.virtualServerLink=Gestionar Servidores Virtuales

deploy.type.ear=Aplicaci\u00F3n Empresarial
deploy.type.appClient=Cliente de Aplicaciones
deploy.type.ejb=JAR EJB
deploy.type.other=Otro
deploy.type.war=Aplicaci\u00F3n Web
deploy.type.rar=M\u00F3dulo del Conector

enterpriseApplications.title=Aplicaciones
enterpriseApplications.titleHelp=Las aplicaciones pueden ser de empresa o web, o varios tipos de m\u00F3dulos. Reinicie una aplicaci\u00F3n o m\u00F3dulo haciendo clic en el enlace de nueva carga; esta acci\u00F3n se aplicar\u00E1 solo a los destinos en los que est\u00E1 activado el m\u00F3dulo o la aplicaci\u00F3n.
enterpriseApplications.editPageTitle=Editar Aplicaci\u00F3n
enterpriseApplications.editPageTitleHelp=Modificar una aplicaci\u00F3n o m\u00F3dulo existentes.
enterpriseApplications.directoryDeploy=Directorio Desplegado:
enterpriseApplications.deployPageTitle=Desplegar Aplicaciones o M\u00F3dulos
enterpriseApplications.deployPageTitleHelp=Especifique la ubicaci\u00F3n de la aplicaci\u00F3n o del m\u00F3dulo que desea desplegar. Una aplicaci\u00F3n puede estar en un archivo empaquetado o se puede especificar como directorio.
enterpriseApplications.descriptorPageTitle=Descriptores del M\u00F3dulo
enterpriseApplications.descriptorPageTitleHelp=Ver descriptores de m\u00F3dulo para la aplicaci\u00F3n.
enterpriseApplications.appScopedResourcesPageTitle=Recursos de \u00C1mbito de Aplicaci\u00F3n
enterpriseApplications.appScopedResourcesPageTitleHelp=Ver los recursos de \u00E1mbito de aplicaci\u00F3n para la aplicaci\u00F3n.
deployTable.applications=Aplicaciones Desplegadas
deployTable.lifeCycle=M\u00F3dulos de Ciclo de Vida
deployTable.colName=Nombre
deployTable.colEnabled=Activada
deployTable.colStatus=Estado
deployTable.colLocation=Ubicaci\u00F3n
deployTable.colContextRoot=Ra\u00EDz de Contexto
deployTable.colLoadOrder=Orden de Carga
deployTable.classnameCol=Nombre de Clase
deployTable.colJavaWebStart=Java Web Start
deployTable.colDeploymentOrder=Orden de Despliegue

## this is the column name of the table that lists out the deployed applications.  This column shows the sniffer engineer of  this application
## eg.  web, ejb, appclient etc.
deployTable.ColEngines=Motores

deployTable.redeploy=Volver a Desplegar
deployTable.launch=Iniciar
deployTable.reload=Volver a Cargar
deployTable.downloadStubs=[Descargar Stubs de Cliente]
deploy.allEnabled=Activado en Todos los Destinos
deploy.allDisabled=Desactivado en Todos los Destinos
deploy.someEnabled=Activado en {0} de {1} Destinos
deploy.noTarget=Ning\u00FAn Destino Asociado
deploy.unknown=Estado Desconocido
deploy.forceRedeploy=Forzar Nuevo Despliegue:
deploy.forceRedeployHelp=Fuerza el nuevo despliegue incluso aunque esta aplicaci\u00F3n ya se haya desplegado o ya exista.
deploy.osgiType=Tipo OSGi:
deploy.osgiTypeHelp=El componente est\u00E1 empaquetado como un grupo de OSGi.
application.EnableTargetHelp=Haga clic en el separador Destino para controlar el estado de un destino individual
targetTable.colTargetName=Nombre de Destino
appclients.title=M\u00F3dulos de Cliente de Aplicaciones
applicents.titleHelp=Un m\u00F3dulo de cliente de aplicaciones, tambi\u00E9n denominado JAR de cliente de aplicaciones de Java, contiene las rutinas del servidor para el cliente.
appsPageTitle=Aplicaciones
appsPageTitleHelp=Defina o gestione aplicaciones desplegadas en GlassFish Server.
connectorModules.title=M\u00F3dulos del Conector
connectorModules.titleHelp=Un m\u00F3dulo de conector se utiliza para conectar un Sistema de informaci\u00F3n de empresa (EIS) y se incluye en un archivo o directorio RAR (Archivo de adaptador de recursos).
ejbModules.title=M\u00F3dulos EJB
ejbModules.titleHelp=Un m\u00F3dulo EJB consta de uno o varios componentes EJB (Enterprise JavaBeans) incluidos en un archivo o directorio EJB JAR (Archivo de Java).

application.DD.title=Descriptor de Despliegue 
application.DD.titleHelp=Un descriptor de despliegue consiste en un archivo XML que describe el modo en que una aplicaci\u00F3n o un m\u00F3dulo Java EE se deben desplegar. Cada descriptor de despliegue tiene un archivo DTD (Document Type Definition) o de esquema XSD correspondiente. GlassFish Server soporta descriptores de Java EE est\u00E1ndar, de GlassFish Server y de WebLogic.
application.appName=Nombre de Aplicaci\u00F3n:
application.moduleName=Nombre de M\u00F3dulo:
application.modulePath=Nombre de Archivo del Descriptor:

module.targetPageTitleHelp=Gestione los destinos (clusters e instancias del servidor independientes) en los que est\u00E1 disponible el m\u00F3dulo.

webAplications.title=Aplicaciones Web
webAplications.titleHelp=Un m\u00F3dulo de aplicaci\u00F3n web consta de una recopilaci\u00F3n de recursos web como, por ejemplo, p\u00E1ginas JavaServer Faces, servlets y p\u00E1ginas HTML empaquetadas en un archivo o directorio WAR (Archivo de aplicaci\u00F3n web).
webApplicationLinks.PageTitle=Enlaces de Aplicaci\u00F3n Web
webApplicationLinks.PageHelp=Si el servidor o el listener no se est\u00E1 ejecutando, es posible que no funcione el enlace. En ese caso, compruebe el estado de la instancia del servidor. Una vez iniciada la aplicaci\u00F3n web, utilice el bot\u00F3n Atr\u00E1s del explorador para volver a esta pantalla.

webApp.editPageTitle=Aplicaci\u00F3n Web
webApp.editPageTitleHelp=Modificar una aplicaci\u00F3n web existente.
webApp.descriptorPageTitle=Descriptores de M\u00F3dulo
webApp.descriptorPageTitleHelp=Ver los descriptores de m\u00F3dulos de la aplicaci\u00F3n web.
webApp.targetPageTitle=Destinos de Aplicaciones Web
webApp.targetPageTitleHelp=Gestione los destinos (clusters e instancias del servidor independientes) en los que est\u00E1 disponible la aplicaci\u00F3n web.
webApp.ContextRoot=Ra\u00EDz de Contexto:
webApp.contextRootHelp=Ruta de acceso relativa a la URL base del servidor.
webApp.viewDDPageTitle=Ver Descriptor de Despliegue

resourcesPageTitle=Recursos
resourcesPageTitleHelp=Defina o gestione los recursos disponibles en GlassFish Server.

configuration.pageTitle=Configuraci\u00F3n
configuration.pageTitleHelp=Gestione las configuraciones y consulte los clusters o las instancias del servidor de destino mediante estas configuraciones.

configurations.pageTitle=Configuraciones
configurations.pageTitleHelp=Gestione las configuraciones y consulte los clusters o las instancias del servidor de destino mediante estas configuraciones.



required.field.legend = Indica que el campo es obligatorio


# JBI page resources moved to publish/glassfish/jbi/lib/jbi-admin-gui.jar, built from open-esb source:
# cvs.dev.java.net:/cvs/open-esb/ri-clients/jbi-admin-gui/src/com/sun/jbi/jsf/resources/Bundle.properties

#Common keys
desc.Enabled=Activada
desc.Required=Necesaria


#Connector Service
headings.ConnService=Servicio de Conector
connServ.ConnServiceInfo=Los atributos especificados se aplicar\u00E1n a todos los adaptadores de recursos desplegados en este cluster/instancia de servidor.
connServ.shutdTimeoutLabel=Timeout de Cierre:
connServ.shutdTimeoutHelp=Se ignorar\u00E1n los adaptadores de recursos que tarden m\u00E1s tiempo y continuar\u00E1 el procedimiento de cierre

# Transaction Service
#


## Connection Pool
cp.Title=Pool de Conexiones
cp.PageHelp=Configure el pool de conexiones para la cola de conexi\u00F3n.
cp.MaxPendingCount=Recuento M\u00E1ximo de Pendientes:
cp.MaxPendingCountHelp=N\u00FAmero m\u00E1ximo de conexiones pendientes en el socket de recepci\u00F3n
cp.QueueSize=Tama\u00F1o de Cola:
cp.QueueSizeHelp=Tama\u00F1o en bytes de la cola de conexi\u00F3n
cp.ReceiveSize=Tama\u00F1o de Buffer de Recepci\u00F3n:
cp.ReceiveSizeHelp=Tama\u00F1o del buffer de recepci\u00F3n utilizado por los sockets
cp.SendSize=Tama\u00F1o de Buffer de Env\u00EDo:
cp.SendSizeHelp=Tama\u00F1o de buffer de env\u00EDo utilizado por los sockets

## Deployment Keys

deploy.pageTitle=Desplegar Aplicaciones/M\u00F3dulos de Empresa
deploy.titleHelp=Especifique la ubicaci\u00F3n de la aplicaci\u00F3n o del m\u00F3dulo que desea desplegar. Una aplicaci\u00F3n puede estar en un archivo empaquetado o se puede especificar como directorio.
deploy.fileChoose=Seleccionar Archivo que Cargar
deploy.chooseJarLabel=Archivo Empaquetado que Cargar en el Servidor
deploy.subCompName=Nombre de Subcomponente
deploy.ApplicationName=Nombre de Aplicaci\u00F3n:
deploy.virtualServerLabel=Servidores Virtuales:
deploy.vsHelp=Asocia un nombre de dominio de Internet a un servidor f\u00EDsico.
deploy.status=Estado:
deploy.statusHelp=Permite a los usuarios acceder a la aplicaci\u00F3n.
deploy.run=Ejecutar Verificador:
deploy.runHelp=Verifica la sintaxis y sem\u00E1ntica del descriptor de despliegue. Los paquetes de verificador deben estar instalados.
deploy.precompile=Precompilar JSP:
deploy.PrecompileHelp=Precompila p\u00E1ginas JSP durante el despliegue.
deploy.JavaWebStart=Java Web Start:
deploy.JavaWebStartHelp=Especifica si se permite el acceso con Java Web Start para un m\u00F3dulo de cliente de aplicaciones.
edit.JavaWebStartHelp=Debe volver a desplegar la aplicaci\u00F3n para cambiar el soporte de Java Web Start.
deploy.rmis=Generar RMIStubs:
deploy.rmistubHelp=Genera stubs de RMI est\u00E1ticos y los coloca en el archivo JAR del cliente.
deploy.libraryHelp=Lista separada por comas de los archivos JAR de la biblioteca. Especifique los archivos JAR de biblioteca a trav\u00E9s de sus rutas de acceso absolutas o relativas. Especifique las rutas de acceso relativas a <var>ra\u00EDz-instancia </var><code>/lib/applibs</code>. Las bibliotecas est\u00E1n disponibles para la aplicaci\u00F3n en el orden en que se han especificado.
deploy.fileOrdirectory=Archivo o Directorio:
deploy.descriptorFileName=Nombre de Archivo del Descriptor
deploy.descriptors=Descriptores de Despliegue
deploy.threadpoolid=ID de Pool de Threads:
deploy.availability=Disponibilidad:
deploy.availabilityHelp=Controla si se activa la disponibilidad para sesiones web y para la aplicaci\u00F3n de puntos de control de beans de sesi\u00F3n con estado (SFSB) y, posiblemente, para la desactivaci\u00F3n.
deploy.compatibility=Compatibilidad:
deploy.compatibilityHelp=Soporta la compatibilidad con versiones anteriores respecto a la visibilidad JAR en v2 en lugar de los requisitos m\u00E1s estrictos de Java EE 6 implantados en v3.
deploy.deploymentOrder=Orden de Despliegue:
deploy.deploymentOrderHelp=N\u00FAmero que determina el orden de carga de la aplicaci\u00F3n al iniciar el servidor. Los n\u00FAmeros inferiores se cargan en primer lugar. El valor por defecto es 100.
deploy.type=Tipo de Aplicaci\u00F3n:
deploy.chooseLocal=Archivo empaquetado local o directorio accesible desde GlassFish Server
deploy.warning=El despliegue se ha realizado correctamente con una advertencia. Consulte el archivo log para obtener m\u00E1s informaci\u00F3n.
undeploy.warning=La anulaci\u00F3n del despliegue se ha realizado correctamente con una advertencia. Consulte el archivo log para obtener m\u00E1s informaci\u00F3n.
redeploy.warning=El nuevo despliegue se ha realizado correctamente con una advertencia. Consulte el archivo log para obtener m\u00E1s informaci\u00F3n.
appAction.warning=La acci\u00F3n se ha realizado correctamente con una advertencia. Consulte el archivo log para obtener m\u00E1s informaci\u00F3n.

deploy.descHelp=
redeploy.pageTitle=Volver a Desplegar Aplicaciones o M\u00F3dulos
redeploy.pageTitleHelp=Especifique la ubicaci\u00F3n de la aplicaci\u00F3n que se va a volver a desplegar.
redeploy.keepState=Mantener Estado:
redeploy.keepStateHelp=Mantiene sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente entre nuevos despliegues.
redeploy.preserveAppScopedResources=Conservar Recursos de \u00C1mbito de Aplicaci\u00F3n:
redeploy.preserveAppScopedResourcesHelp=Conserva recursos de \u00E1mbito de la aplicaci\u00F3n y los restaura durante el nuevo despliegue.

# Manage Targets
manageTargets.PageTitle=Gestionar Destinos
manageApplicationTargets.PageTitleHelp=Gestione los destinos (clusters o instancias del servidor independientes) en los que est\u00E1 disponible la aplicaci\u00F3n.
manageLifecycleTargets.PageTitleHelp=Gestione los destinos (clusters o instancias del servidor independientes) en los que est\u00E1 disponible el m\u00F3dulo del ciclo de vida.

manageResourceTargets.PageTitle=Gestionar Destinos de Recurso
manageResourceTargets.PageTitleHelp=Gestione los destinos (clusters o instancias del servidor independientes) en los que est\u00E1 disponible el recurso.

manageVS.PageTitle=Destinos de Servidor Virtuales
manageVS.PageTitleHelp=Configure referencias a servidores virtuales para una aplicaci\u00F3n o recurso.
manageTargets.AvailableTargets=Destinos Disponibles
manageTargets.SelectedTargets=Destinos Seleccionados
manageTargets.list=Lista de Destinos
common.TargetTableTitle=Destinos

applicationTargetListing.PageTitle=Destinos de Aplicaciones
applicationTargetListing.PageTitleHelp=Lista de destinos de aplicaciones.

lifecycleTargetListing.PageTitle=Destinos del M\u00F3dulo de Ciclo de Vida
lifecycleTargetListing.PageTitleHelp=Lista de destinos del m\u00F3dulo de ciclo de vida.

resourceTargetListing.PageTitle=Destinos de Recursos
resourceTargetListing.PageTitleHelp=Lista de destinos de recursos.


targetListing.TargetNameCol=Nombre de Destino
targetListing.VsCol=Servidores Virtuales
targetListing.LBEnabled=Equilibrador de Carga Activado
targetListing.table.lbEnable=Activaci\u00F3n de Equilibrador de Carga
targetListing.table.lbDisable=Desactivaci\u00F3n de Equilibrador de Carga
targetListing.manageTargetButton=Gestionar Destinos... 

resourceAdapter.propertyPageTitle=Editar Propiedades del Adaptador de Recursos
resourceAdapter.propertyPageTitleHelp=Especifique propiedades para el adaptador de recursos asociado a un m\u00F3dulo de conector desplegado.
resourceAdapter.resName=Nombre del Adaptador de Recursos:
resourceAdapter.Properties=Propiedades del Adaptador de Recursos
##Admin Service
headings.AdminService=Servicio de Administraci\u00F3n
adService.jmxConnNameLabel=Nombre de Conector JMX:

## Edit JMX Connector 
edJmxConnector.jmxConnectorLabel=Conector JMX
edJmxConnector.jmxConnectorLabelTab=Separador Conector JMX
headings.EditJmxConnector=Editar Conector JMX
edJmxConnector.EditJmxConnectorInfo=Edita la configuraci\u00F3n del conector JMX compatible con JSR-160. Los clientes JMX est\u00E1ndar (como JConsole) se pueden conectar al elemento JMXServiceURL que aparece a continuaci\u00F3n con el fin de gestionar los dominios.
edJmxConnector.generalSettingsLabel=Configuraci\u00F3n General
edJmxConnector.jmxNameLabel=Nombre:
edJmxConnector.jmxProtocolLabel=Protocolo JMX:
edJmxConnector.jmxServUrlLabel=JMXServiceURL:
edJmxConnector.addressLabel= Direcci\u00F3n:
edJmxConnector.addressHelp=Especifica el nombre de host o la direcci\u00F3n IP; el nombre s\u00F3lo debe contener caracteres alfanum\u00E9ricos, de subrayado, guiones o puntos
edJmxConnector.portLabel= Puerto:
edJmxConnector.portHelp=Especifica el puerto del servicio de nomenclatura (RMIRegistry) en el que est\u00E1 enlazado el stub del servicio del conector JMX.
edJmxConnector.realmNameLabel=Nombre de Dominio:
edJmxConnector.realmNameHelp=Este dominio maneja toda la autenticaci\u00F3n; puede incluir hasta 255 caracteres, y s\u00F3lo debe contener caracteres alfanum\u00E9ricos, de subrayado, guiones o puntos

####### not used in current implementation.
#edJmxConnector.clientHostLabel=Client Hostname:
#edJmxConnector.clientHostLabelHelp=

edJmxConnector.securityLabel=Seguridad:
edJmxConnector.sslSettingsLabel=SSL
edJmxConnector.sslSettingsLabelTab=Separador SSL
edJmxConnector.sslSettingsTitle=SSL
edJmxConnector.sslSettingsTitleHelp=Modifique la configuraci\u00F3n de SSL para el conector JMX.
edJmxConnector.clientAuthLabel=Autenticaci\u00F3n de Cliente:
edJmxConnector.clientAuthHelp=Necesita que el cliente se autentique en el servidor
edJmxConnector.certNicknameLabel=Apodo de Certificado:
edJmxConnector.certNicknameHelp=Asume un \u00FAnico valor e identifica el par de claves y el certificado del servidor.
edJmxConnector.ssl3TlsSettingsLabel=SSL3/TLS
edJmxConnector.ssl3Label=SSL3:
edJmxConnector.tlsLabel=TLS:
edJmxConnector.ciphersLabel=Conjuntos de Cifrado:
edJmxConnector.ciphersHelp=Si no se agrega ning\u00FAn conjunto de cifrado, esto significa que se seleccionar\u00E1n TODOS los conjuntos de cifrado.
edJmxConnector.commonCiphersLabel=Conjuntos de Cifrado Comunes:
edJmxConnector.eccCiphersLabel=Conjuntos de Cifrado ECC:
edJmxConnector.ephCiphersLabel=Conjuntos de Cifrado Diffie-Hellman Ef\u00EDmeros:
edJmxConnector.otherCiphersLabel=Conjuntos de Cifrado de 40 y 56 Bits:
edJmxConnector.sslPageHelp=Configurar SSL.


ejbTimer.pageTitle=Migrar Temporizadores EJB
ejbTimer.pageTitleHelp=Migre los temporizadores EJB asociados a un servidor (que probablemente se ha parado anormalmente o ha fallado) a otro servidor.
ejbTimer.select=Seleccione la instancia de servidor de origen y destino
ejbTimer.Source=Origen:
ejbTimer.Dest=Destino:
ejbTimer.DestHelp=Si est\u00E1 vac\u00EDo, se selecciona aleatoriamente un servidor activo del cluster
ejbTimer.NoMigration=Se est\u00E1n ejecutando todas las instancias del servidor. Ning\u00FAn temporizador EJB necesita migraci\u00F3n.
ejbTimer.NoRunning=No existe ning\u00FAn servidor en ejecuci\u00F3n en el cluster para migrar los temporizadores EJB.

appTable.applications=Aplicaciones


##Configurations
configuration.colTarget=Destino
configuration.NewPageTitle=Nueva Configuraci\u00F3n
configuration.configFromLabel=Copiar configuraci\u00F3n de:
systemProps.systemProps=Propiedades del Sistema
systemProps.systemPropsInfo=Gestione las propiedades de las configuraciones, y especifique si las configuraciones del servidor son din\u00E1micas o necesitan que se reinicie el servidor.
systemProps.dynamicReconfigLabel=Nueva Configuraci\u00F3n Din\u00E1mica:
systemProps.colInstanceName=Nombre de Variable de Instancia
systemProps.colDefaultValue=Valor por Defecto
systemProps.ColCurrentValue=Valor Actual
systemProps.colInstanceValues=Valores de Instancia
systemProps.instClustLabel=Clusters y/o Instancias que Utilizan Esta Configuraci\u00F3n:
instanceValues.PageTitle=Valores de Instancia de {0}
instanceValues.TableTitle=Valores de Propiedad de Instancia
instanceValues.colInstanceName=Nombre de Instancia
instanceValues.colClusterName=Nombre de Cluster
instanceValues.colParameterVal=Valor de Par\u00E1metro

logDetail.PageTitle=Detalles de Entrada de Log
logDetail.recordDetailLabel=Detalles
logDetail.timeStampLabel=Registro de Hora
logDetail.levelLabel=Nivel de Log
logDetail.loggerLabel=Registrador
logDetail.nvpLabel=Pares de Nombre-Valor
logDetail.recordNumberLabel=N\u00FAmero de Registro
logDetail.messageIDLabel=ID de Mensaje
logDetail.messageLabel=Mensaje Completo
logDetail.closeButton=Cerrar
logDetail.diagnosticCausesLabel=Causas de Diagn\u00F3stico
logDetail.diagnosticChecksLabel=Comprobaciones de Diagn\u00F3stico
logDetail.diagnosticURILabel=URI

alert.AuthenticationFailed=Fallo de Autenticaci\u00F3n
alert.ReenterUsernamePassword=Vuelva a introducir el nombre de usuario y la contrase\u00F1a
alert.ConfigurationError=Error de Configuraci\u00F3n
alert.EnableSecureAdmin=La administraci\u00F3n segura debe estar activada para acceder a DAS de forma remota.

## Recover Transactions
headings.recoverTransactions=Recuperar Transacciones
recoverTransactions.recoverTransactionsInfo=Si el servidor seleccionado se est\u00E1 ejecutando, el mismo servidor realiza la recuperaci\u00F3n. Si el servidor seleccionado no se est\u00E1 ejecutando, el servidor de destino seleccionado realiza la recuperaci\u00F3n.
recoverTransactions.destinationServer=Servidor de Destino:
recoverTransactions.destinationServerHelp=El servidor seleccionado realiza la recuperaci\u00F3n.
recoverTransactions.transactionLogDir=Directorio de Log de Transacciones:
recoverTransactions.transactionLogDirHelp=Directorio para almacenar logs de transacciones; el servidor de destino deber\u00EDa poder acceder a \u00E9l.

updateCenter.pageTitle=Update Center
updateCenter.pageTitleHelp=Utilice <a href="http://wiki.java.net/bin/view/Projects/Updatecenter">Update Center</a> para instalar y actualizar tecnolog\u00EDas y marcos adicionales como <a href="https://open-esb.dev.java.net/">Open ESB</a>. Update Center es una aplicaci\u00F3n local que necesita GlassFish Server. Para iniciar Update Center, escriba el comando que aparece en el campo Comando de Update Center en esta p\u00E1gina. Consulte la <a href="http://wiki.updatecenter.java.net/Wiki.jsp?page=GettingStarted" target="_blank" >Getting Started Guide</a> (Gu\u00EDa de Introducci\u00F3n) para obtener m\u00E1s informaci\u00F3n.
updateCenter.newUpdates=N\u00FAmero de Nuevas Actualizaciones:
updateCenter.newSoftware=N\u00FAmero de Nuevos M\u00F3dulos de Software:
updateCenter.toolsLocation=Comando de Update Center:
updateCenter.wikiPage=P\u00E1gina Wiki de Update Center:
updateCenter.commonTask.noNewUpdates=Ning\u00FAn Nuevo Componente Disponible
updateCenter.commonTask.hasNewUpdates={0} Nuevas Actualizaciones Disponibles
updateCenter.commonTask.hasNewModules={0} Nuevos Componentes Disponibles

deployment.failure=Fallo de despliegue.
deployment.warning=Advertencia de despliegue.


updateCenter.commonTask.groupHeader=Update Center
updateCenter.commonTask.installed=Componentes Instalados
updateCenter.commonTask.installed.toolTip=Lista de componentes instalados en el servidor
updateCenter.commonTask.update=Actualizaciones Disponibles
updateCenter.commonTask.update.toolTip=Lista de actualizaciones disponibles

tree.updateCenter=Herramienta de Actualizaci\u00F3n 

uc.commonTaskgroup.UpdateCenter=Update Center
uc.commonTask.install=Componentes Instalados
uc.commonTask.installToolTip=Lista de Componentes Instalados
uc.commonTask.update=Actualizaciones Disponibles
uc.commonTask.updateToolTip=Lista de componentes disponibles para actualizarse
uc.commonTask.addOn=Complementos Disponibles
uc.commonTask.addOnToolTip=Lista de componentes disponibles para agregarse como complementos

#### not userd.
#webApp.appName=Application Name:
#webApp.EditDDTab=Edit Descriptor
#webApp.editDDPageTitle=Customize Deployment Descriptor
#webApp.editDDPageTitleHelp=Customize the env-entries and context parameters for the deployed web application.  Changes take effect only after the application is reloaded.
#webApp.editEnvTableTitle=Environment Entry
#webApp.envEntryNameCol=env-entry-name
#webApp.envEntryTypeCol=env-entry-type
#webApp.envEntryOrigCol=env-entry-value
#webApp.envEntryValueCol=customized value
#webApp.envEntryDescCol=description
#webApp.editParamTableTitle=Context Parameter
#webApp.paramNameCol=param-name
#webApp.paramOrigValueCol=param-value
#webApp.paramValueCol=customized value
#webApp.descriptors=Deployment Descriptors

realm.colClassname=Nombre de Clase

iiop.editIiopTab=Listener IIOP
ssl.clientAuthLabel=Autenticaci\u00F3n de Cliente:
ssl.clientAuthHelp=Necesita que el cliente se autentique en el servidor.
ssl.certNicknameLabel=Apodo de Certificado:
ssl.certNicknameHelp=Asume un \u00FAnico valor e identifica el par de claves y el certificado del servidor.
ssl.ssl3TlsSettingsLabel=SSL3/TLS
ssl.ssl3Label=SSL3:
ssl.tlsLabel=TLS:
ssl.ciphersLabel=Conjuntos de Cifrado:
ssl.ciphersHelp=Si no se agrega ning\u00FAn conjunto de cifrado, se seleccionan TODOS los conjuntos de cifrado.
ssl.commonCiphersLabel=Conjuntos de Cifrado Comunes:
ssl.eccCiphersLabel=Conjuntos de Cifrado ECC:
ssl.ephCiphersLabel=Conjuntos de Cifrado Diffie-Hellman Ef\u00EDmeros:
ssl.otherCiphersLabel=Conjuntos de Cifrado de 40 y 56 Bits:
ssl.sslPageHelp=Configurar SSL.
ssl.ssl2Label=SSL2:
ssl.cipherssuites=Conjuntos de Cifrado
ssl.availableCommonCiphersLabel=Conjuntos de Cifrado Comunes Disponibles:
ssl.selectedCommonCiphersLabel=Conjuntos de Cifrado Comunes Seleccionados:
ssl.availableEphCiphersLabel=Conjuntos de Cifrado Diffie-Hellman Ef\u00EDmeros Disponibles:
ssl.selectedEphCiphersLabel=Conjuntos de Cifrado Diffie-Hellman Ef\u00EDmeros Seleccionados:
ssl.availableOtherCiphersLabel=Conjuntos de Cifrado de 40 y 56 Bits Disponibles:
ssl.selectedOtherCiphersLabel=Conjuntos de Cifrado de 40 y 56 Bits Seleccionados:
ssl.availableEccCiphersLabel=Conjuntos de Cifrado EEC Disponibles:
ssl.selectedEccCiphersLabel=Conjuntos de Cifrado EEC Seleccionados:
ssl.keyStore=Almac\u00E9n de Claves:
ssl.keyStoreHelp=Nombre del archivo del almac\u00E9n de claves (por ejemplo, keystore.jks)
ssl.TrustAlgorithm=Algoritmo de Confianza:
ssl.TrustAlgorithmHelp=Nombre del algoritmo de gesti\u00F3n de confianza (por ejemplo, PKIX) que se va a utilizar para la validaci\u00F3n de rutas de acceso de certificaci\u00F3n
ssl.trustMaxCert=Longitud de Certificado M\u00E1xima:
ssl.trustMaxCertHelp=N\u00FAmero m\u00E1ximo de certificados intermedios no emitidos autom\u00E1ticamente que puede haber en una ruta de acceso de certificaci\u00F3n (s\u00F3lo es v\u00E1lido si el algoritmo de confianza es PKIX)
ssl.trustStore=Almac\u00E9n de Confianza:
ssl.trustStoreHelp=Nombre del archivo del almac\u00E9n de confianza (por ejemplo, cacerts.jks)



## JNDI Browser
##
tree.jndiEntries=Ra\u00EDz de Entradas JNDI ({0})
jndiTree.PageTitle=Exploraci\u00F3n de \u00C1rbol de JNDI
jndiTree.PageHelp=Ver nombres de JNDI. El objeto de recurso y su nombre de JNDI est\u00E1n enlazados entre s\u00ED.
jndiTree.ClassNameLabel=Clase:
jndiTree.TargetsLabel=Destinos:
jndiTree.SelectNode=Seleccione un nodo para ver su nombre de clase.
