#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
#
# This file incorporates work covered by the following copyright and
# permission notice:
#
# Copyright 2004 The Apache Software Foundation
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

#
# Message IDs reserved for this file: PWC3710-PWC3979
#
accessLogValve.alreadyStarted=PWC3710: \u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30AC\u30FC\u306F\u3059\u3067\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059
accessLogValve.notStarted=PWC3711: \u30A2\u30AF\u30BB\u30B9\u30FB\u30ED\u30AC\u30FC\u306F\u307E\u3060\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u305B\u3093

# Error report valve
errorReportValve.errorReport=\u30A8\u30E9\u30FC\u30FB\u30EC\u30DD\u30FC\u30C8
errorReportValve.statusHeader=HTTP\u30B9\u30C6\u30FC\u30BF\u30B9{0} - {1}
errorReportValve.exceptionReport=\u4F8B\u5916\u30EC\u30DD\u30FC\u30C8
errorReportValve.statusReport=\u30B9\u30C6\u30FC\u30BF\u30B9\u30FB\u30EC\u30DD\u30FC\u30C8
errorReportValve.message=\u30E1\u30C3\u30BB\u30FC\u30B8
errorReportValve.description=\u8AAC\u660E
errorReportValve.exception=\u4F8B\u5916
errorReportValve.rootCause=\u6839\u672C\u539F\u56E0
errorReportValve.note=\u6CE8\u610F
errorReportValve.rootCauseInLogs=\u4F8B\u5916\u304A\u3088\u3073\u305D\u306E\u6839\u672C\u539F\u56E0\u306E\u3059\u3079\u3066\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u306F\u3001{0}\u30ED\u30B0\u306B\u3042\u308A\u307E\u3059\u3002

# HTTP status reports
http.100=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u7D9A\u884C\u53EF\u80FD\u3067\u3059({0})\u3002
http.101=\u30B5\u30FC\u30D0\u30FC\u306F"Upgrade"\u30D8\u30C3\u30C0\u30FC({0})\u306B\u5F93\u3063\u3066\u3001\u30D7\u30ED\u30C8\u30B3\u30EB\u3092\u5207\u308A\u66FF\u3048\u3066\u3044\u307E\u3059
http.201=\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u6210\u529F\u3057\u3001\u65B0\u898F\u30EA\u30BD\u30FC\u30B9({0})\u304C\u30B5\u30FC\u30D0\u30FC\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
http.202=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u51E6\u7406\u306F\u53D7\u3051\u5165\u308C\u3089\u308C\u307E\u3057\u305F\u304C\u3001\u5B8C\u4E86\u3057\u3066\u3044\u307E\u305B\u3093({0})\u3002
http.203=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u63D0\u793A\u3055\u308C\u305F\u30E1\u30BF\u60C5\u5831\u306F\u3001\u30B5\u30FC\u30D0\u30FC({0})\u304C\u767A\u4FE1\u5143\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
http.204=\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u6210\u529F\u3057\u307E\u3057\u305F\u304C\u3001\u8FD4\u3055\u308C\u305F\u60C5\u5831\u306F\u3042\u308A\u307E\u305B\u3093 ({0})\u3002
http.205=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u3001\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u4FE1\u3057\u305F\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u30FB\u30D3\u30E5\u30FC\u3092\u30EA\u30BB\u30C3\u30C8\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059({0})\u3002
http.206=\u30B5\u30FC\u30D0\u30FC\u306F\u3053\u306E\u30EA\u30BD\u30FC\u30B9({0})\u306B\u5BFE\u3059\u308B\u4E00\u90E8\u5206\u306EGET\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u5B9F\u884C\u3057\u307E\u3057\u305F\u3002
http.207=\u8907\u6570\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u5024\u304C\u8FD4\u3055\u308C\u307E\u3057\u305F({0})\u3002
http.300=\u8981\u6C42\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u3001\u305D\u308C\u305E\u308C\u304C\u7279\u5B9A\u306E\u5834\u6240\u3092\u6301\u3064\u3001\u4EE3\u7406\u306E\u8A2D\u5B9A\u306E1\u3064\u306B\u5BFE\u5FDC\u3057\u307E\u3059\u3002
http.301=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u3001\u65B0\u3057\u3044\u5834\u6240\u306B\u5B8C\u5168\u306B\u79FB\u52D5\u3055\u308C\u307E\u3057\u305F\u3002
http.302=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u3001\u65B0\u3057\u3044\u5834\u6240\u306B\u4E00\u6642\u7684\u306B\u79FB\u52D5\u3055\u308C\u307E\u3057\u305F\u3002
http.303=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3078\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u304C\u3001\u9055\u3046URI ({0})\u306E\u4E0B\u306B\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
http.304=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u304C\u4F7F\u7528\u53EF\u80FD\u3067\u3042\u308A\u3001\u5909\u66F4\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
http.305=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u3001"Location"\u30D8\u30C3\u30C0\u30FC\u3067\u6307\u5B9A\u3055\u308C\u305F\u30D7\u30ED\u30AD\u30B7\u3092\u901A\u3057\u3066\u30A2\u30AF\u30BB\u30B9\u3055\u308C\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
http.400=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u3063\u3066\u9001\u4FE1\u3055\u308C\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u69CB\u6587\u7684\u306A\u8AA4\u308A\u304C\u3042\u308A\u307E\u3059({0})\u3002
http.401=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306FHTTP\u8A8D\u8A3C\u304C\u5FC5\u8981\u3067\u3059({0})\u3002
http.402=\u3053\u306E\u30EA\u30BD\u30FC\u30B9({0})\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u306B\u306F\u3001\u652F\u6255\u3044\u304C\u5FC5\u8981\u3067\u3059\u3002
http.403=\u6307\u5B9A\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
http.404=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u4F7F\u7528\u53EF\u80FD\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
http.405=\u6307\u5B9A\u3055\u308C\u305FHTTP\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306B\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
http.406=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u3088\u3063\u3066\u8B58\u5225\u3055\u308C\u308B\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u306E"accept"\u30D8\u30C3\u30C0\u30FC({0})\u306B\u5FDC\u3058\u3066\u53D7\u5165\u308C\u4E0D\u53EF\u3067\u3042\u308B\u7279\u5FB4\u3092\u6301\u3064\u30EC\u30B9\u30DD\u30F3\u30B9\u306E\u307F\u3092\u751F\u6210\u3067\u304D\u307E\u3059\u3002
http.407=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u6700\u521D\u306B\u30D7\u30ED\u30AD\u30B7({0})\u3067\u8A8D\u8A3C\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
http.408=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u5F85\u6A5F\u306E\u305F\u3081\u30B5\u30FC\u30D0\u30FC\u304C\u6E96\u5099\u3055\u308C\u308B\u6642\u9593\u5185\u306B\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u751F\u6210\u3057\u307E\u305B\u3093\u3067\u3057\u305F({0})\u3002
http.409=\u30EA\u30BD\u30FC\u30B9({0})\u306E\u73FE\u5728\u306E\u72B6\u614B\u3068\u306E\u7AF6\u5408\u306E\u305F\u3081\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u5B8C\u4E86\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
http.410=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9({0})\u306F\u4F7F\u7528\u53EF\u80FD\u3067\u306F\u306A\u304F\u306A\u3063\u3066\u304A\u308A\u3001\u8EE2\u9001\u5148\u30A2\u30C9\u30EC\u30B9\u3082\u4E0D\u660E\u3067\u3059\u3002
http.411=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u9577\u3055({0})\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u51E6\u7406\u3067\u304D\u307E\u305B\u3093\u3002
http.412=\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8({0})\u306B\u5BFE\u3057\u3066\u3001\u6307\u5B9A\u3055\u308C\u305F\u524D\u63D0\u6761\u4EF6\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002
http.413=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u30B5\u30FC\u30D0\u30FC\u306E\u51E6\u7406\u80FD\u529B\u3092\u8D85\u3048\u308B\u5927\u304D\u3055\u3067\u3059\u3002
http.414=\u30EA\u30AF\u30A8\u30B9\u30C8\u306EURI\u304C\u9577\u3059\u304E\u308B\u305F\u3081({0})\u3001\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
http.415=\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30E1\u30BD\u30C3\u30C9({0})\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u3063\u3066\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3067\u3042\u308B\u305F\u3081\u3001\u30B5\u30FC\u30D0\u30FC\u306B\u3088\u3063\u3066\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002
http.416=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30D0\u30A4\u30C8\u7BC4\u56F2\u3092\u6E80\u305F\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093({0})\u3002
http.417="Expect"\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30D8\u30C3\u30C0\u30FC({0})\u306B\u6307\u5B9A\u3055\u308C\u305F\u4E88\u6E2C\u3092\u5B9F\u73FE\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
http.422=\u30B5\u30FC\u30D0\u30FC\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30BF\u30A4\u30D7\u304A\u3088\u3073\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u69CB\u6587\u3092\u7406\u89E3\u3057\u307E\u3057\u305F\u304C\u3001\u542B\u307E\u308C\u3066\u3044\u308B\u547D\u4EE4\u3092\u51E6\u7406\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F({0})\u3002
http.423=\u30E1\u30BD\u30C3\u30C9\u306E\u30BD\u30FC\u30B9\u307E\u305F\u306F\u5B9B\u5148\u306E\u30EA\u30BD\u30FC\u30B9\u304C\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u3059({0})\u3002
http.500=\u30B5\u30FC\u30D0\u30FC\u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u5B9F\u884C\u3092\u59A8\u3052\u308B\u5185\u90E8\u30A8\u30E9\u30FC({0})\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002
http.501=\u30B5\u30FC\u30D0\u30FC\u306F\u3053\u306E\u30EA\u30AF\u30A8\u30B9\u30C8({0})\u306E\u5B9F\u884C\u306B\u5FC5\u8981\u306A\u6A5F\u80FD\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002
http.502=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306F\u3001\u30D7\u30ED\u30AD\u30B7\u307E\u305F\u306F\u30B2\u30FC\u30C8\u30A6\u30A7\u30A4({0})\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u3068\u304D\u306B\u3001\u8ABF\u67FB\u3057\u305F\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u7121\u52B9\u306A\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u53D7\u4FE1\u3057\u307E\u3057\u305F\u3002
http.503=\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305F\u30B5\u30FC\u30D3\u30B9({0})\u306F\u73FE\u5728\u4F7F\u7528\u53EF\u80FD\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
http.504=\u30B5\u30FC\u30D0\u30FC\u306F\u3001\u30B2\u30FC\u30C8\u30A6\u30A7\u30A4\u307E\u305F\u306F\u30D7\u30ED\u30AD\u30B7({0})\u3068\u3057\u3066\u52D5\u4F5C\u3057\u3066\u3044\u308B\u3068\u304D\u306B\u3001\u4E0A\u4F4D\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u53D7\u4FE1\u3057\u307E\u3057\u305F\u3002
http.505=\u30B5\u30FC\u30D0\u30FC\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u305FHTTP\u30D7\u30ED\u30C8\u30B3\u30EB\u30FB\u30D0\u30FC\u30B8\u30E7\u30F3({0})\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002
http.507=\u30EA\u30BD\u30FC\u30B9\u306B\u3001\u3053\u306E\u30E1\u30BD\u30C3\u30C9({0})\u306E\u5B9F\u884C\u5F8C\u3001\u30EA\u30BD\u30FC\u30B9\u306E\u72B6\u614B\u3092\u8A18\u9332\u3059\u308B\u305F\u3081\u306E\u5341\u5206\u306A\u9818\u57DF\u304C\u3042\u308A\u307E\u305B\u3093\u3002
