#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
#
# This file incorporates work covered by the following copyright and
# permission notice:
#
# Copyright 2004 The Apache Software Foundation
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

#
# Message IDs reserved for this file: PWC3710-PWC3979
#
accessLogValve.alreadyStarted=PWC3710 Il logger degli accessi \u00E8 gi\u00E0 stato avviato
accessLogValve.notStarted=PWC3711 Il logger degli accessi non \u00E8 stato ancora avviato

# Error report valve
errorReportValve.errorReport=Report errori
errorReportValve.statusHeader=Stato HTTP {0} - {1}
errorReportValve.exceptionReport=Report eccezioni
errorReportValve.statusReport=Report sullo stato
errorReportValve.message=messaggio
errorReportValve.description=descrizione
errorReportValve.exception=eccezione
errorReportValve.rootCause=causa principale
errorReportValve.note=nota
errorReportValve.rootCauseInLogs=Gli stack trace completi dell''eccezione e delle relative cause principali sono disponibili nei log {0}.

# HTTP status reports
http.100=Il client pu\u00F2 continuare ({0}).
http.101=Il server sta cambiando i protocolli in base all''intestazione "Upgrade" ({0}).
http.201=La richiesta \u00E8 riuscita e sul server \u00E8 stata creata una nuova risorsa ({0}).
http.202=La richiesta \u00E8 stata accettata per l''elaborazione, ma non \u00E8 stata completata ({0}).
http.203=Le metainformazioni presentate dal client non hanno avuto origine dal server ({0}).
http.204=La richiesta \u00E8 riuscita ma non sono presenti informazioni da restituire ({0}).
http.205=Il client deve reimpostare la vista documento che ha causato l''invio di questa richiesta ({0}).
http.206=Il server ha completato una richiesta parziale GET per questa risorsa ({0}).
http.207=Sono stati restituiti pi\u00F9 valori di stato ({0}).
http.300=La risorsa richiesta ({0}) corrisponde a una rappresentazione appartenente a un set, nel quale ciascuna rappresentazione dispone di una propria posizione specifica.
http.301=La risorsa richiesta ({0}) \u00E8 stata spostata definitivamente in una nuova posizione.
http.302=La risorsa richiesta ({0}) \u00E8 stata spostata temporaneamente in una nuova posizione.
http.303=La risposta a questa richiesta si trova sotto un URI diverso ({0}).
http.304=La risorsa richiesta ({0}) \u00E8 disponibile e non \u00E8 stata modificata.
http.305=\u00C8 necessario accedere alla risorsa richiesta ({0}) attraverso il proxy fornito dall''intestazione "Location".
http.400=La sintassi della richiesta inviata dal client \u00E8 errata ({0}).
http.401=Per questa richiesta \u00E8 necessaria l''autenticazione HTTP ({0}).
http.402=\u00C8 richiesto il pagamento per accedere a questa risorsa ({0}).
http.403=\u00C8 stato vietato l''accesso alla risorsa specificata ({0}).
http.404=La risorsa richiesta ({0}) non \u00E8 disponibile.
http.405=Il metodo HTTP specificato non \u00E8 consentito per la risorsa richiesta ({0}).
http.406=La risorsa identificata da questa richiesta pu\u00F2 generare solo risposte con caratteristiche non accettabili in base alle intestazioni "accept" della richiesta ({0}).
http.407=Il client deve prima eseguire l''autenticazione presso il proxy ({0}).
http.408=Il client non ha effettuato richieste entro il tempo assegnato allo scopo dal server ({0}).
http.409=Non \u00E8 stato possibile completare la richiesta a causa di un conflitto con lo stato corrente della risorsa ({0}).
http.410=La risorsa richiesta ({0}) non \u00E8 pi\u00F9 disponibile e non \u00E8 noto alcun indirizzo di inoltro.
http.411=La richiesta non pu\u00F2 essere gestita senza una lunghezza definita del contenuto ({0}).
http.412=Una precondizione specificata non \u00E8 riuscita per questa richiesta ({0}).
http.413=L'entit\u00E0 della richiesta \u00E8 maggiore di quanto il server accetti o sia in grado di elaborare.
http.414=Il server ha rifiutato questa richiesta perch\u00E9 il relativo URI \u00E8 troppo lungo ({0}).
http.415=Il server ha rifiutato questa richiesta perch\u00E9 il formato dell''entit\u00E0 della richiesta non \u00E8 supportato dalla risorsa richiesta per il metodo richiesto ({0}).
http.416=Impossibile soddisfare l''intervallo di byte richiesto ({0}).
http.417=Impossibile soddisfare la previsione fornita nell''intestazione "Expect" della richiesta ({0}).
http.422=Il server ha riconosciuto il tipo di contenuto e la sintassi della richiesta ma non \u00E8 stato in grado di elaborare le istruzioni contenute ({0}).
http.423=La risorsa di origine o di destinazione di un metodo \u00E8 bloccata ({0}).
http.500=Il server ha rilevato un errore interno ({0}) che ha impedito di soddisfare questa richiesta.
http.501=Il server non supporta la funzionalit\u00E0 necessaria per soddisfare questa richiesta ({0}).
http.502=Il server, agendo da proxy o da gateway, ha ricevuto una risposta non valida da un server consultato ({0}).
http.503=Il servizio richiesto ({0}) non \u00E8 attualmente disponibile.
http.504=Il server, agendo da proxy o da gateway, ha ricevuto un timeout da un server precedente ({0}).
http.505=Il server non supporta la versione del protocollo HTTP richiesto ({0}).
http.507=La risorsa non dispone di spazio sufficiente per registrare lo stato della risorsa dopo l''esecuzione di questo metodo ({0}).
