#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
#
# This file incorporates work covered by the following copyright and
# permission notice:
#
# Copyright 2004 The Apache Software Foundation
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

#
# Message IDs reserved for this file: PWC3710-PWC3979
#
accessLogValve.alreadyStarted=PWC3710: ya se ha iniciado el registrador de acceso
accessLogValve.notStarted=PWC3711: a\u00FAn no se ha iniciado el registrador de acceso

# Error report valve
errorReportValve.errorReport=Informe de Errores
errorReportValve.statusHeader=Estado de HTTP {0}: {1}
errorReportValve.exceptionReport=Informe de Excepci\u00F3n
errorReportValve.statusReport=Informe de Estado
errorReportValve.message=Mensaje
errorReportValve.description=Descripci\u00F3n
errorReportValve.exception=Excepci\u00F3n
errorReportValve.rootCause=Causa Ra\u00EDz
errorReportValve.note=Nota
errorReportValve.rootCauseInLogs=Los rastreos de pila completos de la excepci\u00F3n y sus causas ra\u00EDz est\u00E1n disponibles en los logs {0}.

# HTTP status reports
http.100=El cliente puede continuar ({0}).
http.101=El servidor est\u00E1 cambiando protocolos seg\u00FAn el encabezado "Actualizar" ({0}).
http.201=La solicitud es correcta y se ha creado un nuevo recurso ({0}) en el servidor.
http.202=Se ha aceptado esta solicitud para su procesamiento, pero no se ha completado ({0}).
http.203=La metainformaci\u00F3n presentada por el cliente no se ha originado en el servidor ({0}).
http.204=La solicitud es correcta, pero no hay ninguna informaci\u00F3n que devolver ({0}).
http.205=El cliente debe restablecer la vista de documento que ha causado que se env\u00EDe esta solicitud ({0}).
http.206=El servidor ha cumplido la solicitud GET parcial para este recurso ({0}).
http.207=Se han devuelto varios valores de estado ({0}).
http.300=El recurso solicitado ({0}) corresponde a uno de los juegos de representaciones, cada uno con su propia ubicaci\u00F3n espec\u00EDfica.
http.301=El recurso solicitado ({0}) se ha movido permanentemente a una nueva ubicaci\u00F3n.
http.302=El recurso solicitado ({0}) se ha movido temporalmente a una nueva ubicaci\u00F3n.
http.303=La respuesta a esta solicitud se puede encontrar en un URI diferente ({0}).
http.304=El recurso solicitado ({0}) est\u00E1 disponible y no se ha modificado.
http.305=Se debe acceder al recurso solicitado ({0}) mediante el proxy proporcionado en la cabecera de ubicaci\u00F3n.
http.400=La solicitud enviada por el cliente es sint\u00E1cticamente incorrecta ({0}).
http.401=Esta solicitud necesita una autenticaci\u00F3n HTTP ({0}).
http.402=El pago es necesario para acceder a este recurso ({0}).
http.403=El acceso al recurso especificado ({0}) se ha prohibido.
http.404=El recurso solicitado ({0}) no est\u00E1 disponible.
http.405=El m\u00E9todo HTTP especificado no est\u00E1 permitido para el recurso solicitado ({0}).
http.406=El recurso identificado por la solicitud s\u00F3lo puede generar respuestas con caracter\u00EDsticas no aceptables seg\u00FAn las cabeceras de aceptaci\u00F3n de la solicitud ({0}).
http.407=El cliente se debe autenticar en primer lugar a s\u00ED mismo con el proxy ({0}).
http.408=El cliente no ha producido ninguna solicitud durante el tiempo que el servidor estaba preparado para la espera ({0}).
http.409=No se ha podido terminar la solicitud debido a un conflicto con el estado actual del recurso ({0}).
http.410=El recurso solicitado ({0}) ya no est\u00E1 disponible y no se conoce la direcci\u00F3n de reenv\u00EDo.
http.411=Esta solicitud no se puede manejar sin una longitud de contenido definida ({0}).
http.412=Ha fallado una condici\u00F3n previa especificada para esta solicitud ({0}).
http.413=La entidad de solicitud es m\u00E1s grande de lo que el servidor puede procesar.
http.414=El servidor ha rechazado esta solicitud porque el URI de solicitud es demasiado largo ({0}).
http.415=El servidor ha rechazado esta solicitud porque la entidad de solicitud est\u00E1 en un formato no soportado por el recurso solicitado para el m\u00E9todo solicitado ({0}).
http.416=El rango de bytes solicitado no se puede cumplir ({0}).
http.417=No se han podido cumplir los valores esperados proporcionados en la cabecera de solicitud de espera ({0}).
http.422=El servidor ha interpretado la sintaxis y el tipo de contenido de la solicitud, pero no ha podido procesar las instrucciones incluidas ({0}).
http.423=El recurso de origen o destino de un m\u00E9todo est\u00E1 bloqueado ({0}).
http.500=El servidor ha encontrado un error interno ({0}) que ha evitado que se cumpla esta solicitud.
http.501=El servidor no soporta la funcionalidad necesaria para cumplir esta solicitud ({0}).
http.502=Este servidor ha recibido una respuesta no v\u00E1lida de un servidor consultado al actuar como proxy o gateway ({0}).
http.503=El servicio solicitado ({0}) no est\u00E1 disponible actualmente.
http.504=El servidor ha recibido un timeout de un servidor de direcci\u00F3n ascendente al actuar como gateway o proxy ({0}).
http.505=El servidor no soporta la versi\u00F3n del protocolo HTTP solicitado ({0}).
http.507=El recurso no tiene suficiente espacio para registrar el estado de un recurso despu\u00E9s de la ejecuci\u00F3n de este m\u00E9todo ({0}).
