#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 1997-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#
#
# This file incorporates work covered by the following copyright and
# permission notice:
#
# Copyright 2004 The Apache Software Foundation
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

#
# Message IDs reserved for this file: PWC3710-PWC3979
#
accessLogValve.alreadyStarted=PWC3710 : le journaliseur d'acc\u00E8s a d\u00E9j\u00E0 \u00E9t\u00E9 d\u00E9marr\u00E9
accessLogValve.notStarted=PWC3711 : le journaliseur d'acc\u00E8s n'a pas encore \u00E9t\u00E9 d\u00E9marr\u00E9

# Error report valve
errorReportValve.errorReport=Rapport d'erreurs
errorReportValve.statusHeader=Statut HTTP {0} - {1}
errorReportValve.exceptionReport=Rapport sur les exceptions
errorReportValve.statusReport=Rapport de statut
errorReportValve.message=message
errorReportValve.description=description
errorReportValve.exception=exception
errorReportValve.rootCause=cause premi\u00E8re
errorReportValve.note=remarque
errorReportValve.rootCauseInLogs=Les traces de pile compl\u00E8tes de l''exception et leurs causes premi\u00E8res sont disponibles dans les journaux {0}.

# HTTP status reports
http.100=Le client peut continuer ({0}).
http.101=Le serveur change de protocoles en fonction de l''en-t\u00EAte "Upgrade" ({0}).
http.201=La demande a \u00E9t\u00E9 effectu\u00E9e et une ressource ({0}) a \u00E9t\u00E9 cr\u00E9\u00E9e sur le serveur.
http.202=La demande a \u00E9t\u00E9 accept\u00E9e pour traitement, mais n''a pas \u00E9t\u00E9 pas termin\u00E9e ({0}).
http.203=Les m\u00E9tadonn\u00E9es pr\u00E9sent\u00E9es par le client ne provenaient pas du serveur ({0}).
http.204=La demande a \u00E9t\u00E9 effectu\u00E9e, mais il n''existe aucune information \u00E0 renvoyer ({0}).
http.205=Le client doit r\u00E9initialiser la vue de document qui a provoqu\u00E9 l''envoi de cette demande ({0}).
http.206=Le serveur a r\u00E9pondu \u00E0 une demande GET partielle pour cette ressource ({0}).
http.207=Plusieurs valeurs de statut ont \u00E9t\u00E9 renvoy\u00E9es ({0}).
http.300=La ressource demand\u00E9e ({0}) correspond \u00E0 n''importe quelle repr\u00E9sentation d''un ensemble de repr\u00E9sentations, chacune poss\u00E9dant un emplacement sp\u00E9cifique.
http.301=La ressource demand\u00E9e ({0}) a \u00E9t\u00E9 d\u00E9plac\u00E9e d\u00E9finitivement vers un nouvel emplacement.
http.302=La ressource demand\u00E9e ({0}) a \u00E9t\u00E9 d\u00E9plac\u00E9e temporairement vers un nouvel emplacement.
http.303=La r\u00E9ponse \u00E0 cette demande peut \u00EAtre trouv\u00E9e sous un URI diff\u00E9rent ({0}).
http.304=La ressource demand\u00E9e ({0}) est disponible et n''a pas \u00E9t\u00E9 modifi\u00E9e.
http.305=Vous devez acc\u00E9der \u00E0 la ressource demand\u00E9e ({0}) via le proxy indiqu\u00E9 par l''en-t\u00EAte "Location".
http.400=La syntaxe de la demande envoy\u00E9e par le client \u00E9tait incorrecte ({0}).
http.401=Cette demande exige une authentification HTTP ({0}).
http.402=Le paiement est obligatoire pour acc\u00E9der \u00E0 cette ressource ({0}).
http.403=L''acc\u00E8s \u00E0 la ressource indiqu\u00E9e ({0}) a \u00E9t\u00E9 interdit.
http.404=La ressource demand\u00E9e ({0}) n''est pas disponible.
http.405=La m\u00E9thode HTTP indiqu\u00E9e n''est pas autoris\u00E9e pour la ressource demand\u00E9e ({0}).
http.406=La ressource identifi\u00E9e par cette demande ne peut g\u00E9n\u00E9rer que des r\u00E9ponses dont les caract\u00E9ristiques ne sont pas acceptables compte tenu des en-t\u00EAtes "accept" de la demande ({0}).
http.407=Le client doit d''abord s''authentifier aupr\u00E8s du proxy ({0}).
http.408=Le client n''a \u00E9mis aucune demande pendant le temps d''attente pr\u00E9vu par le serveur ({0}).
http.409=La demande n''a pas abouti en raison d''un conflit avec l''\u00E9tat en cours de la ressource ({0}).
http.410=La ressource demand\u00E9e ({0}) n''est plus disponible et aucune adresse de transfert n''est connue.
http.411=Cette demande ne peut pas \u00EAtre trait\u00E9e en l''absence d''une longueur de contenu d\u00E9finie ({0}).
http.412=Echec d''une condition pr\u00E9alable indiqu\u00E9e pour cette demande ({0}).
http.413=La taille de l'entit\u00E9 de demande est sup\u00E9rieure \u00E0 celle que le serveur est en mesure de traiter.
http.414=Le serveur a refus\u00E9 cette demande car l''URI de cette derni\u00E8re \u00E9tait trop long ({0}).
http.415=Le serveur a refus\u00E9 cette demande car l''entit\u00E9 de demande est dans un format non pris en charge par la ressource demand\u00E9e pour la m\u00E9thode souhait\u00E9e ({0}).
http.416=Impossible de satisfaire la plage d''octets demand\u00E9e ({0}).
http.417=L''attente indiqu\u00E9e dans l''en-t\u00EAte de demande "Expect" ({0}) n''a pas pu \u00EAtre satisfaite.
http.422=Le serveur a reconnu le type de contenu et la syntaxe de la demande, mais n''a pas pu traiter les instructions y figurant ({0}).
http.423=La ressource source ou de destination d''une m\u00E9thode est verrouill\u00E9e ({0}).
http.500=Le serveur a rencontr\u00E9 une erreur interne ({0}) l''emp\u00EAchant de satisfaire cette demande.
http.501=Le serveur ne prend pas en charge la fonctionnalit\u00E9 n\u00E9cessaire au traitement de cette demande ({0}).
http.502=Ce serveur a re\u00E7u une r\u00E9ponse non valide de la part d''un serveur qu''il a consult\u00E9 lorsqu''il agissait en tant que proxy ou passerelle ({0}).
http.503=Le service demand\u00E9 ({0}) est actuellement indisponible.
http.504=Le serveur a re\u00E7u une expiration de la part d''un serveur en amont alors qu''il agissait en tant que passerelle ou proxy ({0}).
http.505=Le serveur ne prend pas en charge la version de protocole HTTP demand\u00E9e ({0}).
http.507=La ressource ne dispose pas de l''espace suffisant pour enregistrer l''\u00E9tat de la ressource apr\u00E8s l''ex\u00E9cution de cette m\u00E9thode ({0}).
