#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

cannotAddDuplicate={0}\u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059: \u91CD\u8907\u3059\u308B\u3082\u306E\u3092\u8FFD\u52A0\u3067\u304D\u307E\u305B\u3093
noSuchAgent=\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSystemConnector=\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{0}\u306B\u306F\u3001{1}\u3068\u3044\u3046\u30B7\u30B9\u30C6\u30E0\u30FB\u30B3\u30CD\u30AF\u30BF\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchInstance=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchConfig=\u69CB\u6210{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noMkdir=\u69CB\u6210\u56FA\u6709\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA{0}\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
noAdminService=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{1}\u304C\u53C2\u7167\u3059\u308B\u69CB\u6210{0}\u306B\u306Fadmin-service\u8981\u7D20\u304C\u542B\u307E\u308C\u307E\u305B\u3093\u3002
noInstanceSystemConnector=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306B\u306F\u3001{1}\u3068\u3044\u3046\u30B7\u30B9\u30C6\u30E0\u30FB\u30B3\u30CD\u30AF\u30BF\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noDASAuthenticationProperty={0}\u306E\u30B7\u30B9\u30C6\u30E0\u30FB\u30B3\u30CD\u30AF\u30BF\u7528\u306EDAS\u8A8D\u8A3C\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchCluster=\u30AF\u30E9\u30B9\u30BF{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchNode=\u30CE\u30FC\u30C9{0}\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchClusterInstance=\u30AF\u30E9\u30B9\u30BF{0}\u306B\u306F\u3001\u5B58\u5728\u3057\u306A\u3044\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{1}\u304C\u542B\u307E\u308C\u307E\u3059\u3002
noSuchClusterConfig=\u30AF\u30E9\u30B9\u30BF{1}\u304C\u53C2\u7167\u3059\u308B\u69CB\u6210{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noSuchAgentForInstance=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306F\u3001\u5B58\u5728\u3057\u306A\u3044\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{1}\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
noSuchClusteredInstance=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306F\u30AF\u30E9\u30B9\u30BF\u306E\u4E00\u90E8\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
noAgentSystemConnector=\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{0}\u306B\u306F\u3001{1}\u3068\u3044\u3046\u30B7\u30B9\u30C6\u30E0\u30FB\u30B3\u30CD\u30AF\u30BF\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
missingInstanceConnectorAuth=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u306B\u5FC5\u8981\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
missingAgentConnectorAuth=\u30CE\u30FC\u30C9\u30FB\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8{0}\u306B\u5FC5\u8981\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

noDASFound=\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u3092\u8B58\u5225\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F

tooManyDASFound=\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{0}\u304A\u3088\u3073{1}\u306F\u3001\u3069\u3061\u3089\u3082\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u30B5\u30FC\u30D0\u30FC\u3068\u3057\u3066\u8B58\u5225\u3055\u308C\u307E\u3057\u305F\u3002

noSuchResource=\u30EA\u30BD\u30FC\u30B9{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093
noSuchApplication=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093

illegalName=\u540D\u524D\u304C\u4E0D\u6B63\u3067\u3059\u3002\u540D\u524D\u306B\u3053\u306E\u6587\u5B57\u5217\u3092\u7D44\u307F\u8FBC\u3080\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093: {0}
CorruptClusterConfig=\u30AF\u30E9\u30B9\u30BF[{0}]\u304C\u4E0D\u6574\u5408\u306A\u72B6\u614B\u306B\u3042\u308A\u307E\u3059\u3002\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u3059\u3079\u3066\u304CMbean [{1}]\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u308F\u3051\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30B5\u30DE\u30EA\u30FC\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059: {2}\u3002
Cluster.no_default_config_found=\u30C7\u30D5\u30A9\u30EB\u30C8\u69CB\u6210\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u30AF\u30E9\u30B9\u30BF{1}\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u69CB\u6210\u3068\u3057\u3066\u69CB\u6210{0}\u3092\u4F7F\u7528\u3057\u307E\u3059
Server.cannotSpecifyBothConfigAndCluster=\u69CB\u6210\u540D\u3068\u30AF\u30E9\u30B9\u30BF\u540D\u306E\u4E21\u65B9\u3092\u6307\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
Cluster.noDefaultConfig=domain.xml\u3067\u30C7\u30D5\u30A9\u30EB\u30C8\u69CB\u6210(\u300Cdefault-config\u300D\u3068\u3044\u3046\u540D\u524D\u306E\u8981\u7D20)\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u6B21\u56DE\u306F\u65E2\u5B58\u306Econfig\u8981\u7D20\u306E\u540D\u524D\u3092\u6307\u5B9A\u3067\u304D\u307E\u3059\u3002
Server.HostNotFound=nodeagent-ref [{0}]\u3092IP\u30A2\u30C9\u30EC\u30B9\u306B\u89E3\u6C7A\u3067\u304D\u307E\u305B\u3093\u3002
Server.LocalHostNotFound=\u30ED\u30FC\u30AB\u30EB\u306E\u30DB\u30B9\u30C8\u540D\u3092\u89E3\u6C7A\u3067\u304D\u307E\u305B\u3093\u3002
Server.cannotHaveSameAdminPortAsDAS=DAS\u3068\u540C\u3058\u30DB\u30B9\u30C8\u3067\u3001DAS\u3068\u540C\u3058\u7BA1\u7406\u30DD\u30FC\u30C8\u3092\u4F7F\u7528\u3057\u3066\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093: {0}\u3002

Cluster.error_while_copying=\u30C7\u30D5\u30A9\u30EB\u30C8\u69CB\u6210{0}\u306E\u30B3\u30D4\u30FC\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
Cluster.error_while_settingConfig=\u30AF\u30E9\u30B9\u30BF{1} {2}\u306E\u69CB\u6210{0}\u306E\u8A2D\u5B9A\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
deleteConfigFailed=\u69CB\u6210{0}\u3092\u9664\u53BB\u3067\u304D\u307E\u305B\u3093
deleteServerRefFailed=server-ref {0}\u3092\u30AF\u30E9\u30B9\u30BF{1}\u304B\u3089\u9664\u53BB\u3067\u304D\u307E\u305B\u3093
Cluster.hasInstances=\u30AF\u30E9\u30B9\u30BF{0}\u306B\u306F\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9{1}\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u4ED6\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093
Cluster.obsoleteOptions=\u5EC3\u6B62\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
cannot.execute.command=\u30AF\u30E9\u30B9\u30BF\u30FB\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002

# CRUD commands related strings.

create.cluster.command=\u65B0\u898FGlassFish\u30AF\u30E9\u30B9\u30BF\u3092\u4F5C\u6210\u3057\u307E\u3059
create.cluster.command.name=\u3053\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u30BF\u306E\u540D\u524D
delete.cluster.command=\u65E2\u5B58\u306E\u30AF\u30E9\u30B9\u30BF\u3092\u524A\u9664\u3057\u307E\u3059

generic.config=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u3067\u4F7F\u7528\u3059\u308B\u65E2\u5B58\u306E\u69CB\u6210\u540D

config.copyConfigError={0}\u304C\u539F\u56E0\u3067\u3001\u69CB\u6210\u306E\u30B3\u30D4\u30FC\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
config.mkdirs=\u69CB\u6210\u56FA\u6709\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u4F5C\u6210\u4E2D\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F

# validation messages
cluster.invalid.name=\u30AF\u30E9\u30B9\u30BF\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u3001\u6570\u5B57\u3001\u307E\u305F\u306F\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30CF\u30A4\u30D5\u30F3\u3001\u30D4\u30EA\u30AA\u30C9\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30BB\u30DF\u30B3\u30ED\u30F3\u306E\u307F\u3067\u3059\u3002
server.invalid.name=\u30B5\u30FC\u30D0\u30FC\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u3001\u6570\u5B57\u3001\u307E\u305F\u306F\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30CF\u30A4\u30D5\u30F3\u3001\u30D4\u30EA\u30AA\u30C9\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30BB\u30DF\u30B3\u30ED\u30F3\u306E\u307F\u3067\u3059\u3002
appref.invalid.name=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u3001\u6570\u5B57\u3001\u307E\u305F\u306F\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30CF\u30A4\u30D5\u30F3\u3001\u30D4\u30EA\u30AA\u30C9\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30B9\u30E9\u30C3\u30B7\u30E5\u3001\u30B3\u30ED\u30F3\u3001\u30CF\u30C3\u30B7\u30E5\u3001\u30BB\u30DF\u30B3\u30ED\u30F3\u306E\u307F\u3067\u3059\u3002
node.invalid.name=\u30CE\u30FC\u30C9\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u307E\u305F\u306F\u6570\u5B57\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u304A\u3088\u3073\u305D\u306E\u4ED6\u306E\u7279\u5B9A\u306E\u8A18\u53F7\u306E\u307F\u3067\u3059\u3002
config.invalid.name=\u69CB\u6210\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u3001\u6570\u5B57\u3001\u307E\u305F\u306F\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30CF\u30A4\u30D5\u30F3\u3001\u30D4\u30EA\u30AA\u30C9\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30BB\u30DF\u30B3\u30ED\u30F3\u306E\u307F\u3067\u3059\u3002
nodehost.invalid.name=\u30CE\u30FC\u30C9\u30FB\u30DB\u30B9\u30C8\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u307E\u305F\u306F\u6570\u5B57\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u304A\u3088\u3073\u305D\u306E\u4ED6\u306E\u7279\u5B9A\u306E\u8A18\u53F7\u306E\u307F\u3067\u3059\u3002
windowsdomain.invalid.name=Windows\u30C9\u30E1\u30A4\u30F3\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u540D\u524D\u306F\u6587\u5B57\u307E\u305F\u306F\u6570\u5B57\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u304A\u3088\u3073\u305D\u306E\u4ED6\u306E\u7279\u5B9A\u306E\u8A18\u53F7\u306E\u307F\u3067\u3059\u3002

config.duplicate.name= \u6307\u5B9A\u3055\u308C\u305F\u69CB\u6210\u540D\u304C\u30C9\u30E1\u30A4\u30F3\u5185\u3067\u91CD\u8907\u3057\u307E\u3059\u3002\u4E00\u610F\u306E\u69CB\u6210\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
cluster.duplicate.name= \u6307\u5B9A\u3055\u308C\u305F\u30AF\u30E9\u30B9\u30BF\u540D\u304C\u30C9\u30E1\u30A4\u30F3\u5185\u3067\u91CD\u8907\u3057\u307E\u3059\u3002\u4E00\u610F\u306E\u30AF\u30E9\u30B9\u30BF\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
server.duplicate.name= \u6307\u5B9A\u3055\u308C\u305F\u30B5\u30FC\u30D0\u30FC\u540D\u304C\u30C9\u30E1\u30A4\u30F3\u5185\u3067\u91CD\u8907\u3057\u307E\u3059\u3002\u4E00\u610F\u306E\u30B5\u30FC\u30D0\u30FC\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
node.duplicate.name=\u6307\u5B9A\u3055\u308C\u305F\u30CE\u30FC\u30C9\u540D\u304C\u30C9\u30E1\u30A4\u30F3\u5185\u3067\u91CD\u8907\u3057\u307E\u3059\u3002\u4E00\u610F\u306E\u30CE\u30FC\u30C9\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002

cluster.reserved.name=\u6307\u5B9A\u3055\u308C\u305F\u30AF\u30E9\u30B9\u30BF\u540D\u306F\u4E88\u7D04\u8A9E\u3067\u3059\u3002\u4E88\u7D04\u8A9E\u3067\u306A\u3044\u30AF\u30E9\u30B9\u30BF\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
config.reserved.name=\u6307\u5B9A\u3055\u308C\u305F\u69CB\u6210\u540D\u306F\u4E88\u7D04\u8A9E\u3067\u3059\u3002\u4E88\u7D04\u8A9E\u3067\u306A\u3044\u69CB\u6210\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
node.reserved.name=\u6307\u5B9A\u3055\u308C\u305F\u30CE\u30FC\u30C9\u540D\u306F\u4E88\u7D04\u8A9E\u3067\u3059\u3002\u4E88\u7D04\u8A9E\u3067\u306A\u3044\u30CE\u30FC\u30C9\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
server.reserved.name=\u6307\u5B9A\u3055\u308C\u305F\u30B5\u30FC\u30D0\u30FC\u540D\u306F\u4E88\u7D04\u8A9E\u3067\u3059\u3002\u4E88\u7D04\u8A9E\u3067\u306A\u3044\u30B5\u30FC\u30D0\u30FC\u540D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002

port-pattern=1\u304B\u308965535\u306E\u5024\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u306F\u3001${SYSTEM_PROPERTY_NAME}\u306E\u5F62\u5F0F\u3092\u4F7F\u7528\u3057\u3066\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u53C2\u7167\u3057\u307E\u3059\u3002
resourcepool.invalid.name.key=\u30D7\u30FC\u30EB\u540D\u304C\u7121\u52B9\u3067\u3059\u3002\u30D7\u30FC\u30EB\u540D\u306F\u6587\u5B57\u3001\u6570\u5B57\u3001\u307E\u305F\u306F\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3067\u59CB\u3081\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u540D\u524D\u306B\u4F7F\u7528\u3067\u304D\u308B\u306E\u306F\u3001\u6587\u5B57\u3001\u6570\u5B57\u3001\u30CF\u30A4\u30D5\u30F3\u3001\u30A2\u30F3\u30C0\u30FC\u30B9\u30B3\u30A2\u3001\u30D4\u30EA\u30AA\u30C9\u3001\u30B9\u30E9\u30C3\u30B7\u30E5\u3001\u30BB\u30DF\u30B3\u30ED\u30F3\u3001\u30B3\u30ED\u30F3\u3001\u30CF\u30C3\u30B7\u30E5\u306E\u307F\u3067\u3059\u3002\u30D7\u30FC\u30EB\u540D\u306B\u7A7A\u767D\u6587\u5B57\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
resourcename.invalid.character=\u30EA\u30BD\u30FC\u30B9\u540D\u306B\u300C:\u300D\u6587\u5B57\u3092\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093

resource.invalid=\u7121\u52B9\u306A\u30D7\u30FC\u30EB\u540D\u3067\u3059\u3002\u30D7\u30FC\u30EB\u304C\u5B58\u5728\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
resourceref.invalid.poolname=\u7121\u52B9\u306A\u30D7\u30FC\u30EB\u540D\u3067\u3059\u3002\u30D7\u30FC\u30EB\u304C\u5B58\u5728\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002


SecureAdminPrincipalResolver.configTypeNotNamed=\u69CB\u6210\u30BF\u30A4\u30D7{0}\u306F{1}\u3092\u62E1\u5F35\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u304C\u62E1\u5F35\u3057\u3066\u3044\u307E\u305B\u3093
SecureAdminPrincipalResolver.target_object_not_found={1}\u3068\u3044\u3046\u540D\u524D\u306E{0}\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093
SecureAdmin.running.old.config=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306F\u3001\u53E4\u3044\u30EA\u30EA\u30FC\u30B9\u306E\u69CB\u6210\u307E\u305F\u306F\u7834\u640D\u3057\u305F\u69CB\u6210\u3067\u7A3C\u50CD\u3057\u3066\u3044\u308B\u3088\u3046\u3067\u3059\u3002\u30EA\u30EA\u30FC\u30B9\u30FB\u30CE\u30FC\u30C8\u306E\u8AAC\u660E\u306B\u5F93\u3063\u3066enable-secure-admin\u30B3\u30DE\u30F3\u30C9\u3092\u5B9F\u884C\u3057\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u4FDD\u8B77\u3055\u308C\u305F\u7BA1\u7406\u69CB\u6210\u3092\u66F4\u65B0\u3057\u3066\u304F\u3060\u3055\u3044\u3002

instanceCreationNotAllowed=\u30CE\u30FC\u30C9{0}\u306E\u30A4\u30F3\u30BF\u30F3\u30B9\u4F5C\u6210\u304C\u7121\u52B9\u306B\u306A\u3063\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u30CE\u30FC\u30C9\u3067\u306F\u65B0\u898F\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
nodeCreationNotAllowed=\u30CE\u30FC\u30C9\u4F5C\u6210\u304C\u7121\u52B9\u306B\u306A\u3063\u3066\u3044\u307E\u3059\u3002\u65B0\u898F\u30CE\u30FC\u30C9\u306F\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002

resourceref.invalid.configref=\u69CB\u6210\u3078\u306E\u53C2\u7167\u304C\u7121\u52B9\u3067\u3059\u3002\u69CB\u6210\u304C\u5B58\u5728\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

invalid.time.period.specified=\u7121\u52B9\u306A\u671F\u9593\u304C\u6307\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002h\u3001m\u307E\u305F\u306Fs\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u4F8B: 1h\u300160m\u30013600s

contextroot.duplicate=\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30D1\u30B9\u306B\u306F\u3001\u3059\u3067\u306B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u305F\u3081\u3001\u3053\u306E\u4EEE\u60F3\u30B5\u30FC\u30D0\u30FC\u306E\u3053\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30D1\u30B9\u306B\u306F\u3001\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093
