#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

cannotAddDuplicate={0} j\u00E1 existe: n\u00E3o \u00E9 poss\u00EDvel adicionar duplica\u00E7\u00E3o
noSuchAgent=Agente de N\u00F3 {0} n\u00E3o existe.
noSystemConnector=O Agente de N\u00F3 {0} n\u00E3o tem um conector de sistema com o nome {1}.
noSuchInstance=Inst\u00E2ncia de Servidor {0} n\u00E3o existe.
noSuchConfig=A configura\u00E7\u00E3o {0} n\u00E3o existe.
noMkdir=N\u00E3o \u00E9 poss\u00EDvel criar o diret\u00F3rio {0} espec\u00EDfico para a configura\u00E7\u00E3o.
noAdminService=A configura\u00E7\u00E3o {0} referenciada pela Inst\u00E2ncia do Servidor {1} n\u00E3o cont\u00E9m o elemento admin-service.
noInstanceSystemConnector=A Inst\u00E2ncia do Servidor {0} n\u00E3o possui conector de sistema chamada {1}.
noDASAuthenticationProperty=Propriedades de autentica\u00E7\u00E3o de DAS n\u00E3o existem para o conector de sistema de {0}.
noSuchCluster=O Cluster {0} n\u00E3o existe.
noSuchNode=O n\u00F3 {0} n\u00E3o existe.
noSuchClusterInstance=O Cluster {0} cont\u00E9m Inst\u00E2ncia do Servidor {1} que n\u00E3o existe.
noSuchClusterConfig=A configura\u00E7\u00E3o {0} referenciada pelo Cluster {1} n\u00E3o existe.
noSuchAgentForInstance=A Inst\u00E2ncia do Servidor {0} referencia um Agente de N\u00F3 {1} que n\u00E3o existe.
noSuchClusteredInstance=A Inst\u00E2ncia do Servidor {0} n\u00E3o faz parte de um cluster.
noAgentSystemConnector=O Agente de N\u00F3 {0} n\u00E3o tem um conector de sistema com o nome {1}.
missingInstanceConnectorAuth=N\u00E3o \u00E9 poss\u00EDvel encontrar propriedades necess\u00E1rias de conex\u00E3o de cliente para a Inst\u00E2ncia do Servidor {0}.
missingAgentConnectorAuth=N\u00E3o \u00E9 poss\u00EDvel encontrar propriedades necess\u00E1rias de conex\u00E3o de cliente para o Agente de N\u00F3 {0}.

noDASFound=N\u00E3o \u00E9 poss\u00EDvel identificar o Servidor de Administra\u00E7\u00E3o de Dom\u00EDnios

tooManyDASFound=As Inst\u00E2ncias do Servidor {0} e {1} foram identificadas como o Servidor de Administra\u00E7\u00E3o de Dom\u00EDnios.

noSuchResource=O recurso {0} n\u00E3o existe
noSuchApplication=A aplica\u00E7\u00E3o {0} n\u00E3o existe

illegalName=O nome \u00E9 inv\u00E1lido. N\u00E3o \u00E9 permitido que os nomes possuam esta String incorporada: {0}
CorruptClusterConfig=O cluster [{0}] est\u00E1 em um estado inconsistente. Nem todas as inst\u00E2ncias fazem refer\u00EAncia ao mbean [{1}]. Este \u00E9 o resumo: {2}.
Cluster.no_default_config_found=Nenhuma configura\u00E7\u00E3o default foi localizada, utilizando a configura\u00E7\u00E3o {0} como a configura\u00E7\u00E3o default para o cluster {1}
Server.cannotSpecifyBothConfigAndCluster=Os nomes de configura\u00E7\u00E3o e de cluster n\u00E3o podem ser especificados ao mesmo tempo.
Cluster.noDefaultConfig=N\u00E3o \u00E9 poss\u00EDvel localizar a configura\u00E7\u00E3o default (um elemento chamado "default-config") em domain.xml. Voc\u00EA pode especificar o nome de um elemento de configura\u00E7\u00E3o existente na pr\u00F3xima vez.
Server.HostNotFound=N\u00E3o \u00E9 poss\u00EDvel resolver nodeagent-ref [{0}] para um endere\u00E7o IP.
Server.LocalHostNotFound=N\u00E3o \u00E9 poss\u00EDvel resolver o nome do host local.
Server.cannotHaveSameAdminPortAsDAS=N\u00E3o \u00E9 poss\u00EDvel criar uma inst\u00E2ncia no mesmo host que o DAS com a mesma porta admin do DAS: {0}.

Cluster.error_while_copying=Ocorreu um erro ao copiar a configura\u00E7\u00E3o default {0}
Cluster.error_while_settingConfig=Ocorreu um erro ao definir a config {0} no cluster {1} {2}
deleteConfigFailed=N\u00E3o \u00E9 poss\u00EDvel remover a config {0}
deleteServerRefFailed=N\u00E3o \u00E9 poss\u00EDvel remover a server-ref {0} do cluster {1}
Cluster.hasInstances=O cluster {0} cont\u00E9m as inst\u00E2ncias de servidor {1} e n\u00E3o deve conter quaisquer inst\u00E2ncias
Cluster.obsoleteOptions=Op\u00E7\u00F5es obsoletas utilizadas.
cannot.execute.command=O software do cluster n\u00E3o foi instalado.

# CRUD commands related strings.

create.cluster.command=Cria um novo cluster do GlassFish
create.cluster.command.name=O nome do novo cluster
delete.cluster.command=Deleta um cluster existente

generic.config=O nome de config existente a ser utilizado por esse cluster

config.copyConfigError=Erro ao copiar config causado por {0}
config.mkdirs=erro ao criar diret\u00F3rios espec\u00EDficos para configura\u00E7\u00E3o

# validation messages
cluster.invalid.name=Nome de cluster inv\u00E1lido. O nome deve come\u00E7ar com uma letra, n\u00FAmero ou sublinhado e pode conter somente letras, n\u00FAmeros e estes caracteres: h\u00EDfen, ponto, sublinhado e ponto e v\u00EDrgula.
server.invalid.name=Nome de servidor inv\u00E1lido. O nome deve come\u00E7ar com uma letra, n\u00FAmero ou sublinhado e pode conter somente letras, n\u00FAmeros e estes caracteres: h\u00EDfen, ponto, sublinhado e ponto e v\u00EDrgula.
appref.invalid.name=Nome de aplica\u00E7\u00E3o inv\u00E1lido. O nome deve come\u00E7ar com uma letra, n\u00FAmero ou sublinhado e pode conter somente letras, n\u00FAmeros e estes caracteres: h\u00EDfen, ponto, sublinhado, barra, dois pontos, hash e ponto e v\u00EDrgula.
node.invalid.name=Nome de n\u00F3 inv\u00E1lido. O nome deve come\u00E7ar com uma letra ou n\u00FAmero e pode conter somente letras, n\u00FAmeros e determinados caracteres.
config.invalid.name=Nome de configura\u00E7\u00E3o inv\u00E1lido. O nome deve come\u00E7ar com uma letra, n\u00FAmero ou sublinhado e pode conter somente letras, n\u00FAmeros e estes caracteres: h\u00EDfen, ponto, sublinhado e ponto e v\u00EDrgula.
nodehost.invalid.name=Nome de host do n\u00F3 inv\u00E1lido. O nome deve come\u00E7ar com uma letra ou n\u00FAmero e pode conter somente letras, n\u00FAmeros e determinados caracteres.
windowsdomain.invalid.name=Nome do dom\u00EDnio inv\u00E1lido no Windows. O nome deve come\u00E7ar com uma letra ou n\u00FAmero e pode conter somente letras, n\u00FAmeros e determinados caracteres.

config.duplicate.name= O nome de configura\u00E7\u00E3o fornecido n\u00E3o \u00E9 exclusivo no dom\u00EDnio. Forne\u00E7a um nome de configura\u00E7\u00E3o exclusivo.
cluster.duplicate.name= O nome de cluster fornecido n\u00E3o \u00E9 exclusivo no dom\u00EDnio. Forne\u00E7a um nome de cluster exclusivo.
server.duplicate.name= O nome de servidor fornecido n\u00E3o \u00E9 exclusivo no dom\u00EDnio. Forne\u00E7a um nome de servidor exclusivo.
node.duplicate.name=O nome de n\u00F3 fornecido n\u00E3o \u00E9 exclusivo no dom\u00EDnio. Forne\u00E7a um nome de n\u00F3 exclusivo.

cluster.reserved.name=O nome de cluster fornecido \u00E9 uma palavra reservada. Forne\u00E7a um nome de cluster que n\u00E3o esteja reservado.
config.reserved.name=O nome de configura\u00E7\u00E3o fornecido \u00E9 uma palavra reservada. Forne\u00E7a um nome de configura\u00E7\u00E3o que n\u00E3o esteja reservado.
node.reserved.name=O nome de n\u00F3 fornecido \u00E9 uma palavra reservada. Forne\u00E7a um nome de n\u00F3 que n\u00E3o esteja reservado.
server.reserved.name=O nome de servidor fornecido n\u00E3o \u00E9 uma palavra reservada. Forne\u00E7a um nome de servidor que n\u00E3o esteja reservado.

port-pattern=deve estar entre 1 e 65535, ou fazer refer\u00EAncia a uma propriedade do sistema utilizando a forma ${SYSTEM_PROPERTY_NAME}
resourcepool.invalid.name.key=Nome do pool inv\u00E1lido. Um nome de pool deve come\u00E7ar com uma letra, n\u00FAmero ou sublinhado e s\u00F3 pode conter letras, n\u00FAmeros e estes caracteres especiais: h\u00EDfen, sublinhado, per\u00EDodo, barra, ponto e v\u00EDrgula, v\u00EDrgula e hash. O nome do pool n\u00E3o deve conter espa\u00E7os.
resourcename.invalid.character=o nome do recurso n\u00E3o pode conter o caractere ':'

resource.invalid=Nome do pool inv\u00E1lido. Verifique se o pool existe.
resourceref.invalid.poolname=Nome do pool inv\u00E1lido! Verifique se o pool existe.


SecureAdminPrincipalResolver.configTypeNotNamed=O tipo de configura\u00E7\u00E3o {0} deve estender {1}, mas n\u00E3o o faz
SecureAdminPrincipalResolver.target_object_not_found=N\u00E3o \u00E9 poss\u00EDvel localizar um {0} com o nome de {1}
SecureAdmin.running.old.config=Este servidor parece estar sendo executado com uma configura\u00E7\u00E3o corrompida ou uma vers\u00E3o mais antiga. Execute o comando enable-secure-admin conforme descrito nas notas de release para atualizar a configura\u00E7\u00E3o segura do admin.

instanceCreationNotAllowed=A cria\u00E7\u00E3o de inst\u00E2ncia \u00E9 desativada no n\u00F3 {0}. Nenhuma nova inst\u00E2ncia pode ser criada neste n\u00F3.
nodeCreationNotAllowed=A cria\u00E7\u00E3o de n\u00F3 \u00E9 desativada. Nenhum novo n\u00F3 pode ser criado.

resourceref.invalid.configref=Refer\u00EAncia inv\u00E1lida para configura\u00E7\u00E3o! Verifique se a configura\u00E7\u00E3o existe.

invalid.time.period.specified=Um per\u00EDodo de tempo inv\u00E1lido. Especifique h, m ou s. Por exemplo: 1h, 60m ou 3600s.

contextroot.duplicate=O servidor virtual j\u00E1 tem uma aplica\u00E7\u00E3o carregada neste caminho de contexto, dessa forma, esta aplica\u00E7\u00E3o n\u00E3o pode ser carregada neste caminho de contexto neste servidor virtual
