#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

cannotAddDuplicate={0} ist bereits vorhanden: Duplikat kann nicht hinzugef\u00FCgt werden
noSuchAgent=Knoten-Agent {0} ist nicht vorhanden.
noSystemConnector=Knoten-Agent {0} hat keinen System-Connector namens {1}.
noSuchInstance=Serverinstanz {0} ist nicht vorhanden.
noSuchConfig=Konfiguration {0} ist nicht vorhanden.
noMkdir=Konfigurationsspezifisches Verzeichnis {0} kann nicht erstellt werden.
noAdminService=Von Serverinstanz {1} referenzierte Konfiguration {0} enth\u00E4lt kein admin-service-Element.
noInstanceSystemConnector=Serverinstanz {0} hat keinen System-Connector namens {1}.
noDASAuthenticationProperty=Keine DAS-Authentifizierungseigenschaften f\u00FCr den System-Connector f\u00FCr {0} vorhanden.
noSuchCluster=Cluster {0} ist nicht vorhanden.
noSuchNode=Knoten {0} ist nicht vorhanden.
noSuchClusterInstance=Cluster {0} enth\u00E4lt Serverinstanz {1}, die nicht vorhanden ist.
noSuchClusterConfig=Von Cluster {1} referenzierte Konfiguration {0} ist nicht vorhanden.
noSuchAgentForInstance=Serverinstanz {0} referenziert einen Knoten-Agent {1}, der nicht vorhanden ist.
noSuchClusteredInstance=Serverinstanz {0} ist nicht Teil eines Clusters.
noAgentSystemConnector=Knoten-Agent {0} hat keinen System-Connector namens {1}.
missingInstanceConnectorAuth=F\u00FCr Serverinstanz {0} erforderliche Clientverbindungseigenschaften konnten nicht gefunden werden.
missingAgentConnectorAuth=F\u00FCr Knoten-Agent {0} erforderliche Clientverbindungseigenschaften konnten nicht gefunden werden.

noDASFound=Domainadministrationsserver konnte nicht identifiziert werden

tooManyDASFound=Serverinstanz {0} und {1} wurden als Domainadministrationsserver identifiziert.

noSuchResource=Ressource {0} ist nicht vorhanden
noSuchApplication=Anwendung {0} ist nicht vorhanden

illegalName=Der Name ist unzul\u00E4ssig. Folgende Zeichenfolge darf in Namen nicht eingebettet sein: {0}
CorruptClusterConfig=Das Cluster [{0}] befindet sich in einem inkonsistenten Status. Nicht alle Instanzen referenzieren das MBean [{1}]. \u00DCbersicht: {2}.
Cluster.no_default_config_found=Keine Standardkonfiguration gefunden. Konfiguration {0} wird als Standardkonfiguration f\u00FCr Cluster {1} verwendet
Server.cannotSpecifyBothConfigAndCluster=Es ist nicht zul\u00E4ssig, sowohl einen Konfigurationsnamen als auch einen Clusternamen anzugeben.
Cluster.noDefaultConfig=Standardkonfiguration (Element mit dem Namen "default-config") kann in domain.xml nicht gefunden werden. Sie k\u00F6nnen den Namen eines vorhandenen Konfigurationselements beim n\u00E4chsten Mal angeben.
Server.HostNotFound=nodeagent-ref [{0}] kann nicht in eine IP-Adresse aufgel\u00F6st werden.
Server.LocalHostNotFound=Lokaler Hostname kann nicht aufgel\u00F6st werden.
Server.cannotHaveSameAdminPortAsDAS=Auf demselben Host wie DAS kann mit demselben Admin-Port wie DAS keine Instanz erstellt werden: {0}.

Cluster.error_while_copying=Fehler beim Kopieren der Standardkonfiguration {0}
Cluster.error_while_settingConfig=Fehler beim Festlegen der Konfiguration {0} in Cluster {1} {2}
deleteConfigFailed=Konfiguration {0} kann nicht entfernt werden
deleteServerRefFailed=server-ref {0} kann nicht von Cluster {1} entfernt werden
Cluster.hasInstances=Cluster {0} enth\u00E4lt Serverinstanzen {1} und darf keine Instanzen enthalten
Cluster.obsoleteOptions=Veraltete Optionen verwendet.
cannot.execute.command=Clustersoftware ist nicht installiert.

# CRUD commands related strings.

create.cluster.command=Erstellt ein neues GlassFish-Cluster
create.cluster.command.name=Der Name f\u00FCr dieses neue Cluster
delete.cluster.command=L\u00F6scht ein vorhandenes Cluster

generic.config=Der von diesem Cluster zu verwendende vorhandene Konfigurationsname

config.copyConfigError=Fehler beim Kopieren der Konfiguration. Ursache: {0}
config.mkdirs=Fehler beim Erstellen der konfigurationsspezifischen Verzeichnisse

# validation messages
cluster.invalid.name=Ung\u00FCltiger Clustername. Der Name muss mit einem Buchstaben, einer Zahl oder einem Unterstrich beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und folgende Zeichen enthalten: Bindestrich, Punkt, Unterstrich und Semikolon.
server.invalid.name=Ung\u00FCltiger Servername. Der Name muss mit einem Buchstaben, einer Zahl oder einem Unterstrich beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und folgende Zeichen enthalten: Bindestrich, Punkt, Unterstrich und Semikolon.
appref.invalid.name=Ung\u00FCltiger Anwendungsname. Der Name muss mit einem Buchstaben, einer Zahl oder einem Unterstrich beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und folgende Zeichen enthalten: Bindestrich, Punkt, Unterstrich, Schr\u00E4gstrich, Doppelpunkt, Raute und Semikolon.
node.invalid.name=Ung\u00FCltiger Knotenname. Der Name muss mit einem Buchstaben oder einer Zahl beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und bestimmte andere Zeichen enthalten.
config.invalid.name=Ung\u00FCltiger Konfigurationsname. Der Name muss mit einem Buchstaben, einer Zahl oder einem Unterstrich beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und folgende Zeichen enthalten: Bindestrich, Punkt, Unterstrich und Semikolon.
nodehost.invalid.name=Ung\u00FCltiger Name f\u00FCr Knotenhost. Der Name muss mit einem Buchstaben oder einer Zahl beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und bestimmte andere Zeichen enthalten.
windowsdomain.invalid.name=Ung\u00FCltiger Windows-Domainname. Der Name muss mit einem Buchstaben oder einer Zahl beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und bestimmte andere Zeichen enthalten.

config.duplicate.name= Der angegebene Konfigurationsname ist in der Domain nicht eindeutig. Geben Sie einen eindeutigen Konfigurationsnamen an.
cluster.duplicate.name= Der angegebene Clustername ist in der Domain nicht eindeutig. Geben Sie einen eindeutigen Clusternamen an.
server.duplicate.name= Der angegebene Servername ist in der Domain nicht eindeutig. Geben Sie einen eindeutigen Servernamen an.
node.duplicate.name=Der angegebene Knotenname ist in der Domain nicht eindeutig. Geben Sie einen eindeutigen Knotennamen an.

cluster.reserved.name=Der angegebene Clustername ist ein reserviertes Wort. Geben Sie einen Clusternamen an, der nicht reserviert ist.
config.reserved.name=Der angegebene Konfigurationsname ist ein reserviertes Wort. Geben Sie einen Konfigurationsnamen an, der nicht reserviert ist.
node.reserved.name=Der angegebene Knotenname ist ein reserviertes Wort. Geben Sie einen Knotennamen an, der nicht reserviert ist.
server.reserved.name=Der angegebene Servername ist ein reserviertes Wort. Geben Sie einen Servernamen an, der nicht reserviert ist.

port-pattern=muss zwischen 1 und 65535 liegen oder anhand des Formats ${SYSTEM_PROPERTY_NAME} eine Systemeigenschaft referenzieren
resourcepool.invalid.name.key=Ung\u00FCltiger Poolname. Der Poolname muss mit einem Buchstaben, einer Zahl oder einem Unterstrich beginnen und darf ausschlie\u00DFlich Buchstaben, Zahlen und folgende Sonderzeichen enthalten: Bindestrich, Unterstrich, Punkt, Schr\u00E4gstrich, Semikolon, Doppelpunkt und Raute. Der Poolname darf keine Leerzeichen enthalten.
resourcename.invalid.character=Der Ressourcenname darf das Zeichen ":" nicht enthalten

resource.invalid=Ung\u00FCltiger Poolname. Pr\u00FCfen Sie, ob der Pool vorhanden ist.
resourceref.invalid.poolname=Ung\u00FCltiger Poolname. Pr\u00FCfen Sie, ob der Pool vorhanden ist.


SecureAdminPrincipalResolver.configTypeNotNamed=Konfigurationstyp {0} muss {1} erweitern. Dies ist aber nicht der Fall
SecureAdminPrincipalResolver.target_object_not_found={0} mit dem Namen {1} kann nicht gefunden werden
SecureAdmin.running.old.config=Dieser Server wird scheinbar mit einer Konfiguration aus einem \u00E4lteren Release oder einer fehlerhaften Konfiguration ausgef\u00FChrt. F\u00FChren Sie den Befehl "enable-secure-admin" gem\u00E4\u00DF den Versionshinweisen aus, um die sichere Admin-Konfiguration upzudaten.

instanceCreationNotAllowed=Die Instanzerstellung ist auf Knoten {0} deaktiviert. Auf diesem Knoten k\u00F6nnen keine neuen Instanzen erstellt werden.
nodeCreationNotAllowed=Die Knotenerstellung ist deaktiviert. Sie k\u00F6nnen keine neuen Knoten erstellen.

resourceref.invalid.configref=Ung\u00FCltige Konfigurationsreferenz. Pr\u00FCfen Sie, ob die Konfiguration vorhanden ist.

invalid.time.period.specified=Ein ung\u00FCltiger Zeitraum wurde angegeben. Geben Sie ihn in h, m oder s an. Beispiel: 1h, 60m 0r 3600s.

contextroot.duplicate=Auf den virtuellen Server wurde bereits auf diesem Kontextpfad eine Anwendung geladen; daher kann diese Anwendung nicht auf diesen Kontextpfad auf diesem virtuellen Server geladen werden
