#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

cannotAddDuplicate={0} existe d\u00E9j\u00E0 : impossible d''ajouter un doublon
noSuchAgent=L''agent de noeud {0} n''existe pas.
noSystemConnector=L''agent de noeud {0} ne dispose pas d''un connecteur syst\u00E8me nomm\u00E9 {1}.
noSuchInstance=L''instance de serveur {0} n''existe pas.
noSuchConfig=La configuration {0} n''existe pas.
noMkdir=Impossible de cr\u00E9er un r\u00E9pertoire propre \u00E0 la configuration {0}.
noAdminService=La configuration {0} r\u00E9f\u00E9renc\u00E9e par l''instance de serveur {1} ne contient aucun \u00E9l\u00E9ment admin-service.
noInstanceSystemConnector=L''instance de serveur {0} ne dispose pas d''un connecteur syst\u00E8me nomm\u00E9 {1}.
noDASAuthenticationProperty=Les propri\u00E9t\u00E9s d''authentification DAS n''existent pas pour le connecteur syst\u00E8me de {0}.
noSuchCluster=Le cluster {0} n''existe pas.
noSuchNode=Le noeud {0} n''existe pas.
noSuchClusterInstance=Le cluster {0} contient l''instance de serveur {1}, qui n''existe pas.
noSuchClusterConfig=La configuration {0} r\u00E9f\u00E9renc\u00E9e par le cluster {1} n''existe pas.
noSuchAgentForInstance=L''instance de serveur {0} r\u00E9f\u00E9rence l''agent de noeud {1}, qui n''existe pas.
noSuchClusteredInstance=L''instance de serveur {0} ne fait pas partie d''un cluster.
noAgentSystemConnector=L''agent de noeud {0} ne dispose pas d''un connecteur syst\u00E8me nomm\u00E9 {1}.
missingInstanceConnectorAuth=Les propri\u00E9t\u00E9s de connexion client requises sont introuvables pour l''instance de serveur {0}.
missingAgentConnectorAuth=Les propri\u00E9t\u00E9s de connexion client requises sont introuvables pour l''agent de noeud {0}.

noDASFound=Impossible d'identifier le serveur d'administration de domaine

tooManyDASFound=Les instances de serveur {0} et {1} ont toutes les deux \u00E9t\u00E9 identifi\u00E9es comme serveur d''administration de domaine.

noSuchResource=La ressource {0} n''existe pas.
noSuchApplication=L''application {0} n''existe pas.

illegalName=Ce nom est interdit. Les noms ne doivent pas contenir cette cha\u00EEne : {0}
CorruptClusterConfig=Le cluster [{0}] se trouve dans un \u00E9tat incoh\u00E9rent. Certaines instances ne r\u00E9f\u00E9rencent pas le MBean [{1}]. R\u00E9capitulatif : {2}.
Cluster.no_default_config_found=Configuration par d\u00E9faut introuvable, utilisation de la configuration {0} en tant que configuration par d\u00E9faut pour le cluster {1}
Server.cannotSpecifyBothConfigAndCluster=Vous ne pouvez pas indiquer \u00E0 la fois un nom de configuration et un nom de cluster.
Cluster.noDefaultConfig=Configuration par d\u00E9faut introuvable (\u00E9l\u00E9ment nomm\u00E9 "default-config") dans domain.xml. Vous pouvez sp\u00E9cifier le nom d'un \u00E9l\u00E9ment de configuration existant la prochaine fois.
Server.HostNotFound=Impossible de r\u00E9soudre l''\u00E9l\u00E9ment nodeagent-ref [{0}] en une adresse IP.
Server.LocalHostNotFound=Impossible de r\u00E9soudre le nom d'h\u00F4te local.
Server.cannotHaveSameAdminPortAsDAS=Impossible de cr\u00E9er une instance sur le m\u00EAme h\u00F4te que le serveur DAS ayant le m\u00EAme port d''administration que ce dernier : {0}.

Cluster.error_while_copying=Erreur lors de la copie de la configuration par d\u00E9faut {0}
Cluster.error_while_settingConfig=Erreur lors de la d\u00E9finition de la configuration {0} sur le cluster {1} {2}
deleteConfigFailed=Impossible de supprimer la configuration {0}
deleteServerRefFailed=Impossible de supprimer l''\u00E9l\u00E9ment server-ref {0} du cluster {1}
Cluster.hasInstances=Le cluster {0} contient des instances de serveur {1}, alors qu''il ne doit pas en contenir
Cluster.obsoleteOptions=Des options obsol\u00E8tes sont utilis\u00E9es.
cannot.execute.command=Le logiciel de cluster n'est pas install\u00E9.

# CRUD commands related strings.

create.cluster.command=Cr\u00E9e un cluster GlassFish
create.cluster.command.name=Nom du nouveau cluster
delete.cluster.command=Supprime un cluster existant

generic.config=Nom de la configuration existante \u00E0 utiliser par ce cluster

config.copyConfigError=Erreur lors de la copie de la configuration. Cause : {0}
config.mkdirs=erreur lors de la cr\u00E9ation de r\u00E9pertoires propres \u00E0 la configuration

# validation messages
cluster.invalid.name=Nom de cluster non valide. Le nom doit commencer par une lettre, un chiffre ou un trait de soulignement. Il ne peut contenir que des lettres, des chiffres et les caract\u00E8res suivants : trait d'union, point, trait de soulignement et point-virgule.
server.invalid.name=Nom de serveur non valide. Le nom doit commencer par une lettre, un chiffre ou un trait de soulignement. Il ne peut contenir que des lettres, des chiffres et les caract\u00E8res suivants : trait d'union, point, trait de soulignement et point-virgule.
appref.invalid.name=Nom d'application non valide. Le nom doit commencer par une lettre, un chiffre ou un trait de soulignement. Il ne peut contenir que des lettres, des chiffres et les caract\u00E8res suivants : trait d'union, point, trait de soulignement, barre oblique, deux-points, di\u00E8se et point-virgule.
node.invalid.name=Nom de noeud non valide. Le nom doit commencer par une lettre ou un chiffre et ne peut contenir que des lettres, des chiffres et certains autres caract\u00E8res.
config.invalid.name=Nom de configuration non valide. Le nom doit commencer par une lettre, un chiffre ou un trait de soulignement. Il ne peut contenir que des lettres, des chiffres et les caract\u00E8res suivants : trait d'union, point, trait de soulignement et point-virgule.
nodehost.invalid.name=Nom d'h\u00F4te de noeud non valide. Le nom doit commencer par une lettre ou un chiffre et ne peut contenir que des lettres, des chiffres et certains autres caract\u00E8res.
windowsdomain.invalid.name=Nom de domaine Windows non valide. Le nom doit commencer par une lettre ou un chiffre et ne peut contenir que des lettres, des chiffres et certains autres caract\u00E8res.

config.duplicate.name= Le nom de configuration fourni n'est pas unique dans le domaine. Indiquez un nom de configuration unique.
cluster.duplicate.name= Le nom de cluster fourni n'est pas unique dans le domaine. Indiquez un nom de cluster unique.
server.duplicate.name= Le nom de serveur fourni n'est pas unique dans le domaine. Indiquez un nom de serveur unique.
node.duplicate.name=Le nom de noeud fourni n'est pas unique dans le domaine. Indiquez un nom de noeud unique.

cluster.reserved.name=Le nom de cluster fourni est un mot r\u00E9serv\u00E9. Indiquez un nom de cluster qui n'est pas r\u00E9serv\u00E9.
config.reserved.name=Le nom de configuration fourni est un mot r\u00E9serv\u00E9. Indiquez un nom de configuration qui n'est pas r\u00E9serv\u00E9.
node.reserved.name=Le nom de noeud fourni est un mot r\u00E9serv\u00E9. Indiquez un nom de noeud qui n'est pas r\u00E9serv\u00E9.
server.reserved.name=Le nom de serveur fourni est un mot r\u00E9serv\u00E9. Indiquez un nom de serveur qui n'est pas r\u00E9serv\u00E9.

port-pattern=doit \u00EAtre compris entre 1 et 65535 ou r\u00E9f\u00E9rencer une propri\u00E9t\u00E9 syst\u00E8me au format ${SYSTEM_PROPERTY_NAME}
resourcepool.invalid.name.key=Nom de pool non valide. Le nom doit commencer par une lettre, un chiffre ou un trait de soulignement. Il ne peut contenir que des lettres, des chiffres et les caract\u00E8res sp\u00E9ciaux suivants : trait d'union, trait de soulignement, point, barre oblique, point-virgule, deux-points et di\u00E8se. Les noms de pool ne peuvent contenir aucun espace.
resourcename.invalid.character=le nom de ressource ne peut pas contenir le caract\u00E8re ':'

resource.invalid=Nom de pool non valide. V\u00E9rifiez que le pool existe.
resourceref.invalid.poolname=Nom de pool non valide. V\u00E9rifiez que le pool existe.


SecureAdminPrincipalResolver.configTypeNotNamed=Le type de configuration {0} doit \u00E9tendre {1}, mais ce n''est pas le cas
SecureAdminPrincipalResolver.target_object_not_found=Aucun \u00E9l\u00E9ment {0} ne porte le nom {1}
SecureAdmin.running.old.config=Ce serveur semble \u00EAtre ex\u00E9cut\u00E9 avec la configuration d'une ancienne version ou une configuration endommag\u00E9e. Ex\u00E9cutez la commande enable-secure-admin, comme indiqu\u00E9 dans les notes sur la version, afin de mettre \u00E0 jour la configuration d'administration s\u00E9curis\u00E9e.

instanceCreationNotAllowed=La cr\u00E9ation d''instance est d\u00E9sactiv\u00E9e sur le noeud {0}. Aucune instance suppl\u00E9mentaire ne peut \u00EAtre cr\u00E9\u00E9e sur ce noeud.
nodeCreationNotAllowed=La cr\u00E9ation de noeud est d\u00E9sactiv\u00E9e. Aucun noeud suppl\u00E9mentaire ne peut \u00EAtre cr\u00E9\u00E9.

resourceref.invalid.configref=R\u00E9f\u00E9rence \u00E0 la configuration non valide. V\u00E9rifiez si la configuration existe.

invalid.time.period.specified=Une p\u00E9riode non valide a \u00E9t\u00E9 indiqu\u00E9e. Sp\u00E9cifiez-la en h, m ou s. Ex : 1 h, 60 m ou 3 600 s.

contextroot.duplicate=Une application est d\u00E9j\u00E0 charg\u00E9e pour le serveur virtuel dans ce chemin de contexte. Cette application ne peut donc pas \u00EAtre charg\u00E9e dans ce chemin de contexte sur ce serveur virtuel
