#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

cannotAddDuplicate={0} ya existe: no se puede agregar duplicado
noSuchAgent=El agente del nodo {0} no existe.
noSystemConnector=El agente del nodo {0} no tiene ning\u00FAn conector del sistema denominado {1}.
noSuchInstance=La instancia del servidor {0} no existe.
noSuchConfig=La configuraci\u00F3n {0} no existe.
noMkdir=No se puede crear el directorio de configuraci\u00F3n espec\u00EDfico {0}.
noAdminService=La configuraci\u00F3n {0} a la que hace referencia la instancia del servidor {1} no contiene ning\u00FAn elemento admin-service.
noInstanceSystemConnector=La instancia del servidor {0} no tiene ning\u00FAn conector del sistema denominado {1}.
noDASAuthenticationProperty=No existen propiedades de autenticaci\u00F3n de DAS para el conector del sistema de {0}.
noSuchCluster=El cluster {0} no existe.
noSuchNode=El nodo {0} no existe.
noSuchClusterInstance=El cluster {0} contiene la instancia del servidor {1} que no existe.
noSuchClusterConfig=La configuraci\u00F3n {0} a la que hace referencia el cluster {1} no existe.
noSuchAgentForInstance=La instancia del servidor {0} hace referencia a un agente del nodo {1} que no existe.
noSuchClusteredInstance=La instancia del servidor {0} no forma parte de ning\u00FAn cluster.
noAgentSystemConnector=El agente del nodo {0} no tiene ning\u00FAn conector del sistema denominado {1}.
missingInstanceConnectorAuth=No se han encontrado las propiedades necesarias de conexi\u00F3n del cliente para la instancia del servidor {0}.
missingAgentConnectorAuth=No se han encontrado las propiedades necesarias de conexi\u00F3n del cliente para el agente del nodo {0}.

noDASFound=No se ha podido identificar el servidor de administraci\u00F3n de dominio

tooManyDASFound=Tanto la instancia del servidor {0} como {1} se han identificado como servidor de administraci\u00F3n de dominio.

noSuchResource=El recurso {0} no existe
noSuchApplication=La aplicaci\u00F3n {0} no existe

illegalName=El nombre no es v\u00E1lido. No se permite que los nombres tengan esta cadena embebida: {0}
CorruptClusterConfig=El cluster [{0}] se encuentra en un estado inconsistente. No todas las instancias hacen referencia al mbean [{1}]. A continuaci\u00F3n se muestra el resumen: {2}.
Cluster.no_default_config_found=No se ha encontrado ninguna configuraci\u00F3n por defecto que utilice {0} como configuraci\u00F3n por defecto del cluster {1}
Server.cannotSpecifyBothConfigAndCluster=No se pueden especificar a la vez un nombre de configuraci\u00F3n y de cluster.
Cluster.noDefaultConfig=No se ha encontrado la configuraci\u00F3n por defecto (un elemento denominado "default-config") en domain.xml. Puede especificar el nombre de un elemento de configuraci\u00F3n existente la pr\u00F3xima vez.
Server.HostNotFound=No se ha podido resolver nodeagent-ref [{0}] con una direcci\u00F3n IP.
Server.LocalHostNotFound=No se ha podido resolver el nombre de host local.
Server.cannotHaveSameAdminPortAsDAS=No se puede crear una instancia en el mismo host que el DAS con el mismo puerto de administraci\u00F3n que DAS: {0}.

Cluster.error_while_copying=Error al copiar la configuraci\u00F3n por defecto {0}
Cluster.error_while_settingConfig=Error al definir la configuraci\u00F3n {0} en el cluster {1} {2}
deleteConfigFailed=No se ha podido eliminar la configuraci\u00F3n {0}
deleteServerRefFailed=No se ha podido eliminar server-ref {0} del cluster {1}
Cluster.hasInstances=El cluster {0} contiene instancias de servidores {1} y no debe contener ninguna instancia
Cluster.obsoleteOptions=Se han utilizado opciones obsoletas.
cannot.execute.command=El software del cluster no est\u00E1 instalado.

# CRUD commands related strings.

create.cluster.command=Crea un nuevo cluster de GlassFish
create.cluster.command.name=Nombre de este cluster nuevo
delete.cluster.command=Suprime un cluster existente

generic.config=Nombre de configuraci\u00F3n existente que va a utilizar este cluster

config.copyConfigError=Error al copiar la configuraci\u00F3n, causado por {0}
config.mkdirs=error al crear los directorios espec\u00EDficos de configuraci\u00F3n

# validation messages
cluster.invalid.name=Nombre de cluster no v\u00E1lido. El nombre debe empezar por una letra, un n\u00FAmero o car\u00E1cter de subrayado y solamente puede incluir letras, n\u00FAmeros y los caracteres siguientes: gui\u00F3n, punto, punto y coma y de subrayado.
server.invalid.name=Nombre de servidor no v\u00E1lido. El nombre debe empezar por una letra, un n\u00FAmero o car\u00E1cter de subrayado y solamente puede incluir letras, n\u00FAmeros y los caracteres siguientes: gui\u00F3n, punto, punto y coma y de subrayado.
appref.invalid.name=Nombre de aplicaci\u00F3n no v\u00E1lido. El nombre debe empezar por una letra, un n\u00FAmero o car\u00E1cter de subrayado y solamente puede incluir letras, n\u00FAmeros y los caracteres siguientes: gui\u00F3n, punto, car\u00E1cter de subrayado, barra inclinada, dos puntos, almohadilla y punto y coma.
node.invalid.name=Nombre de nodo no v\u00E1lido. El nombre debe empezar por una letra o un n\u00FAmero, y s\u00F3lo puede contener letras, n\u00FAmeros y otros caracteres determinados.
config.invalid.name=Nombre de configuraci\u00F3n no v\u00E1lido. El nombre debe empezar por una letra, un n\u00FAmero o car\u00E1cter de subrayado y solamente puede incluir letras, n\u00FAmeros y los caracteres siguientes: gui\u00F3n, punto, punto y coma y de subrayado.
nodehost.invalid.name=Nombre de host del nodo no v\u00E1lido. El nombre debe empezar por una letra o un n\u00FAmero, y s\u00F3lo puede contener letras, n\u00FAmeros y otros caracteres determinados.
windowsdomain.invalid.name=Nombre de dominio de Windows no v\u00E1lido. El nombre debe empezar por una letra o un n\u00FAmero, y s\u00F3lo puede contener letras, n\u00FAmeros y otros caracteres determinados.

config.duplicate.name= El nombre de configuraci\u00F3n especificado no es \u00FAnico en el dominio. Especifique un nombre de configuraci\u00F3n \u00FAnico.
cluster.duplicate.name= El nombre de cluster especificado no es \u00FAnico en el dominio. Especifique un nombre de cluster \u00FAnico.
server.duplicate.name= El nombre de servidor especificado no es \u00FAnico en el dominio. Especifique un nombre de servidor \u00FAnico.
node.duplicate.name=El nombre de nodo especificado no es \u00FAnico en el dominio. Especifique un nombre de nodo \u00FAnico.

cluster.reserved.name=El nombre de cluster especificado es una palabra reservada. Especifique un nombre de cluster que no est\u00E9 reservado.
config.reserved.name=El nombre de configuraci\u00F3n especificado es una palabra reservada. Especifique un nombre de configuraci\u00F3n que no est\u00E9 reservado.
node.reserved.name=El nombre de nodo especificado es una palabra reservada. Especifique un nombre de nodo que no est\u00E9 reservado.
server.reserved.name=El nombre de servidor especificado es una palabra reservada. Especifique un nombre de servidor que no est\u00E9 reservado.

port-pattern=debe estar entre 1 y 65535 o hacer referencia a una propiedad del sistema con el formato ${SYSTEM_PROPERTY_NAME}
resourcepool.invalid.name.key=Nombre de pool no v\u00E1lido. Un nombre de pool debe empezar por una letra, un n\u00FAmero o car\u00E1cter de subrayado y solamente puede incluir letras, n\u00FAmeros y los caracteres especiales siguientes: gui\u00F3n, car\u00E1cter de subrayado, punto, barra diagonal, punto y coma, dos puntos y almohadilla. El nombre de pool no debe contener ning\u00FAn espacio.
resourcename.invalid.character=el nombre de recurso no puede contener el car\u00E1cter ':'

resource.invalid=Nombre de pool no v\u00E1lido. Compruebe si el pool existe.
resourceref.invalid.poolname=Nombre de pool no v\u00E1lido. Compruebe si el pool existe.


SecureAdminPrincipalResolver.configTypeNotNamed=El tipo de configuraci\u00F3n {0} debe ampliar {1}, pero no lo hace
SecureAdminPrincipalResolver.target_object_not_found=No se ha encontrado un {0} denominado {1}
SecureAdmin.running.old.config=Este servidor parece estar ejecut\u00E1ndose con una configuraci\u00F3n de una versi\u00F3n m\u00E1s antigua o una configuraci\u00F3n corrupta. Ejecute el comando enable-secure-admin como se describe en las notas t\u00E9cnicas sobre la versi\u00F3n para actualizar la configuraci\u00F3n de administraci\u00F3n segura.

instanceCreationNotAllowed=La creaci\u00F3n de instancia est\u00E1 desactivada en el nodo {0}. No se puede crear ninguna instancia nueva en este nodo.
nodeCreationNotAllowed=La creaci\u00F3n de nodo est\u00E1 desactivada. No se puede crear ning\u00FAn nodo nuevo.

resourceref.invalid.configref=Referencia no v\u00E1lida para aplicar la configuraci\u00F3n. Compruebe si la configuraci\u00F3n existe.

invalid.time.period.specified=Se ha especificado un per\u00EDodo de tiempo no v\u00E1lido. Especif\u00EDquelo como h, m o s. Por ejemplo,1 h , 60 m 0 3600 s.

contextroot.duplicate=El servidor virtual ya ha cargado una aplicaci\u00F3n en esta ruta de contexto. Por lo tanto, esta aplicaci\u00F3n no se puede cargar en esta ruta de contexto en este servidor virtual
