#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

button.Flush=Vider

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them

msg.JS.securityMap.enterUserGroups=Entrer une valeur pour les groupes d\u2019utilisateurs
msg.JS.securityMap.enterPrincipals=Entrer une valeur pour les principaux
msg.JS.confirmDeleteSM=Les mappes de s\u00E9curit\u00E9 s\u00E9lectionn\u00E9es vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?
msg.JS.confirmDeleteAO=Les objets d\u2019administration s\u00E9lectionn\u00E9s vont \u00EAtre supprim\u00E9s. Voulez-vous continuer ?
msg.JS.confirmDeleteCR=Les ressources s\u00E9lectionn\u00E9es vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?
msg.JS.confirmDeleteCP=Les pools de connexions s\u00E9lectionn\u00E9s vont \u00EAtre supprim\u00E9s. Voulez-vous continuer ?
msg.JS.confirmDeleteAC=Les configurations d\u2019adaptateur s\u00E9lectionn\u00E9es vont \u00EAtre supprim\u00E9es. Voulez-vous continuer ?


## Admin Object Resource
adminObjectResources.pageTitle=Ressources d'objet d'administration
adminObjectResources.pageTitleHelp=Une ressource d'objet d'administration fournit des fonctionnalit\u00E9s sp\u00E9cialis\u00E9es que l'adaptateur de ressources d\u00E9finit pour le module connecteur d\u00E9ploy\u00E9.

adminObjectResource.editPageTitle=Modifier une ressource d'objet d'administration
adminObjectResource.editPageHelp=Modifiez une ressource d'objet d'administration existante.
adminObject.NewPageTitle=Nouvelle ressource d'objet d'administration
adminObject.NewPageTitleHelp=Pour cr\u00E9er une ressource d'objet d'administration, sp\u00E9cifiez un nom JNDI unique, s\u00E9lectionnez l'adaptateur de ressources, puis s\u00E9lectionnez un type de ressource et un nom de classe (facultatif).
#adminObject.step2PageTitle=New Admin Object Resource (Step 2 of 2)
#adminObject.step2PageTitleHelp=Add a description for the administered object, enable or disable the object on all resources and define name-value property pairs.
adminObjectResource.targetPageTitle=Cibles de ressource d'objet d'administration
adminObjectResource.resTypeHelp=S\u00E9lectionnez le type de la ressource d'objet administration
adminObjectResource.resourceAdapterHelp=Faites un choix dans la liste des adaptateurs de ressources d\u00E9ploy\u00E9s (modules connecteurs)
adminObjectResource.classname=Nom de classe :
adminObjectResource.classnameHelp=Nom de la classe d'impl\u00E9mentation associ\u00E9e au type de ressource

#Resources

resourcesTable.resources=Ressources
resourcesTable.sessions=Sessions
resourcesTable.connectionFactories=Fabriques de connexions
resourcesTable.Pools=Pools
resourcesTable.destResources=Ressources de destination

resourcesTable.colPoolName=Nom du pool
resourcesTable.colJndiName=Nom JNDI
resourcesTable.colDesc=Description
resourcesTable.colPool=Pool de connexions
resourcesTable.colResType=Type de ressource
resourcesTable.colDatasource=Nom de classe de la source de donn\u00E9es
resourcesTable.colDefinition=D\u00E9finition de connexion
resourcesTable.colResAdapter=Adaptateur de ressources

## Connectors
connectors.pageTitle=Connecteurs
connectors.pageTitleHelp=
connectorResources.pageTitle=Ressources du connecteur
connectorResources.pageTitleHelp=Une ressource de connecteur est un objet programme fournissant une application avec une connexion \u00E0 un syst\u00E8me d'informations d'entreprise (EIS).
connectorConnectionPools.pageTitle=Pools de connexions du connecteur
connectorConnectionPools.pageTitleHelp=Cliquez sur Nouveau pour cr\u00E9er un pool de connexions de connecteur. D\u00E9ployez le module connecteur avant de cr\u00E9er le pool. Vous pouvez d\u00E9ployer les modules connecteurs sur la page <a href="#{request.contextPath}/applications/applications.jsf">Applications</a>.


## Connector Connection Pool

resource.targetPageTitleHelp=G\u00E9rez les cibles (clusters et instances de serveur autonomes) sur lesquelles la ressource est disponible.
connectorResource.editPageTitle=Modifier une ressource de connecteur
connectorResource.editPageTitleHelp=Modifiez une ressource de connecteur existante.
connectorResource.targetPageTitle=Cibles de ressources de connecteur
connectorResource.newPageTitle=Nouvelle ressource de connecteur
connectorResource.newPageTitleHelp=Pour cr\u00E9er une ressource de connecteur, indiquez le pool de connexions auquel elle est associ\u00E9e. Plusieurs ressources de connecteur peuvent utiliser un m\u00EAme pool de connexions.
connectorResource.poolHelp=Utilisez la page <a href="#{request.contextPath}/jca/connectorConnectionPools.jsf">Pools de connexions de connecteur</a> pour cr\u00E9er des pools

connectorConnectionPool.editPageTitle=Modifier le pool de connexions du connecteur
connectorConnectionPool.editPageTitleHelp=Modifiez les param\u00E8tres d'un pool de connexions de connecteur existant.
connectorConnectionPool.step1PageTitle=Nouveau pool de connexions de connecteur (\u00E9tape 1 sur 2)
connectorConnectionPool.step1PageTitleHelp=Entrez un nom de pool, s\u00E9lectionnez l'adaptateur de ressources et la d\u00E9finition de connexion associ\u00E9s, puis cliquez sur Suivant.
connectorConnectionPool.step2PageTitle=Nouveau pool de connexions de connecteur (\u00E9tape 2 sur 2)
connectorConnectionPool.step2PageTitleHelp=V\u00E9rifiez les param\u00E8tres du pool de connexions, ajoutez les propri\u00E9t\u00E9s n\u00E9cessaires, puis cliquez sur le bouton Terminer.
connectorConnectionPool.connectionDefinitionName=D\u00E9finition de connexion :
connectorConnectionPool.connectionDefinitionNameHelp=Interface de d\u00E9finition des connexions
connectorConnectionPool.onFail=Echec sur tout :
connectorConnectionPool.onFailHelp=Fermez et r\u00E9tablissez toutes les connexions en cas d'\u00E9chec. Sinon, seules les connexions qui \u00E9taient utilis\u00E9es sont r\u00E9tablies
connectorConnectionPool.closeAll=Fermer toutes les connexions
connectorConnectionPool.transSupport=Prise en charge des transactions :
connectorConnectionPool.transSupportHelp=Niveau de prise en charge des transactions. Remplacez l'attribut de prise en charge des transactions dans l'adaptateur de ressources en pr\u00E9servant une compatibilit\u00E9 descendante.
connectorConnectionPool.conValidationHelp=Validez une connexion avant de la transmettre \u00E0 un conteneur
connectorConnectionPool.validateAtmostOnce=Intervalle de validation :
connectorConnectionPool.validateAtmostHelp=Indique l'intervalle, exprim\u00E9 en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La valeur par d\u00E9faut est 0, ce qui signifie que l'attribut n'est pas activ\u00E9.
connectorConnectionPool.advancePageTitle=Modifier les attributs avanc\u00E9s d'un pool de connexions de connecteur
connectorConnectionPool.advancePageTitleHelp=Modifiez les attributs avanc\u00E9s d'un pool de connexions de connecteur existant.
connectorConnectionPool.propertyPageTitle=Modifier les propri\u00E9t\u00E9s d'un pool de connexions de connecteur
connectorConnectionPool.propertyPageTitleHelp=Modifiez les propri\u00E9t\u00E9s d'un pool de connexions de connecteur existant.
poolName=Nom du pool :

connectorSecurityMaps.pageTitle=Mappes de s\u00E9curit\u00E9 des pools de connexions du connecteur
connectorSecurityMaps.pageTitleHelp=G\u00E9rez les mappes de s\u00E9curit\u00E9. Celles-ci permettent de cr\u00E9er une correspondance entre les utilisateurs et groupes de Java EE et ceux d'EIS.
connectorSecurityMaps.tableTitle=Mappes de s\u00E9curit\u00E9
connectorSecurityMaps.tabTitle=Mappes de s\u00E9curit\u00E9
connectorSecurityMap.newPageTitle=Nouvelle mappe de s\u00E9curit\u00E9 pour le pool de connexions du connecteur
connectorSecurityMap.newPageTitleHelp=Cr\u00E9ez une mappe de s\u00E9curit\u00E9. Celles-ci permettent de cr\u00E9er une correspondance entre les utilisateurs et groupes de Java EE et ceux d'EIS. Vous devez d\u00E9finir des groupes d'utilisateurs ou des principaux, mais pas les deux.
connectorSecurityMap.editPageTitle=Modifier une mappe de s\u00E9curit\u00E9 du pool de connexions du connecteur
connectorSecurityMap.editPageTitleHelp=Modifiez une mappe de s\u00E9curit\u00E9 existante.
connectorSecurityMap.poolName=Nom du pool de connexions :
connectorSecurityMap.securityMapName=Nom de la mappe de s\u00E9curit\u00E9 :
#it will be fine to leave value1, value2, and value3 not translated. These fields cannot take multibyte chars.
connectorSecurityMap.userGroups=Groupes d'utilisateurs :
connectorSecurityMap.userGroupsHelp=Exemple : valeur1, valeur2, valeur3
connectorSecurityMap.principals=Principaux :
connectorSecurityMap.principalsHelp=Exemple : valeur1, valeur2, valeur3
connectorSecurityMap.backendPrincipal=Principal back-end
connectorSecurityMap.userName=Nom utilisateur :
connectorSecurityMap.password=Mot de passe :

workSecurityMaps.pageTitle=Mappes de s\u00E9curit\u00E9 de travail
workSecurityMaps.pageTitleHelp=Une mappe de s\u00E9curit\u00E9 de travail fait concorder l'identit\u00E9 de l'appelant du travail soumis par un principal d'adaptateur de ressources EIS ou un groupe d'utilisateurs EIS \u00E0 un principal ou un groupe d'utilisateurs appropri\u00E9 dans le domaine de s\u00E9curit\u00E9 de GlassFish Server.
workSecurityMaps.tableTitle=Mappes de s\u00E9curit\u00E9 de travail
workSecurityMap.newPageTitle=Nouvelle mappe de s\u00E9curit\u00E9 de travail
workSecurityMap.newPageTitleHelp=Cr\u00E9ez une mappe de s\u00E9curit\u00E9 de travail pour un adaptateur de ressources. Une mappe de s\u00E9curit\u00E9 de travail fait concorder l'identit\u00E9 de l'appelant du travail soumis par le principal d'adaptateur de ressources EIS ou un groupe d'utilisateurs EIS \u00E0 un principal ou un groupe d'utilisateurs appropri\u00E9 dans le domaine de s\u00E9curit\u00E9 Glassfish Server.
workSecurityMap.editPageTitle=Modifier une mappe de s\u00E9curit\u00E9 de travail
workSecurityMap.editPageTitleHelp=Modifiez une mappe de s\u00E9curit\u00E9 de travail existante pour un adaptateur de ressources.
workSecurityMap.Group=Groupe :
workSecurityMap.Principal=Principal :
workSecurityMap.MappedGroup=Groupe mis en correspondance
workSecurityMap.EisGroup=Groupe EIS
workSecurityMap.EISGroupInlineHelp=Indique une correspondance du groupe d'utilisateurs EIS back-end avec le groupe d'utilisateurs de GlassFish Server. Utilisez une liste s\u00E9par\u00E9e par des virgules pour sp\u00E9cifier plusieurs correspondances. Par exemple, eis-group-1=server-group-1,eis-group-2=server-group-2
workSecurityMap.EISPrincipalInlineHelp=Indique une correspondance du principal EIS back-end avec le principal de GlassFish Server. Utilisez une liste s\u00E9par\u00E9e par des virgules pour sp\u00E9cifier plusieurs correspondances. Par exemple, eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
workSecurityMap.PrincipalMapping=Mise en correspondance de principaux
workSecurityMap.GroupMapping=Mise en correspondance de groupes

tree.resourceAdapterConfigs=Configurations d'adaptateurs de ressources
resourceAdapterConfig.pageTitle=Configurations d'adaptateurs de ressources
resourceAdapterConfig.pageTitleHelp=La configuration d'un adaptateur de ressources fournit des d\u00E9tails sur la fa\u00E7on dont est configur\u00E9 un adaptateur de ressources.
resourceAdapterConfig.tableTitle=Configurations d'adaptateurs de ressources
resourceAdapterConfig.tabTitle=Configurations
resourceAdapterConfig.newPageTitle=Nouvelle configuration d'adaptateur de ressources
resourceAdapterConfig.newPageTitleHelp=Cr\u00E9ez une configuration d'adaptateur de ressources.
resourceAdapterConfig.editPageTitle=Modifier la configuration de l'adaptateur de ressources
resourceAdapterConfig.editPageTitleHelp=Modifiez une configuration d'adaptateur de ressources.
resourceAdapterConfig.Name=Nom de l'adaptateur de ressources :
resourceAdapterConfig.NameHelp=S\u00E9lectionnez ou saisissez un nom de configuration d'adaptateur de ressources.
resourceAdapterConfig.threadPoolId=ID du pool de threads :
resourceAdapterConfig.ThreadPoolIdsHelp=ID de pool de threads permettant au gestionnaire de travail d'obtenir le thread. Utilisez la page <a href="#{request.contextPath}/web/configuration/threadPools.jsf">Pools de threads</a> pour cr\u00E9er des pools
resourceAdapterConfig.configs=Configurations


jcaPool.pooling=Groupement :
jcaPool.poolingHelp=Lorsqu'il a la valeur False, ce param\u00E8tre d\u00E9sactive le groupement des connexions pour le pool
jcaPool.ping=Ping :
jcaPool.pingHelp=Lorsque cette option est activ\u00E9e, un commande Ping est ex\u00E9cut\u00E9e sur le pool lors de la cr\u00E9ation ou de la reconfiguration afin d'identifier et de signaler les valeurs incorrectes de ses attributs, le cas \u00E9ch\u00E9ant
jcaPool.poolSettings=Param\u00E8tres du pool
jcaPool.initPoolSize=Taille initiale et minimale du pool :
jcaPool.initPoolSizeHelp=Nombre minimal et initial de connexions g\u00E9r\u00E9es dans le pool
jcaPool.maxPoolSize=Taille maximale du pool :
jcaPool.maxPoolSizeHelp=Nombre maximal de connexions pouvant \u00EAtre cr\u00E9\u00E9es pour r\u00E9pondre aux demandes client
jcaPool.poolResize=Valeur de redimensionnement du pool :
jcaPool.poolResizeHelp=Nombre de connexions qui doivent \u00EAtre enlev\u00E9es \u00E0 l'expiration du d\u00E9lai d'inactivit\u00E9 du pool
jcaPool.idleTimeout=D\u00E9lai d'inactivit\u00E9 :
jcaPool.idleTimeoutHelp=D\u00E9lai maximal pendant lequel une connexion du pool peut rester inactive
jcaPool.maxWait=Attente max. :
jcaPool.maxWaitHelp=Dur\u00E9e pendant laquelle le programme appelant attend avant qu'une notification d'expiration de la connexion soit envoy\u00E9e
jcaPool.Validation=Validation de la connexion
jcaPool.conValidation=Validation de la connexion :
jcaPool.conValidationHelp=Validez les connexions et autorisez le serveur \u00E0 se reconnecter en cas d'\u00E9chec
jcaPool.connectionSettings=Param\u00E8tres de connexion
jcaPool.statementTimeoutInSeconds=D\u00E9lai d'expiration des instructions :
jcaPool.statementTimeoutInSecondsHelp=Propri\u00E9t\u00E9 de d\u00E9lai d'expiration d'une connexion qui permet de mettre fin aux requ\u00EAtes dont l'ex\u00E9cution est anormalement longue. -1 implique qu'elle n'est pas activ\u00E9e.
jcaPool.validateAtmostOnceInSeconds=Valider une fois au plus :
jcaPool.validateAtmostOnceInSecondsHelp=Indique l'intervalle, exprim\u00E9 en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La valeur 0 signifie que l'attribut n'est pas activ\u00E9.
jcaPool.connectionLeakTimeoutInSeconds=D\u00E9lai d'expiration de perte de connexion :
jcaPool.connectionLeakTimeoutInSecondsHelp=La valeur 0 implique l'absence de d\u00E9tection de perte
jcaPool.connectionLeakReclaim=R\u00E9cup\u00E9ration de perte :
jcaPool.connectionLeakReclaimHelp=Si cette option est activ\u00E9e, les connexions pr\u00E9sentant des pertes sont restaur\u00E9es dans le pool une fois atteint le d\u00E9lai d'expiration de perte de connexion
jcaPool.connectionCreationRetryAttempts=Tentatives de cr\u00E9ation :
jcaPool.connectionCreationRetryAttemptsHelp=Nombre de tentatives de cr\u00E9ation d'une connexion. 0 n'implique aucune nouvelle tentative.                     
jcaPool.connectionCreationRetryIntervalInSeconds=Intervalle entre les tentatives :
jcaPool.connectionCreationRetryIntervalInSecondsHelp=Intervalle de temps entre les tentatives de cr\u00E9ation d'une connexion. En vigueur lorsque la valeur du param\u00E8tre Tentatives de cr\u00E9ation est sup\u00E9rieure \u00E0 0.
jcaPool.lazyConnectionEnlistment=Participation des connexions lazy \u00E0 la transaction :
jcaPool.lazyConnectionEnlistmentHelp=Faites participer une ressource \u00E0 la transaction uniquement si elle est utilis\u00E9e dans une m\u00E9thode
jcaPool.lazyConnectionAssociation=Association lazy :
jcaPool.lazyConnectionAssociationHelp=Les connexions sont associ\u00E9es en mode lazy lorsqu'une op\u00E9ration leur est appliqu\u00E9e
jcaPool.associationWithThread=Associer \u00E0 un thread :
jcaPool.associationWithThreadHelp=Lorsque le m\u00EAme thread a besoin d'une connexion, il peut r\u00E9utiliser celle qui lui est d\u00E9j\u00E0 associ\u00E9e.
jcaPool.matchConnections=Faire correspondre les connexions :
jcaPool.matchConnectionsHelp=Activez ou d\u00E9sactivez la mise en correspondance de connexions pour le pool
jcaPool.maxConnectionUsageCount=Utilisation maximale des connexions :
jcaPool.maxConnectionUsageCountHelp=Les connexions sont r\u00E9utilis\u00E9es par le pool le nombre de fois sp\u00E9cifi\u00E9 avant d'\u00EAtre ferm\u00E9es. La valeur 0 implique que la fonction n'est pas activ\u00E9e.

msg.Error.resourceAdapterNameCannotBeEmpty=Vous devez indiquer le nom de configuration de l'adaptateur de ressources.

msg.warning.poolCreatedPingFailed=Pool cr\u00E9\u00E9 avec l'avertissement suivant
msg.warning.poolSavedPingFailed=Valeurs enregistr\u00E9es avec l'avertissement suivant


rar.editPageTitle=Modifier un module connecteur
rar.editPageTitleHelp=Modifiez un adaptateur de ressources existant. Cliquez sur <a href="#{request.contextPath}/jca/resourceAdapterConfigs.jsf">Configurations d'adaptateurs de ressources</a> pour cr\u00E9er ou modifier la configuration associ\u00E9e.

tree.connectorService=Service du connecteur

connectorService.editPageTitle=Service du connecteur
connectorService.editPageTitleHelp=Les attributs indiqu\u00E9s s'appliquent \u00E0 tous les adaptateurs de ressources d\u00E9ploy\u00E9s dans GlassFish Server.
connectorService.shutdownTimeout=D\u00E9lai d'arr\u00EAt :
connectorService.shutdownTimeoutHelp=Les adaptateurs de ressources qui ne s'arr\u00EAtent pas dans le d\u00E9lai imparti sont ignor\u00E9s et la proc\u00E9dure d'arr\u00EAt continue
connectorService.classLoadingPolicy=R\u00E8gle de chargement de classe de connecteur :
connectorService.classLoadingPolicyHelp=R\u00E8gle \u00E0 utiliser pour le chargement des classes.
