#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2009-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

button.Flush=\u30D5\u30E9\u30C3\u30B7\u30E5

## All the msg.JS.xxx strings are showed by JavaScript in a popup window.  Ensure that no  ' (apostrophe) is included in them

msg.JS.securityMap.enterUserGroups=\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306E\u5024\u3092\u5165\u529B\u3059\u308B
msg.JS.securityMap.enterPrincipals=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u5024\u3092\u5165\u529B\u3059\u308B
msg.JS.confirmDeleteSM=\u9078\u629E\u3057\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteAO=\u9078\u629E\u3057\u305F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteCR=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteCP=\u9078\u629E\u3057\u305F\u63A5\u7D9A\u30D7\u30FC\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002
msg.JS.confirmDeleteAC=\u9078\u629E\u3057\u305F\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\u7D9A\u884C\u3057\u307E\u3059\u304B\u3002


## Admin Object Resource
adminObjectResources.pageTitle=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9
adminObjectResources.pageTitleHelp=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u308B\u7279\u6B8A\u306A\u6A5F\u80FD\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002

adminObjectResource.editPageTitle=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306E\u7DE8\u96C6
adminObjectResource.editPageHelp=\u65E2\u5B58\u306E\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
adminObject.NewPageTitle=\u65B0\u898F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9
adminObject.NewPageTitleHelp=\u65B0\u898F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3059\u308B\u306B\u306F\u3001\u4E00\u610F\u306EJNDI\u540D\u3092\u6307\u5B9A\u3057\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u3092\u9078\u629E\u3057\u305F\u3042\u3068\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u3068\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u30AF\u30E9\u30B9\u540D\u3092\u9078\u629E\u3057\u307E\u3059\u3002
#adminObject.step2PageTitle=New Admin Object Resource (Step 2 of 2)
#adminObject.step2PageTitleHelp=Add a description for the administered object, enable or disable the object on all resources and define name-value property pairs.
adminObjectResource.targetPageTitle=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8
adminObjectResource.resTypeHelp=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30EA\u30BD\u30FC\u30B9\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u3092\u9078\u629E\u3057\u307E\u3059
adminObjectResource.resourceAdapterHelp=\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF(\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB)\u306E\u30EA\u30B9\u30C8\u304B\u3089\u9078\u629E\u3057\u307E\u3059
adminObjectResource.classname=\u30AF\u30E9\u30B9\u540D:
adminObjectResource.classnameHelp=\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u5B9F\u88C5\u30AF\u30E9\u30B9\u540D

#Resources

resourcesTable.resources=\u30EA\u30BD\u30FC\u30B9
resourcesTable.sessions=\u30BB\u30C3\u30B7\u30E7\u30F3
resourcesTable.connectionFactories=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA
resourcesTable.Pools=\u30D7\u30FC\u30EB
resourcesTable.destResources=\u5B9B\u5148\u30EA\u30BD\u30FC\u30B9

resourcesTable.colPoolName=\u30D7\u30FC\u30EB\u540D
resourcesTable.colJndiName=JNDI\u540D
resourcesTable.colDesc=\u8AAC\u660E
resourcesTable.colPool=\u63A5\u7D9A\u30D7\u30FC\u30EB
resourcesTable.colResType=\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30A4\u30D7
resourcesTable.colDatasource=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30FB\u30AF\u30E9\u30B9\u540D
resourcesTable.colDefinition=\u63A5\u7D9A\u5B9A\u7FA9
resourcesTable.colResAdapter=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF

## Connectors
connectors.pageTitle=\u30B3\u30CD\u30AF\u30BF
connectors.pageTitleHelp=
connectorResources.pageTitle=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9
connectorResources.pageTitleHelp=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306F\u3001\u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BA\u60C5\u5831\u30B7\u30B9\u30C6\u30E0(EIS)\u3068\u306E\u63A5\u7D9A\u3092\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u63D0\u4F9B\u3059\u308B\u30D7\u30ED\u30B0\u30E9\u30E0\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3067\u3059\u3002
connectorConnectionPools.pageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB
connectorConnectionPools.pageTitleHelp=\u300C\u65B0\u898F\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3001\u65B0\u898F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u30D7\u30FC\u30EB\u306E\u4F5C\u6210\u524D\u306B\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u30C7\u30D7\u30ED\u30A4\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30C7\u30D7\u30ED\u30A4\u306F\u300C<a href="#{request.contextPath}/applications/applications.jsf">\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3</a>\u300D\u30DA\u30FC\u30B8\u304B\u3089\u5B9F\u884C\u3067\u304D\u307E\u3059\u3002


## Connector Connection Pool

resource.targetPageTitleHelp=\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3067\u304D\u308B\u30BF\u30FC\u30B2\u30C3\u30C8(\u30AF\u30E9\u30B9\u30BF\u304A\u3088\u3073\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u30FB\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9)\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002
connectorResource.editPageTitle=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u306E\u7DE8\u96C6
connectorResource.editPageTitleHelp=\u65E2\u5B58\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
connectorResource.targetPageTitle=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u30FB\u30BF\u30FC\u30B2\u30C3\u30C8
connectorResource.newPageTitle=\u65B0\u898F\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9
connectorResource.newPageTitleHelp=\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u3092\u4F5C\u6210\u3059\u308B\u306B\u306F\u3001\u305D\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u8907\u6570\u306E\u30B3\u30CD\u30AF\u30BF\u30FB\u30EA\u30BD\u30FC\u30B9\u304C1\u3064\u306E\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
connectorResource.poolHelp=\u300C<a href="#{request.contextPath}/jca/connectorConnectionPools.jsf">\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB</a>\u300D\u30DA\u30FC\u30B8\u3092\u4F7F\u7528\u3057\u3066\u65B0\u898F\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059

connectorConnectionPool.editPageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u7DE8\u96C6
connectorConnectionPool.editPageTitleHelp=\u65E2\u5B58\u306E\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u8A2D\u5B9A\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
connectorConnectionPool.step1PageTitle=\u65B0\u898F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB(\u624B\u98061/2)
connectorConnectionPool.step1PageTitleHelp=\u30D7\u30FC\u30EB\u540D\u3092\u6307\u5B9A\u3057\u3001\u95A2\u9023\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u304A\u3088\u3073\u63A5\u7D9A\u5B9A\u7FA9\u3092\u9078\u629E\u3057\u3066\u304B\u3089\u3001\u300C\u6B21\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
connectorConnectionPool.step2PageTitle=\u65B0\u898F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB(\u624B\u98062/2)
connectorConnectionPool.step2PageTitleHelp=\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3001\u5FC5\u8981\u306A\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8FFD\u52A0\u3057\u3066\u3001\u300C\u7D42\u4E86\u300D\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u307E\u3059\u3002
connectorConnectionPool.connectionDefinitionName=\u63A5\u7D9A\u5B9A\u7FA9:
connectorConnectionPool.connectionDefinitionNameHelp=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u30A4\u30F3\u30BF\u30D5\u30A7\u30FC\u30B9
connectorConnectionPool.onFail=\u3059\u3079\u3066\u306E\u969C\u5BB3\u6642:
connectorConnectionPool.onFailHelp=\u969C\u5BB3\u767A\u751F\u6642\u306B\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u3066\u304B\u3089\u518D\u63A5\u7D9A\u3057\u3001\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u306F\u4F7F\u7528\u6642\u306B\u306E\u307F\u518D\u63A5\u7D9A\u3059\u308B
connectorConnectionPool.closeAll=\u3059\u3079\u3066\u306E\u63A5\u7D9A\u3092\u9589\u3058\u308B
connectorConnectionPool.transSupport=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8:
connectorConnectionPool.transSupportHelp=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u306E\u30EC\u30D9\u30EB: \u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30FB\u30B5\u30DD\u30FC\u30C8\u5C5E\u6027\u3092\u4E0B\u4F4D\u4E92\u63DB\u6027\u306E\u3042\u308B\u5F62\u5F0F\u3067\u4E0A\u66F8\u304D\u3057\u307E\u3059\u3002
connectorConnectionPool.conValidationHelp=\u30B3\u30F3\u30C6\u30CA\u306B\u6E21\u3059\u524D\u306B\u63A5\u7D9A\u3092\u691C\u8A3C
connectorConnectionPool.validateAtmostOnce=\u691C\u8A3C\u9593\u9694:
connectorConnectionPool.validateAtmostHelp=\u63A5\u7D9A\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306E\u9023\u7D9A\u3057\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6642\u9593\u9593\u9694\u3092\u79D2\u5358\u4F4D\u3067\u4E00\u5EA6\u306E\u307F\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F0\u3067\u3059\u3002\u3053\u306E\u5C5E\u6027\u304C\u7121\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
connectorConnectionPool.advancePageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u8A73\u7D30\u5C5E\u6027\u306E\u7DE8\u96C6
connectorConnectionPool.advancePageTitleHelp=\u65E2\u5B58\u306E\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u8A73\u7D30\u5C5E\u6027\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
connectorConnectionPool.propertyPageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u7DE8\u96C6
connectorConnectionPool.propertyPageTitleHelp=\u65E2\u5B58\u306E\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
poolName=\u30D7\u30FC\u30EB\u540D:

connectorSecurityMaps.pageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
connectorSecurityMaps.pageTitleHelp=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306B\u3088\u308A\u3001Java EE\u306E\u30E6\u30FC\u30B6\u30FC\u304A\u3088\u3073\u30B0\u30EB\u30FC\u30D7\u3068\u3001EIS\u306E\u30E6\u30FC\u30B6\u30FC\u304A\u3088\u3073\u30B0\u30EB\u30FC\u30D7\u306E\u9593\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u4F5C\u6210\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
connectorSecurityMaps.tableTitle=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
connectorSecurityMaps.tabTitle=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
connectorSecurityMap.newPageTitle=\u65B0\u898F\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
connectorSecurityMap.newPageTitleHelp=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306B\u3088\u308A\u3001Java EE\u306E\u30E6\u30FC\u30B6\u30FC\u304A\u3088\u3073\u30B0\u30EB\u30FC\u30D7\u3068\u3001EIS\u306E\u30E6\u30FC\u30B6\u30FC\u304A\u3088\u3073\u30B0\u30EB\u30FC\u30D7\u306E\u9593\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306E\u4F5C\u6210\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002\u300C\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u300D\u3068\u300C\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u300D\u306E\u4E21\u65B9\u3067\u306F\u306A\u304F\u3001\u3069\u3061\u3089\u304B\u4E00\u65B9\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
connectorSecurityMap.editPageTitle=\u30B3\u30CD\u30AF\u30BF\u63A5\u7D9A\u30D7\u30FC\u30EB\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u7DE8\u96C6
connectorSecurityMap.editPageTitleHelp=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
connectorSecurityMap.poolName=\u63A5\u7D9A\u30D7\u30FC\u30EB\u540D:
connectorSecurityMap.securityMapName=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u540D:
#it will be fine to leave value1, value2, and value3 not translated. These fields cannot take multibyte chars.
connectorSecurityMap.userGroups=\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7:
connectorSecurityMap.userGroupsHelp=\u4F8B: value1, value2, value3
connectorSecurityMap.principals=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB:
connectorSecurityMap.principalsHelp=\u4F8B: value1, value2, value3
connectorSecurityMap.backendPrincipal=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9\u30FB\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB
connectorSecurityMap.userName=\u30E6\u30FC\u30B6\u30FC\u540D:
connectorSecurityMap.password=\u30D1\u30B9\u30EF\u30FC\u30C9:

workSecurityMaps.pageTitle=\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
workSecurityMaps.pageTitleHelp=\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BFEIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u307E\u305F\u306FEIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306B\u3088\u3063\u3066\u9001\u4FE1\u3055\u308C\u305F\u4F5C\u696D\u306E\u547C\u51FA\u3057\u5074ID\u3092\u3001GlassFish Server\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30C9\u30E1\u30A4\u30F3\u306E\u9069\u5207\u306A\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u307E\u305F\u306F\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306B\u30DE\u30C3\u30D4\u30F3\u30B0\u3057\u307E\u3059\u3002
workSecurityMaps.tableTitle=\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
workSecurityMap.newPageTitle=\u65B0\u898F\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7
workSecurityMap.newPageTitleHelp=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u65B0\u898F\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BFEIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u307E\u305F\u306FEIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306B\u3088\u3063\u3066\u9001\u4FE1\u3055\u308C\u305F\u4F5C\u696D\u306E\u547C\u51FA\u3057\u5074ID\u3092\u3001GlassFish Server\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30C9\u30E1\u30A4\u30F3\u306E\u9069\u5207\u306A\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u307E\u305F\u306F\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306B\u30DE\u30C3\u30D4\u30F3\u30B0\u3057\u307E\u3059\u3002
workSecurityMap.editPageTitle=\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u306E\u7DE8\u96C6
workSecurityMap.editPageTitleHelp=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u65E2\u5B58\u306E\u4F5C\u696D\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30FB\u30DE\u30C3\u30D7\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
workSecurityMap.Group=\u30B0\u30EB\u30FC\u30D7:
workSecurityMap.Principal=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB:
workSecurityMap.MappedGroup=\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u30B0\u30EB\u30FC\u30D7
workSecurityMap.EisGroup=EIS\u30B0\u30EB\u30FC\u30D7
workSecurityMap.EISGroupInlineHelp=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u306EGlassFish Server\u30E6\u30FC\u30B6\u30FC\u30FB\u30B0\u30EB\u30FC\u30D7\u3078\u306E\u30DE\u30C3\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u3001\u8907\u6570\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001eis-group-1=server-group-1,eis-group-2=server-group-2\u306E\u3088\u3046\u306B\u3057\u307E\u3059
workSecurityMap.EISPrincipalInlineHelp=\u30D0\u30C3\u30AF\u30A8\u30F3\u30C9EIS\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306EGlassFish Server\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3078\u306E\u30DE\u30C3\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u3001\u8907\u6570\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001eis-principal-1=server-principal-1,eis-principal-2=server-principal-2\u306E\u3088\u3046\u306B\u3057\u307E\u3059
workSecurityMap.PrincipalMapping=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0
workSecurityMap.GroupMapping=\u30B0\u30EB\u30FC\u30D7\u30FB\u30DE\u30C3\u30D4\u30F3\u30B0

tree.resourceAdapterConfigs=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210
resourceAdapterConfig.pageTitle=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210
resourceAdapterConfig.pageTitleHelp=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3067\u306F\u3001\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306E\u69CB\u6210\u60C5\u5831\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002
resourceAdapterConfig.tableTitle=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210
resourceAdapterConfig.tabTitle=\u69CB\u6210
resourceAdapterConfig.newPageTitle=\u65B0\u898F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210
resourceAdapterConfig.newPageTitleHelp=\u65B0\u898F\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002
resourceAdapterConfig.editPageTitle=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3092\u7DE8\u96C6\u3057\u307E\u3059
resourceAdapterConfig.editPageTitleHelp=\u65E2\u5B58\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
resourceAdapterConfig.Name=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u540D:
resourceAdapterConfig.NameHelp=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u540D\u3092\u9078\u629E\u307E\u305F\u306F\u5165\u529B\u3057\u307E\u3059\u3002
resourceAdapterConfig.threadPoolId=\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EBID:
resourceAdapterConfig.ThreadPoolIdsHelp=\u4F5C\u696D\u30DE\u30CD\u30FC\u30B8\u30E3\u304C\u30B9\u30EC\u30C3\u30C9\u3092\u53D6\u5F97\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u306EID\u3002<a href="#{request.contextPath}/web/configuration/threadPools.jsf">\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB</a>\u30DA\u30FC\u30B8\u3092\u4F7F\u7528\u3057\u3066\u3001\u65B0\u898F\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059
resourceAdapterConfig.configs=\u69CB\u6210


jcaPool.pooling=\u30D7\u30FC\u30EB:
jcaPool.poolingHelp=false\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u63A5\u7D9A\u306E\u30D7\u30FC\u30EB\u304C\u7121\u52B9\u306B\u306A\u308A\u307E\u3059
jcaPool.ping=Ping:
jcaPool.pingHelp=\u6709\u52B9\u306A\u5834\u5408\u3001\u4F5C\u6210\u307E\u305F\u306F\u518D\u69CB\u6210\u4E2D\u306B\u30D7\u30FC\u30EB\u306Bping\u304C\u5B9F\u884C\u3055\u308C\u3001\u5C5E\u6027\u306B\u5BFE\u3059\u308B\u8AA4\u3063\u305F\u5024\u304C\u3042\u308C\u3070\u305D\u308C\u3092\u8B58\u5225\u3057\u3066\u8B66\u544A\u3057\u307E\u3059
jcaPool.poolSettings=\u30D7\u30FC\u30EB\u8A2D\u5B9A
jcaPool.initPoolSize=\u521D\u671F\u304A\u3088\u3073\u6700\u5C0F\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA:
jcaPool.initPoolSizeHelp=\u30D7\u30FC\u30EB\u3067\u7DAD\u6301\u3059\u308B\u63A5\u7D9A\u306E\u6700\u5C0F\u6570\u304A\u3088\u3073\u521D\u671F\u6570
jcaPool.maxPoolSize=\u6700\u5927\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA:
jcaPool.maxPoolSizeHelp=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u6E80\u305F\u3059\u305F\u3081\u306B\u4F5C\u6210\u3067\u304D\u308B\u63A5\u7D9A\u306E\u6700\u5927\u6570
jcaPool.poolResize=\u30D7\u30FC\u30EB\u30FB\u30B5\u30A4\u30BA\u5909\u66F4\u91CF:
jcaPool.poolResizeHelp=\u30D7\u30FC\u30EB\u30FB\u30A2\u30A4\u30C9\u30EB\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u6709\u52B9\u671F\u9650\u5207\u308C\u306B\u306A\u3063\u305F\u3068\u304D\u306B\u9664\u53BB\u3055\u308C\u308B\u63A5\u7D9A\u306E\u6570
jcaPool.idleTimeout=\u30A2\u30A4\u30C9\u30EB\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jcaPool.idleTimeoutHelp=\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u5185\u3067\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3044\u3089\u308C\u308B\u6700\u5927\u6642\u9593
jcaPool.maxWait=\u6700\u5927\u5F85\u6A5F\u6642\u9593:
jcaPool.maxWaitHelp=\u547C\u51FA\u3057\u5074\u304C\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u9001\u4FE1\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u6642\u9593
jcaPool.Validation=\u63A5\u7D9A\u691C\u8A3C
jcaPool.conValidation=\u63A5\u7D9A\u691C\u8A3C:
jcaPool.conValidationHelp=\u63A5\u7D9A\u3092\u691C\u8A3C\u3057\u3001\u969C\u5BB3\u767A\u751F\u6642\u306B\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u63A5\u7D9A\u3092\u8A31\u53EF\u3059\u308B
jcaPool.connectionSettings=\u63A5\u7D9A\u8A2D\u5B9A
jcaPool.statementTimeoutInSeconds=\u6587\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jcaPool.statementTimeoutInSecondsHelp=\u63A5\u7D9A\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3001\u5B9F\u884C\u6642\u9593\u304C\u7570\u5E38\u306B\u9577\u3044\u554F\u5408\u305B\u3092\u505C\u6B62\u3067\u304D\u307E\u3059\u3002-1\u306F\u3001\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
jcaPool.validateAtmostOnceInSeconds=\u6700\u5927\u30671\u56DE\u691C\u8A3C:
jcaPool.validateAtmostOnceInSecondsHelp=\u6700\u59271\u56DE\u63A5\u7D9A\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306E\u9023\u7D9A\u3057\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6642\u9593\u9593\u9694\u3092\u79D2\u5358\u4F4D\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u5024\u30920\u306B\u3059\u308B\u3068\u3001\u3053\u306E\u5C5E\u6027\u304C\u7121\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
jcaPool.connectionLeakTimeoutInSeconds=\u30EA\u30FC\u30AF\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
jcaPool.connectionLeakTimeoutInSecondsHelp=0\u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30EA\u30FC\u30AF\u691C\u51FA\u306F\u884C\u308F\u308C\u307E\u305B\u3093
jcaPool.connectionLeakReclaim=\u30EA\u30FC\u30AF\u518D\u8981\u6C42:
jcaPool.connectionLeakReclaimHelp=\u6709\u52B9\u306B\u3057\u305F\u5834\u5408\u306F\u3001\u63A5\u7D9A\u30EA\u30FC\u30AF\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u767A\u751F\u5F8C\u3001\u30EA\u30FC\u30AF\u3055\u308C\u305F\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u306B\u3088\u3063\u3066\u518D\u8981\u6C42\u3055\u308C\u307E\u3059
jcaPool.connectionCreationRetryAttempts=\u4F5C\u6210\u518D\u8A66\u884C\u56DE\u6570:
jcaPool.connectionCreationRetryAttemptsHelp=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u30020\u306F\u518D\u8A66\u884C\u306A\u3057\u3092\u610F\u5473\u3057\u307E\u3059\u3002                     
jcaPool.connectionCreationRetryIntervalInSeconds=\u518D\u8A66\u884C\u9593\u9694:
jcaPool.connectionCreationRetryIntervalInSecondsHelp=\u63A5\u7D9A\u306E\u4F5C\u6210\u3092\u518D\u8A66\u884C\u3059\u308B\u6642\u9593\u9593\u9694\u3002\u63A5\u7D9A\u518D\u8A66\u884C\u56DE\u6570\u306E\u5024\u304C0\u3088\u308A\u5927\u304D\u3044\u5834\u5408\u306B\u6709\u52B9\u3067\u3059\u3002
jcaPool.lazyConnectionEnlistment=\u4F7F\u7528\u6642\u306B\u306E\u307F\u63A5\u7D9A\u3092\u767B\u9332:
jcaPool.lazyConnectionEnlistmentHelp=\u5B9F\u969B\u306B\u30E1\u30BD\u30C3\u30C9\u3067\u4F7F\u7528\u3059\u308B\u3068\u304D\u306B\u9650\u308A\u3001\u30EA\u30BD\u30FC\u30B9\u3092\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306B\u767B\u9332\u3057\u307E\u3059
jcaPool.lazyConnectionAssociation=\u4F7F\u7528\u6642\u306B\u306E\u307F\u95A2\u9023\u4ED8\u3051:
jcaPool.lazyConnectionAssociationHelp=\u63A5\u7D9A\u306B\u5BFE\u3057\u3066\u64CD\u4F5C\u304C\u5B9F\u884C\u3055\u308C\u308B\u6642\u70B9\u3067\u521D\u3081\u3066\u63A5\u7D9A\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u307E\u3059
jcaPool.associationWithThread=\u30B9\u30EC\u30C3\u30C9\u3068\u306E\u95A2\u9023\u4ED8\u3051:
jcaPool.associationWithThreadHelp=\u540C\u3058\u30B9\u30EC\u30C3\u30C9\u3067\u63A5\u7D9A\u304C\u5FC5\u8981\u306B\u306A\u3063\u305F\u3068\u304D\u3001\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u306F\u3059\u3067\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u308B\u63A5\u7D9A\u3092\u518D\u5229\u7528\u3067\u304D\u307E\u3059\u3002
jcaPool.matchConnections=\u63A5\u7D9A\u306E\u30DE\u30C3\u30C1\u30F3\u30B0:
jcaPool.matchConnectionsHelp=\u30D7\u30FC\u30EB\u306B\u5BFE\u3059\u308B\u63A5\u7D9A\u306E\u30DE\u30C3\u30C1\u30F3\u30B0\u3092\u6709\u52B9\u307E\u305F\u306F\u7121\u52B9\u306B\u3057\u307E\u3059
jcaPool.maxConnectionUsageCount=\u6700\u5927\u63A5\u7D9A\u4F7F\u7528\u6570:
jcaPool.maxConnectionUsageCountHelp=\u63A5\u7D9A\u306F\u6307\u5B9A\u3057\u305F\u56DE\u6570\u30D7\u30FC\u30EB\u3067\u518D\u5229\u7528\u3055\u308C\u3001\u305D\u306E\u5F8C\u9589\u3058\u3089\u308C\u307E\u3059\u30020\u306F\u3001\u3053\u306E\u6A5F\u80FD\u304C\u6709\u52B9\u3067\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002

msg.Error.resourceAdapterNameCannotBeEmpty=\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210\u540D\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002

msg.warning.poolCreatedPingFailed=\u30D7\u30FC\u30EB\u306F\u6B63\u5E38\u306B\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u6B21\u306E\u8B66\u544A\u304C\u3042\u308A\u307E\u3059:
msg.warning.poolSavedPingFailed=\u5024\u306F\u6B63\u5E38\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u6B21\u306E\u8B66\u544A\u304C\u3042\u308A\u307E\u3059:


rar.editPageTitle=\u30B3\u30CD\u30AF\u30BF\u30FB\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u7DE8\u96C6
rar.editPageTitleHelp=\u65E2\u5B58\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u3092\u5909\u66F4\u3057\u307E\u3059\u3002<a href="#{request.contextPath}/jca/resourceAdapterConfigs.jsf">\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u69CB\u6210</a>\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3001\u95A2\u9023\u306E\u3042\u308B\u69CB\u6210\u3092\u4F5C\u6210\u307E\u305F\u306F\u5909\u66F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002

tree.connectorService=\u30B3\u30CD\u30AF\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9

connectorService.editPageTitle=\u30B3\u30CD\u30AF\u30BF\u30FB\u30B5\u30FC\u30D3\u30B9
connectorService.editPageTitleHelp=\u6307\u5B9A\u3057\u305F\u5C5E\u6027\u306F\u3001\u3053\u306EGlassFish Server\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u308B\u3059\u3079\u3066\u306E\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306B\u9069\u7528\u3055\u308C\u307E\u3059\u3002
connectorService.shutdownTimeout=\u30B7\u30E3\u30C3\u30C8\u30FB\u30C0\u30A6\u30F3\u30FB\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8:
connectorService.shutdownTimeoutHelp=\u3088\u308A\u9577\u3044\u6642\u9593\u3092\u8981\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u30FB\u30A2\u30C0\u30D7\u30BF\u306F\u7121\u8996\u3055\u308C\u3001\u30B7\u30E3\u30C3\u30C8\u30FB\u30C0\u30A6\u30F3\u51E6\u7406\u304C\u7D99\u7D9A\u3055\u308C\u307E\u3059
connectorService.classLoadingPolicy=\u30B3\u30CD\u30AF\u30BFClassloading\u306E\u30DD\u30EA\u30B7\u30FC:
connectorService.classLoadingPolicyHelp=\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u4F7F\u7528\u3059\u308B\u30DD\u30EA\u30B7\u30FC\u3002
