#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#create-jms-dest
create.jms.destination.CannotCreateJMSDest=N\u00E3o foi poss\u00EDvel criar um Destino JMS.
create.jms.destination.success=Destino JMS {0} criado.

#create-jms-host
create.jms.host.noJmsHost=Nenhum nome do Host JMS especificado.
create.jms.host.duplicate=J\u00E1 existe um Host JMS nomeado como {0}.
create.jms.host.fail=N\u00E3o foi poss\u00EDvel criar o host jms {0}.
create.jms.host.success=Host jms {0} criado.
create.jms.host=Cria um host JMS

#create-jms-resource
create.jms.resource.noResourceType=Nenhum Tipo de Recurso especificado para o Recurso JMS.
create.jms.resource.noJndiName=Nenhum nome JNDI especificado para o Recurso JMS.
create.jms.resource.InvalidResourceType=Tipo de Recurso inv\u00E1lido especificado para o Recurso JMS.
create.jms.resource.cannotCreateConnectionPool=N\u00E3o foi poss\u00EDvel criar um pool de conex\u00F5es.
create.jms.resource.cannotCreateConnectorResource=N\u00E3o foi poss\u00EDvel criar um recurso de conex\u00F5es.
create.jms.resource.cannotCreateAdminObject=N\u00E3o foi poss\u00EDvel criar um objeto admin.
create.jms.resource.cannotCreateAdminObjectWithRootCause=N\u00E3o \u00E9 poss\u00EDvel criar o objeto admin. Motivo: {0}.
admin.mbeans.rmb.destination_name_invalid=O Recurso do Destino {0} possui um nome de destino inv\u00E1lido {1}
create.jms.resource=Registra o recurso JMS

delete.jms.resource=Remove um recurso JMS
list.jms.resources=Obt\u00E9m todos os recursos JMS

#delete-jms-host
delete.jms.host.noHostName=Nenhum Nome de Host JMS especificado para o Host JMS.
list.jms.host.invalidTarget=Alvo inv\u00E1lido especificado.
list.jms.host.noJmsHostFound=O Host JMS {0} n\u00E3o existe.
delete.jms.host.fail=N\u00E3o foi poss\u00EDvel deletar o host jms {0}.
delete.jms.host=Deletar um Host JMS
list.jms.hosts=Lista todos os Hosts JMS existentes

#delete-jms-resource
delete.jms.resource.noJndiName=Nenhum nome de JNDI definido para o Recurso JMS.
delete.jms.resource.cannotDeleteJMSAdminObject=N\u00E3o foi poss\u00EDvel deletar o Objeto Admin.
delete.jms.resource.cannotDeleteJMSResource=N\u00E3o foi poss\u00EDvel deletar o Recurso do Conector.
delete.jms.resource.cannotDeleteJMSPool=N\u00E3o foi poss\u00EDvel deletar o Pool de Conex\u00F5es do Conector

#list-jms-hosts
list.jms.host.noTarget=Nenhum alvo especificado para o Host JMS.
nothingToList=Nada a listar
list.jms.host.fail=N\u00E3o foi poss\u00EDvel listar os Hosts JMS

#list-jms-resource
list.jms.resources.fail=N\u00E3o foi poss\u00EDvel listar os Recursos JMS

#jmsdestination
create.jms.dest=Cria o destino f\u00EDsico JMS
list.jms.dests=Lista os destinos f\u00EDsicos JMS existentes
delete.jms.dest=Remove um destino JMS
admin.mbeans.rmb.invalid_jms_destname=Nome de destino JMS inv\u00E1lido: {0}
admin.mbeans.rmb.invalid_jms_desttype=Tipo de destino JMS inv\u00E1lido: {0}. O tipo de destino JMS precisa ser ''t\u00F3pico'' ou ''fila''
admin.mbeans.rmb.error_obtaining_jms=Erro ao obter as Informa\u00E7\u00F5es JMS
mqjmx.no_jms_hosts=Configura\u00E7\u00E3o jms-service inv\u00E1lida. Configure um ou mais hosts JMS no jms-service do destino.
list.jms.dest.fail=N\u00E3o \u00E9 poss\u00EDvel listar os Destinos JMS. Certifique-se de que os Message Queue Brokers estejam em execu\u00E7\u00E3o
delete.jms.dest.noJmsDelete=Falha ao deletar o Destino JMS. Verifique se o Destino JMS especificado para dele\u00E7\u00E3o existe.
create.jms.dest.noDestType=Nenhum tipo de Destino especificado para o Destino JMS.
flush.jms.dest.failed=Falha ao fazer flush do Destino JMS devido a {0}
admin.mbeans.rmb.error_purging_jms_dest=Ocorreu um erro ao expurgar o destino f\u00EDsico JMS. O sistema MQ configurado pode n\u00E3o estar sendo executado ou n\u00E3o estar respondendo. Verifique o log do servidor para obter mais informa\u00E7\u00F5es

#jms-ping command
jms-ping.cannotCreateJMSResource=N\u00E3o foi poss\u00EDvel criar uma F\u00E1brica de Conex\u00F5es tempor\u00E1rio ao Host JMS
jms-ping.pingConnectionPoolFailed=Falha ao fazer ping ao Host JMS.
jms-ping.pingConnectionPoolException=Ocorreu uma exce\u00E7\u00E3o ao fazer ping ao Host JMS. Mensagem de Exce\u00E7\u00E3o - {0}
jms-ping.cannotdeleteJMSResource=N\u00E3o foi poss\u00EDvel deletar o Recurso JMS tempor\u00E1rio {0}. Delete-o manualmente.
jms-ping.pingConnectionPoolSuccess=Comando JMS-ping executado com sucesso.

#configure-jms-cluster
configure.jms.cluster.invalidClusterName=N\u00E3o foi configurado nenhum Cluster por este nome
configure.jms.cluster.nojmsservice=Nenhum elemento do Servi\u00E7o JMS na configura\u00E7\u00E3o
configure.jms.cluster.wrongClusterType=Op\u00E7\u00E3o inv\u00E1lida especificada para o clustertype. As op\u00E7\u00F5es v\u00E1lidas s\u00E3o convencional e aperfei\u00E7oada
configure.jms.cluster.wrongConfigStoreType=Op\u00E7\u00E3o inv\u00E1lida especificada para configstoretype. As op\u00E7\u00F5es v\u00E1lidas s\u00E3o masterbroker e shareddb
configure.jms.cluster.wrongStoreType=A op\u00E7\u00E3o configstoretype n\u00E3o pode ser configurada para clusters Aperfei\u00E7oados.
configure.jms.cluster.wrongMessageStoreType=Op\u00E7\u00E3o inv\u00E1lida especificada para o messagestoretype. As op\u00E7\u00F5es v\u00E1lidas s\u00E3o file e jdbc
configure.jms.cluster.wrongmsgStoreType=A op\u00E7\u00E3o messagestoretype n\u00E3o pode ser configurada para clusters Aperfei\u00E7oados.
configure.jms.cluster.integrationModeChanged=Advert\u00EAncia: o modo de integra\u00E7\u00E3o JMS foi alterado de incorporado para local automaticamente.
configure.jms.cluster.cannotChangeIntegrationMode=N\u00E3o \u00E9 poss\u00EDvel alterar o modo de integra\u00E7\u00E3o JMS para LOCAL para o cluster Aperfei\u00E7oado {0}.
configure.jms.cluster.remoteMode=O modo de integra\u00E7\u00E3o JMS deve ser incorporado ou local para executar esse comando. Use o comando asadmin.set para alterar o modo de integra\u00E7\u00E3o
configure.jms.cluster.noEmbeddedModeForEnhancedClusters=N\u00E3o h\u00E1 suporte do modo de integra\u00E7\u00E3o JMS incorporado para clusters Aperfei\u00E7oados. Use o comando asadmin.set para altera o modo de integra\u00E7\u00E3o JMS
configure.jms.cluster.invalidDboptions=As op\u00E7\u00F5es do banco de dados n\u00E3o devem ser especificadas para esta configura\u00E7\u00E3o
configure.jms.cluster.nojdbcurl=Nenhum URL JDBC especificado
configure.jms.cluster.nodbvendor=Nenhum fornecedor do banco de dados especificado
configure.jms.cluster.noConfigStoreType=Nenhum configstoretype especificado. Usando o valor default - masterbroker
configure.jms.cluster.noMessagetoreType=Nenhum messagestoretype especificado. Usando o valor default - file
configure.jms.cluster.fail=N\u00E3o foi poss\u00EDvel configurar o Cluster JMS para o cluster {0}.
configure.jms.cluster.clusterWithInstances=Advert\u00EAncia: certifique-se de ter seguido as instru\u00E7\u00F5es especificadas na documenta\u00E7\u00E3o antes de executar esse comando com essa op\u00E7\u00E3o. A execu\u00E7\u00E3o desse comando sem tomar as precau\u00E7\u00F5es necess\u00E1rias pode levar a um comportamento inconsistente do JMS e corrup\u00E7\u00E3o da configura\u00E7\u00E3o e dos armazenamentos de mensagens.
configure.jms.cluster.success=Configura\u00E7\u00E3o do Cluster JMS atualizada para o Cluster {0}

#change-master-broker
change.master.broker.invalidServerName=Nome do servidor inv\u00E1lido especificado. N\u00E3o existe servidor por este nome
change.master.broker.invalidClusterName=O servidor especificado n\u00E3o est\u00E1 associado a um cluster. O servidor associado ao broker mestre precisa ser parte do cluster
change.master.broker.CannotChangeMB=N\u00E3o foi poss\u00EDvel alterar o broker mestre. {0}
change.master.broker.fail=N\u00E3o foi poss\u00EDvel atualizar o domain.xml com o novo broker mestre
change.master.broker.success=A altera\u00E7\u00E3o do broker mestre foi executada com sucesso para o Cluster {0}.
change.master.broker.errorMsg={0}. Mas isso n\u00E3o afetou a configura\u00E7\u00E3o do broker mestre atual.
change.master.broker.otherErrorMsg=Fa\u00E7a shutdown do cluster, configure-o com o novo broker mestre e reinicie-o.
