#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2011-2013 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#create-jms-dest
create.jms.destination.CannotCreateJMSDest=No se ha podido crear el destino de JMS.
create.jms.destination.success=Destino de JMS {0} creado.

#create-jms-host
create.jms.host.noJmsHost=No se ha especificado ning\u00FAn nombre de host de JMS.
create.jms.host.duplicate=Ya existe un host de JMS denominado {0}.
create.jms.host.fail=No se ha podido crear el host de JMS {0}.
create.jms.host.success=Se ha creado el host de JMS {0}.
create.jms.host=Crea un host de JMS

#create-jms-resource
create.jms.resource.noResourceType=No se ha especificado ning\u00FAn tipo de recurso para el recurso de JMS.
create.jms.resource.noJndiName=No se ha especificado ning\u00FAn nombre de JNDI para el recurso de JMS.
create.jms.resource.InvalidResourceType=Se ha especificado un tipo de recurso no v\u00E1lido para el recurso de JMS.
create.jms.resource.cannotCreateConnectionPool=No se ha podido crear el pool de conexiones.
create.jms.resource.cannotCreateConnectorResource=No se ha podido crear un recurso de conexi\u00F3n.
create.jms.resource.cannotCreateAdminObject=No se ha podido crear el objeto de administraci\u00F3n.
create.jms.resource.cannotCreateAdminObjectWithRootCause=No se ha podido crear el objeto de administraci\u00F3n. Motivo: {0}
admin.mbeans.rmb.destination_name_invalid=El recurso de destino {0} tiene un nombre de destino no v\u00E1lido {1}
create.jms.resource=Registra el recurso de JMS

delete.jms.resource=Elimina un recurso de JMS
list.jms.resources=Obtiene todos los recursos de JMS

#delete-jms-host
delete.jms.host.noHostName=No se ha especificado ning\u00FAn nombre de host de JMS para el host de JMS.
list.jms.host.invalidTarget=Se ha especificado un destino no v\u00E1lido.
list.jms.host.noJmsHostFound=El host de JMS {0} no existe.
delete.jms.host.fail=No se ha podido suprimir el host de JMS {0}.
delete.jms.host=Suprime un host de JMS
list.jms.hosts=Muestra todos los host de JMS existentes

#delete-jms-resource
delete.jms.resource.noJndiName=No se ha definido ning\u00FAn nombre de JNDI para el recurso de JMS.
delete.jms.resource.cannotDeleteJMSAdminObject=No se ha podido suprimir el objeto de administraci\u00F3n.
delete.jms.resource.cannotDeleteJMSResource=No se ha podido suprimir el recurso de conector.
delete.jms.resource.cannotDeleteJMSPool=No se ha podido suprimir el pool de conexiones de conector

#list-jms-hosts
list.jms.host.noTarget=No se ha especificado ning\u00FAn destino para el host de JMS.
nothingToList=No hay nada que mostrar
list.jms.host.fail=No se han podido mostrar los hosts de JMS

#list-jms-resource
list.jms.resources.fail=No se han podido mostrar los recursos de JMS

#jmsdestination
create.jms.dest=Crea el destino f\u00EDsico de JMS
list.jms.dests=Muestra los destinos f\u00EDsicos de JMS existentes
delete.jms.dest=Elimina un destino de JMS
admin.mbeans.rmb.invalid_jms_destname=Nombre de destino de JMS no v\u00E1lido: {0}
admin.mbeans.rmb.invalid_jms_desttype=Tipo de destino de JMS no v\u00E1lido: {0}. El tipo de destino de JMS debe ser ''tema'' o ''cola''
admin.mbeans.rmb.error_obtaining_jms=Error al obtener informaci\u00F3n de JMS
mqjmx.no_jms_hosts=Configuraci\u00F3n de servicio de JMS no v\u00E1lida. Configure uno o varios hosts de JMS en el servicio de JMS del destino.
list.jms.dest.fail=No se han podido mostrar los destinos de JMS. Aseg\u00FArese de que se est\u00E1n ejecutando los brokers de cola de mensajes
delete.jms.dest.noJmsDelete=Fallo al suprimir el destino de JMS. Verifique si existe el destino de JMS especificado para la supresi\u00F3n.
create.jms.dest.noDestType=No se ha especificado ning\u00FAn tipo de destino para el destino de JMS.
flush.jms.dest.failed=Fallo al vaciar el destino de JMS debido a {0}
admin.mbeans.rmb.error_purging_jms_dest=Se ha producido un error al depurar el destino f\u00EDsico de JMS. Puede que el sistema MQ configurado no est\u00E9 en ejecuci\u00F3n o que no responda. Compruebe el log del servidor para obtener m\u00E1s informaci\u00F3n

#jms-ping command
jms-ping.cannotCreateJMSResource=No se ha podido crear una f\u00E1brica de conexiones temporal para el host de JMS
jms-ping.pingConnectionPoolFailed=Fallo al hacer ping en el host de JMS.
jms-ping.pingConnectionPoolException=Se ha producido una excepci\u00F3n al intentar hacer ping en el host de JMS. Mensaje de Excepci\u00F3n: {0}
jms-ping.cannotdeleteJMSResource=No se ha podido suprimir el recurso de JMS temporal {0}. Supr\u00EDmalo manualmente.
jms-ping.pingConnectionPoolSuccess=El comando JMS-ping se ha ejecutado correctamente

#configure-jms-cluster
configure.jms.cluster.invalidClusterName=No se ha configurado ning\u00FAn cluster con este nombre
configure.jms.cluster.nojmsservice=No hay ning\u00FAn elemento de servicio de JMS en la configuraci\u00F3n
configure.jms.cluster.wrongClusterType=Se ha especificado una opci\u00F3n no v\u00E1lida para clustertype. Las opciones v\u00E1lidas son conventional y enhanced
configure.jms.cluster.wrongConfigStoreType=Se ha especificado una opci\u00F3n no v\u00E1lida para configstoretype. Las opciones v\u00E1lidas son masterbroker y shareddb
configure.jms.cluster.wrongStoreType=La opci\u00F3n configstoretype no se puede configurar para los clusters de tipo Enhanced.
configure.jms.cluster.wrongMessageStoreType=Se ha especificado una opci\u00F3n no v\u00E1lida para messagestoretype. Las opciones v\u00E1lidas son file y jdbc
configure.jms.cluster.wrongmsgStoreType=La opci\u00F3n messagestoretype no se puede configurar para los clusters de tipo Enhanced.
configure.jms.cluster.integrationModeChanged=Advertencia: el modo de integraci\u00F3n de JMS ha cambiado de Embebido a Local autom\u00E1ticamente.
configure.jms.cluster.cannotChangeIntegrationMode=No se ha podido cambiar el modo de integraci\u00F3n de JMS a LOCAL para el cluster mejorado {0}.
configure.jms.cluster.remoteMode=El modo de integraci\u00F3n de JMS debe ser Embebido o Local para ejecutar este comando. Utilice el comando asadmin.set para cambiar el modo de integraci\u00F3n
configure.jms.cluster.noEmbeddedModeForEnhancedClusters=El modo de integraci\u00F3n de JMS Embebido no est\u00E1 soportado para los clusters de tipo Mejorado. Utilice el comando asadmin.set para cambiar el modo de integraci\u00F3n de JMS
configure.jms.cluster.invalidDboptions=No se deben especificar opciones de base de datos para esta configuraci\u00F3n
configure.jms.cluster.nojdbcurl=No se ha especificado ninguna URL de JDBC
configure.jms.cluster.nodbvendor=No se ha especificado ning\u00FAn proveedor de bases de datos
configure.jms.cluster.noConfigStoreType=No se ha especificado ning\u00FAn valor de configstoretype. Utilizando el valor por defecto: masterbroker
configure.jms.cluster.noMessagetoreType=No se ha especificado ning\u00FAn valor de messagestoretype. Utilizando el valor por defecto: file
configure.jms.cluster.fail=No se ha podido configurar el cluster de JMS para el cluster {0}.
configure.jms.cluster.clusterWithInstances=Advertencia: aseg\u00FArese de haber seguido las instrucciones especificadas en la documentaci\u00F3n antes de ejecutar este comando con esta opci\u00F3n. Si ejecuta este comando sin las precauciones necesarias, se puede producir un comportamiento inconsistente de JMS y la corrupci\u00F3n de la configuraci\u00F3n y los almacenes de mensajes.
configure.jms.cluster.success=Se ha actualizado la configuraci\u00F3n de cluster de JMS para el cluster {0}

#change-master-broker
change.master.broker.invalidServerName=Se ha especificado un nombre de servidor no v\u00E1lido. No hay ning\u00FAn servidor con este nombre
change.master.broker.invalidClusterName=El servidor especificado no est\u00E1 asociado a ning\u00FAn cluster. El servidor asociado al broker maestro debe formar parte del cluster
change.master.broker.CannotChangeMB=No se ha podido cambiar el broker maestro.{0}
change.master.broker.fail=No se ha podido actualizar domain.xml con el nuevo broker maestro
change.master.broker.success=El cambio de broker maestro se ha ejecutado correctamente para el cluster {0}.
change.master.broker.errorMsg={0}. Esto no afecta a la configuraci\u00F3n del broker maestro actual.
change.master.broker.otherErrorMsg=El cluster se debe cerrar y configurar con el nuevo broker maestro y, a continuaci\u00F3n, se reinicia.
